[
  {
    "sku": "beauty_and_personal_care_0",
    "title": "Advanced Clinicals Bulgarian Rose Anti Aging Rescue Cream Face & Body Moisturizing Skin Care Lotion, Brightening Skincare Moisturizer For Dry Skin, Age Spots, & Improving Skin Radiance, Large 16 Oz",
    "price": 14.99,
    "rating": 4.4,
    "rating_count": 71114,
    "image_url": "https://m.media-amazon.com/images/I/41Guk0TAyvL.jpg",
    "description": "Advanced Clinicals Bulgarian Rose Oil Anti-Aging Cream for Face, Hands, and Necks 3-in-1 formula involves moisturizing, restoring and nourishing skin that is showing the effects of aging such as wrinkles, sagging, age lines, and age spots. Bulgarian Rose Oil Cream is vital to keeping your skin moisturized and hydrated Bulgarian Rose Oil inhibits water loss in the skin and lowers the concentration of cortisol (a stress hormone) in the body. Composition that includes Vitamin E, Avocado Oil, and Glycerin: all of which act as an emollient and moisturizer that keeps your skin not only moist, but soft to the touch. It makes your skin looks healthier and attractive, removing the ashy skin and dry skin looks. Non-greasy formula leaves skin feeling and looking great after each use. Bulgarian rose oil is a natural skin toner because of its astringent properties. It helps tone skin which reduces excess oiliness and tightens large pores. Paraben-free. Trusted formula. Manufactured in the USA. Not tested on animals. 100% Satisfaction Guaranteed.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_1",
    "title": "Revlon Compact Hair Dryer | 1875W Lightweight Design, Perfect for Travel, (Yellow)",
    "price": 13.99,
    "rating": 4.6,
    "rating_count": 67805,
    "image_url": "https://m.media-amazon.com/images/I/31Bxh+6VAdL.jpg",
    "description": "Dare to be new kind of bold with REVLON Hair Tools. Whether you're after salon-style blowouts, one-of-a-kind waves and curls, the perfect hair accessory, or you want to reinvent your style, REVLON has the tools to take your hair where it's never been before. The REVLON Essentials Compact Hair Dryer allows you to pack this styling tool pretty much anywhere: carry-on luggage, your favorite gym duffel, or a trusty overnight bag. Despite its size, this lightweight hair dryer doesn't compromise on performance. Built with 1875 Watts, a powerful and steady airflow is enhanced with IONIC TECHNOLOGY to help reduce frizz and static, leaving hair looking conditioned, smooth, healthy and full of shine. Two heat and speed settings provide drying and styling flexibility and control, so you can achieve any look you want. Protective anti-slip bumpers provide extra care when styling, giving you better grip and more styling control. This dryer is complete with a hanging ring for easy and convenient storage. Dare to go there with REVLON Hair Tools. DRY, STYLE & GO: Salon-style blowouts, one-of-a-kind waves and curls, and the perfect hair accessory to reinvent your style. REDUCE FRIZZ: Ionic Technology helps reduce the hair frizz and static, leaving hair conditioned and smooth LIGHTWEIGHT: Easy cleaning and maintenance, and compact and lightweight design. VERSATILITY: Quickly dry and style your hair with 2 heat/speed settings to suit your personal needs. VOLTAGE: For 120 volts outlets only. 1875 Watts. Wattage of this appliance may vary depending on the location of use.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_2",
    "title": "NYX PROFESSIONAL MAKEUP Wonder Stick, Face Shaping & Contouring Stick - Medium Tan",
    "price": 13.35,
    "rating": 4.2,
    "rating_count": 26000,
    "image_url": "https://m.media-amazon.com/images/I/21jDudr9nDL.jpg",
    "description": "Meet the super face shaping duo. Our fan favorite Wonderstick dual-ended contour stick is back and better than ever! The Wonderstick's lighter shade mimicks a sunlit glow, while the darker shade enhances and sculpts the structure of your face. Shape, brighten & blend like a wonder with eight new highly pigmented shade combinations! First swipe the deeper end to shape & sculpt, then apply the lighter end to instantly brighten & highlight. Blend well for a gorgeous finish! This cruelty free & vegan formula is ultra creamy & pigmented, which allows for beautiful blending. Customize your look with super buildable shades. A contour stick like no other! The Wonderstick is easy to use and provides a more precise highlight & contour. Pair with Wonderstick Blush to add a flush of color & Wonder Pencil for more targeted application! Highlight and Contour: The all-new Wonder Stick is a creamy contour stick that also doubles as highlighter makeup; This dual-ended face shaping stick is vegan and cruelty-free and blends well for a natural finish Contour and Highlight Made Easy: First, swipe the deeper shade along the face’s natural contours, then apply the lighter shade to the highest points of the face to instantly brighten and highlight Face From Foundation To Finish: Complete your makeup look with our full line of face products to aid in color correction and coverage from concealer, blush, bronzer, foundations and contouring to palettes and powders Cruelty Free Cosmetics: We believe animals belong in our arms, not in a lab; All of our makeup is certified and acknowledged by PETA as a cruelty free brand; We don't test any of our products on animals Discover NYX Professional Makeup: Try all of our professional makeup products today from eyeshadow, eyeliner, and false lashes to liquid lipstick, lip gloss, primer, concealer, setting sprays and eyebrow makeup",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_3",
    "title": "DUO Strip Eyelash Adhesive for Strip Lashes, Dark Tone, 0.25 oz, 1-Pack",
    "price": 4.86,
    "rating": 4.5,
    "rating_count": 29556,
    "image_url": "https://m.media-amazon.com/images/I/41koOvB-7LL.jpg",
    "description": "Duo Eyelash Adhesive, Dark Tone, Adding fake eyelashes is made easy with this Ardell duo eyelash adhesive. DUO is the best selling eyelash adhesive in the industry! Its designed for use with Ardell eyelashes, one tiny drop is all you need for an entire lash. This waterproof eyelash adhesive dries quickly and keeps your lashes in place all day long providing comfortable all day wear for strip and individual lashes. It goes on dark and dries dark for easy application. Just squeeze a tiny line of DUO adhesive along the lash band, wait 30 seconds and apply to lash. COMPLETE YOUR DRAMATIC AND GLAMOROUS LOOK: Recommended by professional lash artists, DUO Strip Eyelash Adhesive, Dark Tone is ideal for smokey eye makeup, dark color lashes, thick and voluminous fake lashes. Many users boast that they could entirely skip the process of applying mascara for up to two weeks after using the false lash glue. It’s suitable for every eye shape, color, and size, and will make natural looks sparkle and dive looks even more luscious! APPLIES DARK AND DRIES BLACK: With its rapid setting time that is faster than other adhesives, you will create the perfect lash look quickly and effectively. Perfect for consumers who want to extend the longevity of their false eyelash. It creates a black stronghold that glides effortlessly while it dries dark, so if you make a mistake, it just looks like you’re wearing liner. It dries faster with the superior and effective lash bonding formula! No more faux lash fall offs! MADE IN THE USA, CRUELTY-FREE STRIP LASH ADHESIVE: From DUO - the best selling eyelash adhesive in the World, here’s the fake lash’s best buddy adhesive to get your strip lash the highest quality finish! Specially made by lash experts, this medical-grade DUO False Lash Adhesive Dark dries fast and is safe for contact lens wearers and sensitive eyes! Loved by lash experts and fake lash lovers, they are 100 % cruelty-free,paraben-free, sulfate-free and proudly made in the US. HOLDS STRIP",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_4",
    "title": "Lip Smacker Crayola Lip Balm Party Pack 8 Count, Cotton Candy, Orange, Sherbert, Watermelon, Berry, Apple, Banana",
    "price": 20.1,
    "rating": 4.8,
    "rating_count": 25163,
    "image_url": "https://m.media-amazon.com/images/I/51aZCO3M1XL.jpg",
    "description": "A five-piece liquid lip gloss collection that's all you need for a perfectly brilliant smile. Flavors included: Firefly red punch, wild strawberry, plumsicle, aquamarine magic, green jellybean. LIP SMACKER plus CRAYOLA: Enjoy your favorite Crayola colors and keep lips soft with this set of 8 fun, flavored balms. Share with your friends or collect them all Perfect for party favors or as a gift. MOISTURIZING, SOFT SHINE: Our classic, conditioning formulas smooth & moisturize your lips. Lip Smackers help make your lips glossier Keep lips soft & shiny, & help prevent chapped & cracked lips. HYDRATE & PROTECT: Lip Smackers flavored lip balms come in a wide variety of flavors to delight your senses & keep lips smooth, moisturized, & protected. Makes a great party favor LIP SMACKIN': We've been your trusted choice for flavored lip balms & lip glosses since we introduced the first flavored lip balm on the market. From cotton candy to Dr. Pepper, we've got your flavor BEST FLAVOR FOREVER: Since 1973, we have put smiles on lips around the globe. We hope our authentic flavors, scents, & colorfully designed balms, glosses, nail polishes, & makeup sets make you happy",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_5",
    "title": "DERMORA Foot Peel Mask - 2 Pack of Large Size Skin Exfoliating Foot Masks for Dry, Cracked Feet, Callus, Dead Skin Remover - Feet Peeling Mask for baby soft feet, French Lavender Scent",
    "price": 11.85,
    "rating": 4.4,
    "rating_count": 68264,
    "image_url": "https://m.media-amazon.com/images/I/41wUoip7JqL.jpg",
    "description": "SOFT SMOOTH FEET - Treat your dry, hard, scaly, cracked feet to some tender love and self-care with our foot peeling mask that will leave your skin satisfyingly soft and silky smooth. EASY EXFOLIATING - Simply slide your feet into the foot mask socks, wait 60 minutes, and watch as your feet start to peel within 6-11 days, leaving you with super soft feet from heel to toe! BOTANICAL BLEND - Made with a blend of fruit acids and extracts, our feet mask works to slough away dead skin cells on your soles to help repair rough heels. UNIVERSAL FIT - A foot exfoliator that is ideal for both men and women. Our foot masks fit feet of most shapes and sizes up to a size 11. CUSTOMER HAPPINESS - Whether you're buying this baby foot peel mask for yourself or as a holiday gift, our customer support team is available 24/7 to assist you with all your needs.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_6",
    "title": "BOLDIFY Hair Fibers for Thinning Hair (BLACK) Undetectable & Natural - 12gr Bottle - Completely Conceals Hair Loss in 15 Sec - Hair Thickener & Topper for Fine Hair for Women & Men",
    "price": 14.95,
    "rating": 4.3,
    "rating_count": 25454,
    "image_url": "https://m.media-amazon.com/images/I/41+2pIhkcLL.jpg",
    "description": "Clump-proof fibers for a real hair effect & undetectable finish: Boldify Hair Thickening Fibers are the premium bald spot cover up for women and bald spot cover up for men that instantly disguise thinning and patchiness across the temples, part, crown, and sides. Our advanced hair powder fibers boast follicle-mimicking molecules that allow seamless blending and a natural, real-hair finish. Better than black hair spray color temporary and hair shading sponge pen waterproof options in every way! Industry-leading worry-free Color Match Guarantee: Simply choose the hair thickener fibers shade you think will most closely match your natural hair color, buy it, and try it. If the color’s not quite right, simply let us know...our dedicated in-house Customer Care Team will use your feedback to help find your perfect match, and get it to you as quickly as possible at no additional cost! Superior products made better: Our natural, Cruelty-Free Hair Building Fibers are made under strict quality standards in our ISO 9001 facility. We responsibly and sustainably source only the finest ingredients to create a superior - yet affordable - product that works far better than other overpriced keratin fibers! Hassle Free Satisfaction Guarantee: We’re so sure that you’ll regain your confidence and adore your results that we back each bottle with our comprehensive risk-free guarantee. Buy and try a bottle of Boldify Fibers and love it - or we’ll refund the purchase price upon request. Period. No hassle, no questions asked, no return required! Easy to apply, mishap-free fibers that outlast the day: Wash, fully dry, and style hair as usual. Shake fibers over desired areas and pat gently to set in place for a noticeably thicker look, instant scalp coverage, and a fuller finish that lasts all day. Set with the spray of your choice to maximize weather and sweat resistance; easily and cleanly remove in a single shampoo.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_7",
    "title": "Newcally Natural Look Lashes Mink 3D Fluffy Wispy False Eyelashes Short Light Volume Fake Eye Lashes Pack 14 Pairs Reusable Soft Faux Mink Eyelashes",
    "price": 9.45,
    "rating": 4.4,
    "rating_count": 34981,
    "image_url": "https://m.media-amazon.com/images/I/51e6YA-A4nL.jpg",
    "description": "The natural false eyelashes are fluffy and soft, as light as a feather. They will not burden your eyes, and will have a nice sense of comfort when wearing. The fake eyelashes can be used for everyday wear, but also for dating, wedding, as gifts, travel, etc. High-quality product should be so omnipotent. Newcally false eyelashes are handcrafted from the finest synthetic fibers. 100% cruelty-free and vegan. After removing the false lashes from the lash tray, you need to clean the glue off. These glues are only there to hold the lashes on the tray, not to bring to your eyes. Please do not miss out on this affordable false eyelashes pack! If you have any ideas about Newcally product, please feel free to contact us.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_8",
    "title": "KISS Looks So Natural Trio Lash Medium Combo Pack, False Eyelashes with Tapered End Technology, 3D Lengths & Angles, Easy Grip Tray with Built-In Glue Pocket, 30 Trio Lashes in Short & Medium Lengths",
    "price": 7.36,
    "rating": 4.4,
    "rating_count": 25694,
    "image_url": "https://m.media-amazon.com/images/I/41g5LkLpSVS.jpg",
    "description": "With both short and medium lengths, voluminous Trio Lashes create a fuller, more flattering look. Just add them where you need them, according to look you want to achieve.Tray with built-in glue pocket (adhesive sold separately). Voluminous Trio Lashes: 30 tapered end trio lashes with 3D angles come in short and medium lengths; Each trio has 3 clusters of lashes knotted onto a band in varied lengths and fully customizable density; Use with KISS lash glue (sold separately) Easy Application: Get a customized lash extensions look three times faster and easier than it is to apply individual lashes; They come in an easy grip tray with a built-in glue pocket; These lashes are cruelty free, reusable and contact lens friendly Number 1 for False Eyelashes: KISS offers an array of options to get the look of lash extensions in minutes: With magnetic lashes and eyeliner, Falscara, faux mink lashes, matte finish, and strip lashes – KISS has it all DIY Lash Looks That Wow: KISS has everything you need for an easy-to-apply at-home lash extension look; An array of lengths and styles in singles, doubles, and multipacks; Saves you trips to the salon; Applicators, glues, and removers also sold separately Be Kiss Confident: Thanks to groundbreaking innovations, KISS is a market leader in false eyelashes; KISS Magnetic Eyeliner Lashes, Falscara, and GLUEliner are true game changers; KISS empowers women who wear false eyelashes to “Bring the Salon Home\"",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_9",
    "title": "L.A. Girl Pro Conceal HD Concealer, Green Corrector, 0.28 Ounce",
    "price": 4.99,
    "rating": 4.3,
    "rating_count": 38593,
    "image_url": "https://m.media-amazon.com/images/I/31+s2HK6wpL.jpg",
    "description": "Crease-resistant, opaque coverage in a creamy yet lightweight texture. The long-wearing formula camouflages darkness under the eyes, redness and skin imperfections. Provides complete, natural-looking coverage, evens skin tone, covers dark circles and minimizes fine lines around the eyes. This blend able and buildable formula provides the ultimate, customizable coverage. This must-have concealer includes a soft brush-tip for easy application. Camouflages the appearance of skin imperfections Evens out skin tone Covers dark circles Minimizes fine lines",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_10",
    "title": "Tree of Life Vitamin C Serum for Face - 1 Fl Oz Skin Care Serums - Moisturizing Vitamin E for Brightening & Smoothing Dry Skin, Anti-Aging, Wrinkles & Dark Spot, Sensitive Skin - Dermatologist-Tested",
    "price": 15.49,
    "rating": 4.4,
    "rating_count": 32146,
    "image_url": "https://m.media-amazon.com/images/I/51vqe1m1N0L.jpg",
    "description": "BRIGHTEN, FIRM AND SMOOTH: Moisturizer packed with antioxidants to brighten skin and reduce dark spots to give you that all over glow. Elevate your personal care products. CLEANER SKIN CARE PRODUCTS: We're redefining face mask skin care with vitamin C that brightens, organic aloe and jojoba for moisturizing, witch hazel that minimizes appearance of pores, and much more. FACIAL SKIN CARE PRODUCTS FOR YOUR DAILY ROUTINE: Our serums are lightweight, not sticky or oily, and wear well under makeup. For best results, use our brightening serum prior to your favorite sunscreen. A FACE MOISTURIZER DEFINED BY GOODNESS: Our hydrating serum is Certified Cruelty Free, Certified Vegan, and contains no parabens. When it comes to serums for skin care, it's all good. QUALITY AT THE CORE: Tree of Life was built by a scientist with the mission of making better, more affordable self care products. Our vitamin c serum for your face is guaranteed or your money back.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_11",
    "title": "New York Biology Dead Sea Mud Mask for Face and Body Infused with Lavender - Spa Quality Pore Reducer for Acne, Blackheads and Oily Skin - Tightens Skin for A Healthier Complexion - 8.8 oz",
    "price": 14.95,
    "rating": 4.5,
    "rating_count": 45604,
    "image_url": "https://m.media-amazon.com/images/I/41YNhskxsDL.jpg",
    "description": "BEST HOLIDAY GIFT GUIDE: works for all skin types, including dry, normal, oily, combination, sensitive, and irritated. This daily acne treatment has been designed to be highly effective yet gentle enough for everyday use and is a great gift for the holidays 2022. MINERAL-INFUSED Clarifying Mud Mask is based on an advanced formula composed of Dead Sea mineral mud, aloe vera, calendula oil, Vitamin E and Jojoba oil that gently purifies and cleans clogged pores. PURE DEAD SEA MUD helps cleanse the skin and provide a soothing sensation. Rich in minerals, it aids skin renewal, creating a gentle exfoliation effect that removes excess oil, toxins, and dead skin cells for a softer feel and radiant glow. REDUCES PORES & ABSORBS EXCESS OIL our Spa Quality Mud removes dead skin cells and toxins to reveal fresh, soft skin and is also known to stimulate blood circulation. OUR DEAD SEA FACIAL MASK is made with high quality ingredients and is alcohol, parabens, sulfates free and Cruelty Free.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_12",
    "title": "MANIC PANIC Voodoo Blue Hair Dye - Classic High Voltage - Semi Permanent Dark Cyan Hair Color With Greenish Undertones - Vegan, PPD And Ammonia-Free (4oz)",
    "price": 14.99,
    "rating": 4.1,
    "rating_count": 20477,
    "image_url": "https://m.media-amazon.com/images/I/517r7+KwUQL.jpg",
    "description": "Voodoo Blue Hair Dye Color; A Dark Cyan Hair Dye With Greenish Undertones; Voodoo Blue Can Give Hints Of Teal To Virgin Unbleached Hair; For Best Results We Recommend Lightening Hair To A Very Light Level Nine Blonde Mixable Colors And Tones; MANIC PANIC Hair Colors Are Safe To Mix To Create Custom Shades Making The Possibilities Of Shades Endless; Combine Any Formula With The Pastelizer To Create Soft Trendy Pastel Hues; Ready To Use No Developer Required Semi Permanent Hair Dye; Formula Gradually Fades In Four To Six Weeks Because It Does Not Penetrate The Cortex Of Your Hair But Simply Rests On Top Of The Hair Shaft Cruelty Free And Vegan Formula; This Color Cream Hair Dye Features Vegan Ingredients Tested On Celebrities Not Animals; Hair Color Is Ammonia Free Paraben Free Gluten Free Resorcinol Free Phthalate Free And Peta Accredited For Best Results; Vibrant Color Results Are Best Achieved By Applying To Hair That Has Been Pre Lightened With MANIC PANIC Flash Lightning Bleach Kits; Bleaching Thoroughly To A Level Nine Or Ten Before Dyeing Is Recommended For The Best Results",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_13",
    "title": "Dermacol - Full Coverage Foundation, Liquid Makeup Matte Foundation with SPF 30, Waterproof Foundation for Oily Skin, Acne, & Under Eye Bags, Long-Lasting Makeup Products, 30g, Shade 208",
    "price": 19.49,
    "rating": 4.0,
    "rating_count": 22650,
    "image_url": "https://m.media-amazon.com/images/I/414qWr005zL.jpg",
    "description": "Provides Extreme Coverage - Achieve the flawless skin you’ve always dreamed of with this full-coverage liquid foundation. Our foundation makeup conceals dark under-eyes, skin discolorations, pimples, acne scars, surgical bruising, and even tattoos! Your Reliable, Waterproof Skin Foundation - When you’re set to go, you need a compact makeup product that can keep up. Bid goodbye to constantly retouching your face makeup! Use this long-lasting spf foundation to keep your face vibrant all day. 17 Color Match Foundation for You - Dermacol’s makeup foundation full coverage formula comes in 17 shades, which makes it the ideal base makeup for any skin type. We provide a broad range of matte makeup from pale foundation to dark skin foundation. Cover Up Makeup that Lasts - There’s nothing this liquid foundation makeup cannot hide. Use just enough foundation to cover acne marks, discoloration, and scars. Besides being a foundation that doesn't rub off, one 30g tube lasts long enough, too. Safe Foundation Liquid Makeup for All - Dermacol’s commitment to your skin goes beyond smooth coverage. Our foundation makeup professional formulas do not contain preservatives or harmful chemicals to promote a healthy-looking complexion.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_14",
    "title": "Wet-Brush Detangling Hair Brush - Purple - 2 Pack Detangler - Comb for Women, Men & Kids - Wet or Dry – Removes Knots and Tangles, Best for Natural, Straight, Thick & Curly Hair – Pain Free",
    "price": 15.95,
    "rating": 4.8,
    "rating_count": 33027,
    "image_url": "https://m.media-amazon.com/images/I/41K8s16ys5L.jpg",
    "description": "Soft flexible IntelliFlex bristles detangle hair with ease. Works great on wet or dry hair. Perfect for men, women and kids. For all hair types. Great for hair extensions and wigs. Soft flexible IntelliFlex bristles detangle hair with ease. Works great on wet or dry hair. They are firm enough to comb through knots Perfect for men, women and kids. For all hair types. Great for hair extensions and wigs.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_15",
    "title": "Degree Men Antiperspirant Deodorant 48-Hour Odor Protection Cool Rush Mens Deodorant Stick 2.7 oz, Pack of 6",
    "price": 11.98,
    "rating": 4.7,
    "rating_count": 44483,
    "image_url": "https://m.media-amazon.com/images/I/41Mpb3ql7bL.jpg",
    "description": "Degree Cool Rush helps keep you fresh and dry, no matter what. This mens antiperspirant has 48H non-stop protection, non-stop confidence with a scent that combines an energizing burst of crisp, arctic freshness in Cool Rush men’s fragrance and. Whether you’re having a long day in the office, playing sports outdoors or working out in the gym, you can be confident that with this mens deodorant you’ll be protected from underarm sweat and body odor. It comes in an easy-to-use applicator stick - you simply turn the dial to raise the stick, apply a thin layer to your underarms, and you’re ready for anything. Every time you move, Degree men antiperspirant deodorant keeps you fresh and free from strong body odor and underarm sweat. This powerful antiperspirant deodorant responds when you need it most. Whatever you do, however you do it, Degree wants to help inspire the confidence in you to move more, and with this deodorant for men, it’ll provide you the confidence that sweat and odor will not get in your way of your progress. Degree. It won’t let you down. Degree’s Cool Rush antiperspirant deodorant with 48H non-stop protection, non-stop confidence, making it one of their best deodorant for men that’s strong enough to keep up with you all day This mens deodorant gives an energizing burst of crisp, arctic freshness in Cool Rush men’s fragrance and 48hr odor protection. This deodorant stick is one of Degree's best smelling deo In an invisible solid formula that goes on clear, this swipe-on Degree men antiperspirant deodorant protects you from sweat and body odor for up to 48 hours This antiperspirant for men is designed to be the best deodorant for sweat through any extreme sport, workout, and alternative forms of movement. This anti perspirant keeps up with any step you take Being the number 1 deodorant brand by volume, Degree’ best deodorant for men is known to give you the ultimate freshness that’s activated when you move, however you move At Degree, we want to inspire th",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_16",
    "title": "SARLA Invisible Wire Hair Extensions Medium Ash Brown Long Wavy Curly Synthetic Hair Piece for Women Adjustable Transparent Headband 22 Inch No Clip",
    "price": 9.99,
    "rating": 3.5,
    "rating_count": 27230,
    "image_url": "https://m.media-amazon.com/images/I/5107Wuw9v4L.jpg",
    "description": "★ Look Your Best ★ Achieve the perfect look with SARLA's invisible hair extensions - light, comfortable, and easy to wear. No clips, no fuss, just beautiful hair in minutes! ★ High-Quality Material ★ Made with 100% Japan high temperature fiber, our hair extensions can be curled or straightened (heat resistance range: 300℉-350℉ or 150-180℃). Package includes a synthetic hair extension, a rat tail comb, and an adjustable transparent wire for replacement. ★ Easy to Apply ★ Adjust the transparent wire to fit your head size, brush your natural hair, section off your hair at the crown, tie it into a bun at the top of your head, and apply the extension. Blend it with your own hair for a natural look. For more details, watch our video or see the product descriptions below. ★ Tips for a Natural Look ★ Color may vary by monitor, so select a similar color based on your tail for a more natural look. Hair color is sensitive to light, so choose the color in a place with good light or refer to our second picture of the color swatch. Hair extensions may get tangled, so use a spray bottle with conditioner and water or just water to prevent tangles. ★ Satisfaction Guaranteed ★ Amazon offers a return or exchange service, and we offer a 24-hour customer service to solve any product problems. Buy with confidence and get the perfect look with SARLA hair extensions!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_17",
    "title": "Tree of Life Vitamin C Serum, Retinol Serum and Hyaluronic Acid Serum for Brightening, Firming, & Hydrating for Face - 3 Ct x 1 Fl Oz - Total Skin Reset, Anti Aging Serums, Dark Spot Correcting",
    "price": 23.95,
    "rating": 4.4,
    "rating_count": 66751,
    "image_url": "https://m.media-amazon.com/images/I/51tGOuRhcFL.jpg",
    "description": "A power trio for your best skin yet. Use the Vitamin C Serum followed by the Hyaluronic Acid Serum in the morning to visibly brighten, reduce dark spots, smooth, and hydrate the skin. Reach for the Retinol Serum followed by the Hyaluronic Acid Serum in the evening to reduce the appearance of fine lines and wrinkles, fade the look of age spots, support elasticity, and soothe the skin. All of our products are cruelty-free, dermatologist-tested, and made for all skin types and tones. Plus, they're packed with thoughtfully-chosen ingredients you can feel good about. Directions: Apply Vitamin C Serum in the morning followed by Hyaluronic Acid Serum. Apply Retinol Serum in the evening followed by Hyaluronic Acid Serum. Apply 3-5 drops to clean, dry skin on face, neck, and décolleté. Use sunscreen daily, as retinol increases sun sensitivity. For best results, follow serums with a moisturizer. True radiance for the taking. Tree of Life is all about clean, effective, attainable skincare — and we won't give you anything less. Celebrate Father's Day by pampering Dad with Tree of Life's Total Skin Reset 3pk that keeps his skin healthy and rejuvenated. Show him self-care matters and elevate his daily routine!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_18",
    "title": "Jergens Natural Glow Face Fair to Medium with Jergens Natural Glow Firming Fair to Medium",
    "price": 20.46,
    "rating": 4.5,
    "rating_count": 20144,
    "image_url": "https://m.media-amazon.com/images/I/41qKdK1sF8L.jpg",
    "description": "Sun protected skin is healthy skin, and a safe, natural looking glow is possible with Jergens Natural Glow Oil-Free Daily Moisturizer for Face with Broad Spectrum SPF 20. This lightweight, oil-free moisturizer that is specially formulated for the face uses color-enhancing ingredients, nourishing emollients, and broad spectrum sunscreen to deliver flawless, natural looking color to the skin while keeping it hydrated and protected from everyday exposure to the sun. Applying at least once a day will enhance your natural fair skin tone within several days, and in about one week, you'll have a beautiful, natural looking glow. Use this natural face tanner in the morning under makeup, or at night before going to bed for gorgeous fair skin results. Recommended by the Skin Cancer Foundation, Kao USA Jergens Natural Oil-Free Daily Moisturizer for Face with Broad Spectrum SPF 20 protects against both UVA and UVB rays. Oil free face moisturizer with spf provides skin hydration and sun protection for fair to medium skin tones. FLAWLESS SELF TANNING: Create a flawless tan for gradual, natural looking color before, or after, the beach PROTECTION FROM THE SUN: Our lightweight Natural Glow moisturizer includes broad spectrum UVA and UVB protection and keeps your skin hydrated ACHIEVE A HEALTHY LOOKING TONE: With Jergens Daily Moisturizer's blend of nutrients and skin tone enhancers, expect a beautiful, natural looking facial tan within a week; Try going makeup free in 7 days Flawless Self Tanning: Create a Flawless Tan for Gradual, Natural Looking Color Before, or After, the Beach Gradual Tanning Lotion: Our Jergens Natural Glow+FIRMING Moisturizer Will Gradually Enhance and Deepen Your Natural Skin Tone to Provide Hassle Free, Streak Free Color Combined Visible Cellulite Reduction: With Collagen, Elastin, and Green Tea Infusions, Our Fast Acting Formula Will Help Reduce Cellulite Appearance Within 7 Days",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_19",
    "title": "Beetles Gel Nail Polish Set- 6 Colors White Red Gel Nail Polish Kit Nail Gel Polish Set Soak Off LED Nail Lamp Required Gel Nail Kit Nail Art Gift for Women",
    "price": 13.99,
    "rating": 4.5,
    "rating_count": 51633,
    "image_url": "https://m.media-amazon.com/images/I/41mTIjjsILL.jpg",
    "description": "Best Gifts for Women: 6 colors beautiful shades of popular and trendy colors suitable for all seasons and daily routine life! This natural nude gray pink glitter gel polish set is ESSENTIAL for everyone! Soak off LED Gel Nail Polish: The colors of Pink Neutral Shades Kit - all seasons gel nail polish set need to be cured under LED nail dryer. Base and Topcoat required. Average for LED nail lamp 60-120 secs. Easy Application and Good Tenacity: The series of pink brown gold glitter gel nail polish sets are long-lasting for 21+ days with perfect shine under proper application - With base gel top coat under the full application process. ❤Kindly note: After opening valid for 12 months. Environmental & Healthy: The 6pcs classic pink nude neutral gel polish colors are made from 9 Toxin Free Ingredient which makes it safe and has low odor. No harsh ingredients or adhesives lead to damaged nails. WARNING: May cause an allergic reaction by skin contact. Read directions for use carefully. Professionally formulated and only used for nails. Avoid contact with eyes, mouth, and skin. In case of contact with them, rinse immediately with water. If there is any incident, contact the doctor immediately. Stop using the product if redness and itching develop. Keep out of the reach of children.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_20",
    "title": "The Blissful Dog Bernese Mountain Nose Butter – Dog Nose Butter, 2 Ounce",
    "price": 12.0,
    "rating": 4.6,
    "rating_count": 19423,
    "image_url": "https://m.media-amazon.com/images/I/51fh+tg+plL._AC_.jpg",
    "description": "Many dogs have a tendency toward a dry, crusty nose condition, frequently called nasal hyperkeratosis. While any dog can have this condition some breeds have even more of a predisposition toward dry noses; French Bulldogs, Boxers, Pugs, Bulldogs, most Bully type and Mastiff breeds and their mixes. NOSE BUTTER was developed specifically for this condition. NOSE BUTTER For Dry or Crusty Dog Noses. All natural, rich moisturizers soften and smooth your dog's dry, crusty, cracked nose. NOSE BUTTER is individually handcrafted in far northern Minnesota (yes, it is science fiction cold in the winter) using all natural and organic good stuff: shea butter, olive oil, castor oil, avocado oil, almond oil, coconut oil, beeswax, cocoa seed butter, a dash of essential oils and love. NOSE BUTTER USAGE: DAB a bit onto your dog's nose 1-3x a day for 2-3 days (until nose improves) and then as needed for maintenance (usually1-2x a week). DISTRACT with a treat (keeps them from licking NOSE BUTTER off while it moisturizes).DONE! Complete directions, tips, hints and Dog Nose info is available. Dog Nose Butter - Moisturizes your dog's nose, reviving and softening the nose with layers of all-natural butters and oils Handcrafted in Far Northern MN Using All-Natural Ingredients Available in 1,2,4, 8 and 16 ounces tins,.15 ounces and .50 ounces tubes Dog Nose Cream - Available with 70 Dog Breed Labels + Every Dog Nose and Three Cute Puppies Easy dog nose care - Easy to apply; Dab onto your dog's nose; that's it! Enriched with shea butter, this dog nose moisturizing butter brings relief to your dog’s dry nose. Non-toxic, no active ingredients, no harm if ingested",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_21",
    "title": "NIVEA Essentially Enriched Body Lotion,Dry to Very Dry Skin, 16.9 Fl Oz, Package may vary",
    "price": 5.81,
    "rating": 4.7,
    "rating_count": 18904,
    "image_url": "https://m.media-amazon.com/images/I/31NqIe10aPL.jpg",
    "description": "With NIVEA Essentially Enriched Body Lotion, nourished and deeply moisturized skin is not as far away as you think. We know how hard it can be to find a lotion that gives dry skin the deep moisture it needs. Infused with our Deep Moisture Serum and Almond Oil, the rich formula intensively nourishes to lock in deep moisture and give noticeably smoother skin for 48 hours. Designed for dry to very dry skin, this full body lotion will noticeably reduce the roughness of skin after just one application. How to get the best caring results? Apply this lotion daily to your whole body for best results. Reapply on dry skin parts. Pair with a NIVEA Body Wash for a complete skin care regimen to give you skin the dermatological care it needs. 48 Hour Deep Nourishing: This NIVEA body lotion for dry skin and very dry skin provides 48 hours of deep nourishing moisture Smoother Skin: Infused with Deep Nourishing Serum and Almond Oil for skin, it reduces roughness after just one application Tested & Trusted: NIVEA Essentially Enriched lotion is dermatologically tested, and is ideal for those looking for a daily lotion for very dry skin Convenient Pump Bottle: NIVEA dry skin lotion pump bottle is a convenient option for home or office use Includes one (1) 16.9 fluid ounce pump bottle of NIVEA Essentially Enriched Body Lotion",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_22",
    "title": "Clear Acrylic Nail Tips - French Nail Tip BTArtbox 500pcs Fake Nails Half Cover False Nail with Case for Dip Powder Nail Salons and DIY Nail Art, 10 Sizes",
    "price": 8.97,
    "rating": 4.5,
    "rating_count": 55984,
    "image_url": "https://m.media-amazon.com/images/I/51cRM6-MjPL.jpg",
    "description": "*Varied Sizes,Clear Case: BTArtbox 500PCS Clear nail tips offers 10 different sizes with 50 nails of each size numbered 1-10 individually, so they're convenient to choose the most suitable size that fits your every finger. *Nail Tips Design: BTArtbox nail tips which is known as tips are designed with natural/clear colors and two optional lengths long/short, the average square end design makes your nails more elegant and charming *Simple Operation: BTArtbox nail tips are easy to trim, paint and apply and nice holding the color without separating or streaking. Pairing up paint and colorful decoration,your nails could be more natural. *High Quality ABS Material: The clear nail tips are made from high quality ABS material, which is a kind of green friendly environmental material,No toxic,No smell,No harmto your nails or body and makes the nails durable & natural. *Multiple Application: The clear nail tips are great for both professional nail specialist or nail art learner, suitable for nail salons and DIY nail art at home, wonderful gift for your wife, girlfriend, mother or sisters, and excellent for Parties/Wedding/Costume ball/Halloween/Christmas gift.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_23",
    "title": "COVERGIRL Perfect Blend Eyeliner Pencil, Basic Black, Eyeliner Pencil with Blending Tip For Precise or Smudged Look, 1 Count",
    "price": 4.52,
    "rating": 4.5,
    "rating_count": 15840,
    "image_url": "https://m.media-amazon.com/images/I/21HCNHwrTwL.jpg",
    "description": "Product Description COVERGIRL Perfect Blend Eye Pencil gives you all the blending power you need in a smooth glide pencil. You’ll be able to draw precise lines for a defined look or softly smudge with the gentle blender tip for a smoky eye look. (Packaging may vary). Our classic liner with blending power. For a defined look, draw a precise line; for a smoky look, softly smudge with the plush blender tip. For over fifty years, COVERGIRL has created must-have beauty products that bring out the best in women. We understand the transformative effect makeup can have not just on the outside, but the inside as well. Since 1961, COVERGIRL has made it easy, breezy, and beautiful to be yourself. Color Cues The right colored eyeliner can help make your eyes pop! For blue eyes, try a navy or charcoal eyeliner. For brown, go for a deep cocoa. Green girls look gorgeous in light brown or camel colors. Eye Enhancers 1-Kit Eyeshadows Vibrant shades hand-picked by our pros. LashBlast Length Mascara Get extreme, notice-me lashes all day long. Make-Up Masters 3-in-1 Sharpener Get a perfect point every time. Applying eyeliner is a tricky task, but getting a straight line is worth your time. 1. Stand 6 inches away from a mirror and tilt your chin up, so that when you look down your nose into the mirror, you can see your entire eyelid. 2. Dab concealer or dust translucent powder on your upper lids. Blend well with a sponge or lightly pat with a fingertip to cover veins and prevent creasing. 3. Before applying liner, determine your eye shape. If eyes are close-set or round, line only the outer corners. Otherwise, rim the entire upper lid. 4. Soften the pencil top by rolling it between your fingers. 5. Gently pull your eyelid taut at an upward angle. Beginning at the inner corner, draw small, connected dashes along the top lashes. Be sure to stay close to the roots so there is no skin visible between the lashes and the liner. To make eyes look bigger, extend the liner slightly beyond the ou",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_24",
    "title": "Silk Sleep Mask, 2 Packs 100% Real Natural Silk Eye Mask with Adjustable Straps, Eye Sleep Mask, BeeVines Summer Travel Eye Sleep Sunshade to Reduce Puffy Eyes (Black & Pastel Blue)",
    "price": 11.99,
    "rating": 4.6,
    "rating_count": 16121,
    "image_url": "https://m.media-amazon.com/images/I/31lMJ6s9xiL._AC_.jpg",
    "description": "Sleep Sound Anywhere & Anytime: Wear this incredibly lightweight, soft, comfortable sleep mask anywhere - in a bed, on a flight, on a long car ride, while camping - and enjoy uninterrupted, deep, relaxing sleep. This silk eye sleeping mask is perfect for Travel, Home, Flight, Train or anywhere where your sleep is bothered by light. Enhanced Sleep & Lifted Spirit: Our silk eye cover naturally relieves your tension and improve your mood through a peaceful full night’s sleep. Our 100% silk eye mask for sleeping is naturally breathable and calming to your facial skin to deliver a faster and sweeter sleep while keeping your eyes relaxed. Blink at Ease & Enjoy Sound Sleep in Any Position: BeeVines eye mask for sleeping blackout is specially designed for rub-minimizing comfort. This eye mask will keep your eyes shielded from annoying light without compressing your nose bridge, eyelids, and temples while you sleep. The pain-free strap is specifically designed to be adjusted flexibly to allow you to sleep comfortably in any position. Adjustable Ultra-Soft Elastic Strap: BeeVines 2 Pack eye covers feature a comfortable, adjustable and pain-free head strap that does not move or fall off while you’re sleeping. This is sleep aid mask is so lightweight yet fits perfectly on your face that you can wear it for sleeping, concentration or meditating for Yoga. Uninterrupted Sleep in a Natural & Healthy Way: These silk masks come in TWO pack and act as sleeping aid that is ideal for people suffering from insomnia, migraine headaches and dry-eyes thanks to our breathable, natural fibers of hypoallergenic silk. These 2 pack sleep masks make a perfect Christmas gift for your beloved ones to enjoy the sound sleep that they deserve!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_25",
    "title": "Beetles 20 Pcs Gel Nail Polish Set-Magic Academy Collection Winter Spring Orange Yellow Green Blue Gel Polish Soak Off LED Nail Lamp Base Top Coat Glitter Gel Nail Kit Mother's Gifts for Women",
    "price": 28.99,
    "rating": 4.5,
    "rating_count": 83340,
    "image_url": "https://m.media-amazon.com/images/I/51tXxHc2UeL.jpg",
    "description": "WHAT YOU GET: Beetles 2022-2023 nails trend color 20 Gorgeous shades of Magic Academy Collection Fall Winter Gel Nail Polish Kit. 20 X Mini Gel Colors (5ml./each bottle) + 3 x No Wipe Base and Glossy & Matte Top Coat ( 7.5ml./ each bottle). DIY Home Mani Gel Nail Polish Kit: 20 yellow orange autumn winter colors as well as the base coat matte glossy gel top all in one box! This “Magic Academy” gel polish set includes every must have color! An array of every shade you’ll need such as yellow orange red green glitter gel nail polish fall colors. Our color range will match any outfit you style your nails with in this fall winter!2021 uñas de gel Ideal Gift for Her: Beetles purple blue gray glitter nail gel polish kit comes in a seasonal gift box. They are appropriate for any holiday or special event,such as birthday, holiday, anniversary, Christmas, Valentine's Day, Halloween gift. No more struggle to decide which colors should to select. Solid and glitter nail designs can be freely finished with these fall winter color gel. gel nails ombre Easy Application and Good Tenacity: The series of burnt orange burgundy gel nail polish set with Glossy & Matte Top Gel and Base Coat Magic Academy Collection is long lasting for 21+ days with perfect shine or matte under proper application - With base gel top coat under the full application Process. WARNING: May cause an allergic reaction by skin contact. Read directions for use carefully. Professionally formulated and only used for nails. Avoid contact with eyes, mouth, and skin. In case of contact with them, rinse immediately with water. If there is any incident, contact the doctor immediately. Stop using the product if redness and itching develop.  Keep out of the reach of children.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_26",
    "title": "L'Oreal Paris Feria Multi-Faceted Shimmering Permanent Hair Color Hair Dye, V38 Violet Noir (Pack of 2)",
    "price": 21.98,
    "rating": 4.3,
    "rating_count": 42937,
    "image_url": "https://m.media-amazon.com/images/I/61dsAMiuIvL.jpg",
    "description": "With L'Oreal Feria, what you see is the shimmer. Multi-Faceted shimmering color with 3X highlights delivers intensified, brilliant results. Inspired by fashion, Feria offers a twist on the traditional and gives edgy hair color, from bright red, platinum blonde, rose gold, metallic brown, to blue black hair color, these hair dye kits will transform your hair. Feria's prismatic color spectrum is custom-blended by L'Oreal master colorists for bold, head-turning shades, no appointment necessary. The Power Shimmer Conditi1r seals and smooths. Won't wreck or ravage hair. Packaging may vary, what you receive may not be what is reflected on site. Multi-Faceted Permanent Hair Color: This shimmering deep purple color with 3X highlights delivers intensified, brilliant results, featuring a prismatic color spectrum custom-blended by our master colorists Nourishing Formula: Seals and smooths, never leaving hair dull or flat; Kit includes Conditioning Colour Crème, Conditioning Developer Crème, Aromatic Shimmer Serum and Power Shimmer Conditioner Bold Shades: Inspired by cutting-edge fashion and the latest trends, Feria offers multi-tonal, shimmering colors come in bold shades ranging from deepest blue blacks to platinum blondes to smokey silvers L'Oreal Paris Hair Color: We offer permanent, semi-permanent, and temporary hair dye plus root cover up, anti-brass toners and lightening systems; Cover gray hair, highlight, or go bold with bright color L'Oreal Paris Beauty: A leading total beauty care company based in Paris, we offer innovative products and unique expertise from beauty experts in makeup, skin care, hair care, styling and hair color",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_27",
    "title": "Maybelline New York Brow Ultra Slim Defining Eyebrow Makeup Mechanical Pencil With 1.55 MM Tip And Blending Spoolie For Precisely Defined Eyebrows, Deep Brown, 0.003 oz.",
    "price": 7.98,
    "rating": 4.6,
    "rating_count": 16202,
    "image_url": "https://m.media-amazon.com/images/I/31A69l6PVhL.jpg",
    "description": "Achieve ultra-precise, hair-like strokes for the most defined and natural looking eyebrows yet. The pencil features a smooth and break resistant formula, an ultra slim 1.5mm precision tip, and built-in spoolie brush to create precisely defined brows. Available in 6 shades ranging from Light Blonde to Black Brown. Ultra Precise Brow Pencil: Achieve ultra-precise, hair-like strokes for the most defined and natural looking eyebrows yet; Features a smooth and break resistant formula and an ultra slim 1.5mm precision tip Precise Definition: This eyebrow pencil features a built-in spoolie brush to create precisely defined brows that last; Available in 8 shades ranging from light blonde to black brown It's All In The Eyes: Subtle lines, smokey vibes, custom brow looks, classic tones or a shot of color; Our eyeshadow, eyeliner, brows, and mascara collections are designed to transform your look Explore Your Creativity: We're committed to celebrating beauty, self expression and creativity with our full line of makeup, from foundations, concealers and bronzers to mascara, brow pencils, eyeliner and lipstick Maybelline New York: We combine technologically advanced formulations with on-trend expertise and New York City edge; Our mission is to offer innovative, accessible and effortless cosmetics for everyone",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_28",
    "title": "NYX PROFESSIONAL MAKEUP Can't Stop Won't Stop Foundation, 24h Full Coverage Matte Finish - Buff",
    "price": 12.6,
    "rating": 4.2,
    "rating_count": 15289,
    "image_url": "https://m.media-amazon.com/images/I/31JDf6Vw2oS.jpg",
    "description": "Lightweight, waterproof and pigmented AF, our new Can't Stop Won't Stop Full Coverage Foundation hustles as hard as you do. This comfy liquid formula comes in 45 flattering tones that don't transfer. Every creamy shade glides on smooth, delivering matte coverage and color that stays true for up to 24 hours. Our little overachiever also works to control shine and mattify your complexion all-day long. But it doesn't stop there: this foundation is waterproof, noncomedogenic and suitable for normal, oily, combination, and sensitive skin types. Matte Liquid Foundation: Lightweight, waterproof and highly pigmented, NYX Professional Makeup Can't Stop Won't Stop Full Coverage Foundation is a long wearing waterproof liquid foundation that comes in a wide range of flattering tones that don’t transfer Long Lasting: Every creamy liquid shade glides on smooth, delivering matte coverage that stays true up to 24 hours; This overachiever also works to control shine and mattify your complexion all day Face From Foundation To Finish: Complete your makeup look with our full line of face products to aid in color correction and coverage from concealer, blush, bronzer, foundations and contouring to palettes and powders Cruelty Free Cosmetics: We believe animals belong in our arms, not in a lab; All of our makeup is certified and acknowledged by PETA as a cruelty free brand; We don't test any of our products on animals Discover NYX Professional Makeup: Try all of our professional makeup products today from eyeshadow, eyeliner, and false lashes to liquid lipstick, lip gloss, primer, concealer, setting sprays and eyebrow makeup",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_29",
    "title": "Australian Gold Spray Gel Sunscreen with Instant Bronzer SPF 30, 8 Ounce | Moisturize & Hydrate Skin | Broad Spectrum | Water Resistant | Non-Greasy | Oxybenzone Free | Cruelty Free",
    "price": 7.37,
    "rating": 4.7,
    "rating_count": 25017,
    "image_url": "https://m.media-amazon.com/images/I/41kIIBB4-BL.jpg",
    "description": "General Protection Spray Gels with Instant Bronzer are an innovative hybrid of a continuous spray and a traditional lotion, fitting for those looking for control, hydration and convenience, plus temporary color for an immediate glow. Shake well before use. Apply liberally 15 minutes before sun exposure and rub into skin. Hold container 4 to 6 inches from the skin to apply. Do not spray directly into face. Spray on hands then apply to face. Reapply: After 80 minutes of swimming or sweating, immediately after towel drying, and at least every 2 hours. Children under 6 months: Ask a doctor. SPF 30 SUNSCREEN SPRAY GEL with Sunflower Seed Oil, Olive Fruit Oil & Cocoa Seed Butter is designed to provide ultimate hydration that deeply moisturizes the skin, and the Caramel Bronzer imparts a faux sun-kissed golden glow for an instant tinted look BLESSED WITH AUSTRALIAN NATURALS - A rich blend of Kakadu Plum extract with highest content of Vitamin C, and Tea Tree Oil, a powerful antioxidant, fights off free radicals and leaves skin fresh. Comes in a delectable scent of Coconut, Orange, and Vanilla BROAD SPECTRUM SUNBLOCK shields the skin from both UVA and UVB rays and reduces the adverse effects of sunlight. Generously apply this lightweight, non-greasy sheer sun protector and tanning spray gel 15 minutes before stepping out and you are good to go EASY TO USE SPRAY PUMP - This innovative, hybrid take on continuous spray, traditional lotion and temporary bronzer comes in a convenient spray bottle that gives maximum control and gets easily absorbed by the skin SPECIALLY FORMULATED SUNSCREEN - Australian Gold's time-tested formula is designed to be Oxybenzone Free, PABA Free, Phthalate Free & Gluten Free. It is sweat and water resistant (up to 80 minutes) and is purely vegan, cruelty free and never tested on animals",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_30",
    "title": "Just For Men Easy Comb-In Color Mens Hair Dye, Easy No Mix Application with Comb Applicator - Darkest Brown, A-50, Pack of 3",
    "price": 26.88,
    "rating": 4.3,
    "rating_count": 21641,
    "image_url": "https://m.media-amazon.com/images/I/51N+ZqrupBL.jpg",
    "description": "JUST TWIST & COMB. Eliminating grays is as easy as combing your hair. With Just For Men Easy Comb-in Color, one tube of our patented no-mix formula meets one specially designed comb applicator. Just twist & comb it in. Give it 10 mins to blend away the grays, then wash it out, for a natural, gray-free look. Great for targeting gray areas or covering grays throughout your hair. Lasts up to 8 weeks until grays grow back. Can't decide between two shades? Try the lighter one first. You can always go darker later. Made in the USA. New look and name, same foolproof Autostop results, this patented formula automatically stops coloring after 10 minutes, so you can't go too dark. Just for Men Easy Comb-In Color, Darkest Brown, makes getting rid of your gray hair easy. Using this no-mix men's hair coloring product is as easy as combing your hair. Simply attach the comb applicator to the pre-mixed color tube, comb into your hair to apply, wait ten minutes, and rinse your hair out in the shower Choose from 11 different shades ranging from sandy blond to rich black. When in doubt, always go with a lighter shade. Our gentle formula contains no ammonia or peroxide and is enhanced for better coverage from roots to ends. Our product will not wash out, lasts up to 8 weeks until the grey grows back; The comb applicator helps you apply all over your hair or on targeted areas Unlike other dyes, our easy, no-mix formula stops coloring after ten minutes. Make sure to follow all instructions included in the package, and perform a skin allergy test 48 hours before use",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_31",
    "title": "FESHFEN Messy Bun Hair Piece Hair Bun Scrunchies Dirty Brown Synthetic Wavy Chignon Ponytail Hair Extensions Thick Updo Hairpieces for Women Girls 1PCS",
    "price": 9.86,
    "rating": 4.0,
    "rating_count": 15664,
    "image_url": "https://m.media-amazon.com/images/I/51TIK7BRmJL.jpg",
    "description": "【MATERIAL】High quality heat resistant synthetic fiber to create a messy and fluffy look, well blending with your own hair. 【FUNCTION】Messy hair bun weighs 1.3 oz/pcs, perfect for adding volume and fullness to a updo or a ponytail. This eye-catching hairpiece bun is very soft and natural, well blending with your own hair. 【ELASTIC HAIR TIE】The elastic hair tie on the hairpiece can be adjusted for thin or thick hair. If the hair piece bun is too loose, you can secure with hair pins, which will make the hair bun tight on your own hair. 【SUITABLE OCCASIONS】The fullness messy bun scrunchie is perfect for daily use, live show, party, prom, Cosplay, anniversary, wedding, theme parties, shopping, working, dating, and for fun, which can give you an instant hairstyle in a hurry. 【CUSTOMER SERVICE】Amazon offers the RETURN or EXCHANGE service. If you have any quality or color problems, please contact us at any time. 24 HOURS ONLINE SERVICE!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_32",
    "title": "Fake Bake Flawless Self-Tanning Liquid Streak-Free, Long-Lasting Natural Glow For All Skin Tones - Sunless Tanner Includes Professional Mitt For Easy Application, Black Coconut Scent - 6 oz",
    "price": 28.0,
    "rating": 4.4,
    "rating_count": 13399,
    "image_url": "https://m.media-amazon.com/images/I/41fHwMiJ8tS.jpg",
    "description": "Fake Bake Flawless Self-Tan Liquid combines ease of application with intense professional color development. Flawless is applied with a professional mitt (included) in effortless gliding strokes for a perfectly even tan. The dual function cosmetic bronzer assists in making the application even easier (shows-where-it-goes) whilst providing an instant golden tan. The fast drying, fast absorbing formula is transfer resistant, so can be worn throughout the day. Formulated with Fake Bake’s exclusive triple tan formula (DHA boosted by DMI & Erythulose) for an intense tan that lasts longer. Suitable for all skin tones and skin types. Pleasantly fragranced with a tropical scent. No artificial preservatives or parabens. GET YOUR TAN ON TODAY - Non-sticky tropical scented paradise, dries quickly for a beautiful glowing tan that develops in about 4-6 hours. FLAWLESSLY TANNED WITHOUT THE SUN - Built-in color guide so you can see where it's going from back to legs, ensuring solid application; includes mitt and gloves to assist with your bronzing. NATURALLY WORKS WITH EVERY TONE - Our products work for everyone, whether your tone is fair, medium or dark our ingredients work to enhance your skin’s unique pigment. WHOLE BODY GLOW ON YOUR TIME - There is no best time to tan, whether you need to apply on the go in the morning, or you like to apply before bed, the color stays completely natural leaving your bod a luxe bronze. CLEAN BEAUTY SOLUTION - Our tanners are formulated with natural skin loving ingredients that are paraben free, vegan friendly and made with naturally derived DHA; never tested on animals.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_33",
    "title": "Pimoys 6 Pieces Powder Puff Face Triangle Makeup Puff Soft Velour Puffs for Loose Powder Mineral Powder Body Powder Cosmetic Foundation Sponge Beauty Blender Makeup Tools(Black and Rose Red)",
    "price": 6.99,
    "rating": 4.7,
    "rating_count": 12768,
    "image_url": "https://m.media-amazon.com/images/I/41K+FykTqAL.jpg",
    "description": "💗Package includes: you will get 6 pieces triangle shape makeup powder puffs, enough to meet your daily makeup and replacements needs 💗Comfortable and soft: this wet and dry dual-use makeup puff is made of fiber material, soft to touch, natural and even makeup, won't make your skin feel uncomfortable, it acts like a barrier against the skin and contour 💗Normal size and easy to use: each pure powder puff measures about 2.76 inch/ 7 cm, the normal size can fits your hand well, each makeup puff comes with 1 strap for you to hold well and easier to use the powder applicator 💗Save more powder and washable:the loose powder puffs are washable, you can easily clean them for secondary use, the short plush could help to save your foundation 💗Wide application:suitable for liquid foundation, barrier cream, BB cream, sunscreen, cushion, blush for wet use; Dry powder products such as pressed powder, loose powder, eye shadow, and honey powder for dry use",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_34",
    "title": "NYX PROFESSIONAL MAKEUP Eyeshadow Base Primer, Skin Tone",
    "price": 13.37,
    "rating": 4.2,
    "rating_count": 14372,
    "image_url": "https://m.media-amazon.com/images/I/41cYQE5J15L.jpg",
    "description": "Cream based eye primer. Available in three tones. Intensifes any shade of eye shadow and helps colors last longer. White helps color appear up to 100x more vivid. Pearl helps maximize any iridescent effect. Skin tone helps color hold naturally. Base Your Shadow On This: NYX Professional Makeup Eyeshadow Base is a cream eyeshadow primer in shades to ensure a smooth eyeshadow application, prolong the wear of your eyeshadow and even intensify the pigments Intensify Eyeshadow: Intensify pigments and prime your lids for any look with this eyeshadow base; Use a light shade to brighten your eyeshadow color or the black primer to deepen, or go natural with the skin tone primer base shade All Eyes On Eye Makeup: Complete your look with our full range of NYX Professional Makeup eye makeup products from eyeshadow palettes to mascara, eyeliners, concealers, setting sprays, and eyebrow products Cruelty Free Cosmetics: We believe animals belong in our arms, not in a lab; All of our makeup is certified and acknowledged by PETA as a cruelty free brand; We don't test any of our products on animals Discover NYX Professional Makeup: Try all of our professional makeup and beauty products today, from eyeshadow, eyeliner, mascara and false lashes to lipstick, foundation, primer, blush, bronzer, brushes and more",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_35",
    "title": "Makartt Poly Nail Extension Gel, Sweet Cravings Spring Color Poly Nail Gel Acrylic Extension Gel Nail Enhancement All-in-One Set for Beginner or Nail Technician",
    "price": 29.99,
    "rating": 4.2,
    "rating_count": 14516,
    "image_url": "https://m.media-amazon.com/images/I/51sNwrEEIiL.jpg",
    "description": "SMOOTH AND CREAMY NAIL ART IN SUMMER – Makartt’s Spring Collection “Sweet Cravings” is a collection inspired by delicious pastries, desserts and toppings. The 4 color nail extensions of this poly nail gel kit are mermaid glitter effects which look like ice-cream. The palettes of this collection are light shades of gold, pink, peach and green with a smooth and creamy appearance that’s simply mouth-watering. WHAT’S INCLUDED – This incredible manicure set includes 4 Sweet Cravings Nail Extension Gel Tubes (15ml) : Cake, Icing, Creme Brulee and Frosting; 2 sticker sheets; nail embellishments(random, not uniform); 1 Clear Base Coat (8ml); 1 Clear Top Coat (8ml); 72 Dual Forms (12 sizes); 1 Dual-ended Nail Extension Pen Tool (brush & picker); and 1 Nail File. FANCY MANICURES – With super easy, beginner-friendly application without complex ratios and mixing, this fake nails kit is your go-to at home salon. To ease the poly nail gel when applying, you can use slip solution (or alcohol or base coat as an alternative). PROFESSIONAL GRADE & EASY TO USE – The gel nail builder kit is fast to dry under the LED nail lamp (Not included) for 60-120s. It is easy to apply these extension gels as the kit comes along with a detailed instruction manual. CREATE UNIQUE LOOK – 4 different and amazing color gels that are perfect for any skin tone. Your nails will never look the same again with a natural light feel that can only be poly nail gel.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_36",
    "title": "Biotique Bio Apricot Refreshing Body Wash, 190 ml/6.42Fl.Oz.",
    "price": 11.92,
    "rating": 4.3,
    "rating_count": 12698,
    "image_url": "https://m.media-amazon.com/images/I/31a2tnJL5KL.jpg",
    "description": "Quantity: 190ml; Item Form: Foam I Package Contents: 1 Body Wash Fresh-foaming, 100% soap-free gel is a refreshing gel; Contains Apricot, Kernel Oil, Wild Turmeric, kurchi and soap nut It cleanses without dehydrating removing all microbes and pollutants Skin Type: For All Skin Types Usage: Gently massage over wet body, lather and rinse, morning and evening",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_37",
    "title": "Teenitor Nail Polish Gel Remover Tools Kit with Nail Clips Nail Remover Pads Cuticle Pusher Nail Brushes Nail File Grits 120/180 Buffer Block Grits 400/4000, 6 Pack",
    "price": 8.99,
    "rating": 4.3,
    "rating_count": 20559,
    "image_url": "https://m.media-amazon.com/images/I/51Etjnl11BL.jpg",
    "description": "New At-home gel remover kit come to life: When it comes to gel nails, removal is often the hardest part of all. Need to get your gel polish off and don't have the time or patience to head to the salon? We've been there, these cute tools include everything you need to soak, dissolve, and remove gel polish-coarse sand file, handle grip nail brushes, nail remover pads, nail clips, Cuticle Pusher& buffer block Only 5 steps, so easy: Only 5 steps (Grind, Wrap, Clip, Scratch, Polish), remove nail polish gels easily without the salon visit. Just replicate with your own two hands Save your time, save your money: Gel manicures used to be strictly salon-only, so when your perfect gel mani starts to grow out, waiting, sitting down and having someone pamper your hands for an hour is an indulgence of time. In addition, it’s not a small extra fee. Now we've found the solution to DIY gel removal that lets you wear pajama, no makeup and indulged in STAC while remove your gel mani Picking off your gels and no destroying your nails: the temptation to pick, rip or bite off the polish is strong. But resist it which weakens your nail, you can remove gel without damaging your nails. So It's so key for the gel enthusiast to know to how to remove gel nail polish at home safely without going to the salon, Follow the below guides, your nails will stay strong and healthy! Hygienic and reusable: these adorable and durable tools are washable and reusable",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_38",
    "title": "BabylissPRO Nano Titanium Ultra-Thin Hair Straightener, Professional Flat Iron For All Hair Types",
    "price": 159.99,
    "rating": 4.6,
    "rating_count": 13477,
    "image_url": "https://m.media-amazon.com/images/I/31Oz03nvq6L.jpg",
    "description": "",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_39",
    "title": "Johnson's Baby Curl-Defining, Frizz Control, Tear-Free Kids' Shampoo with Shea Butter, Paraben-, Sulfate- & Dye-Free Formula, Hypoallergenic & Gentle for Toddler's Hair, 13.6 Fl Oz",
    "price": 5.96,
    "rating": 4.7,
    "rating_count": 19335,
    "image_url": "https://m.media-amazon.com/images/I/31bjiEQsMiL._AC_.jpg",
    "description": "Cleanse your toddlers' delicate hair while bringing definition to curls and waves with Johnson's No More Tears Curl-Defining Shampoo for Kids' Curly Hair. Enriched with shea butter, this children's shampoo smooths frizzy hair and adds definition to curls for 24 hours. This gentle shampoo is specially designed to be milder than adult products, making it ideal for toddlers' and kids' developing and changing hair. Both ophthalmologist-and pediatrician-tested, our kids' curl shampoo features a tear-free formula that is as gentle to the eyes as pure water. It is also hypoallergenic and contains no parabens, phthalates, sulfates, or dyes. Every Johnson's product is designed to meet or exceed the top internationally recognized regulatory standards. For best results, follow with Johnson's Kids Curl-Defining Leave-in Conditioner. 13.6-fluid ounce bottle of Johnson's No More Tears Curl Defining Shampoo to cleanse toddlers' curly hair and define waves and curls for 24 hours Enriched with shea butter, this gentle shampoo is formulated to smooth your child's frizzy hair Specially designed to be milder than adult products, this hypoallergenic shampoo is paraben-, phthalate-, sulfate-, and dye-free, making it gentle on toddlers' developing hair Johnson's No More Tears tear-free shampoo formula is as gentle to eyes as pure water and is pediatrician and ophthalmologist tested. Every Johnson's product is designed to meet or exceed the top internationally recognized regulatory standards For long-lasting results, use the children's curl enhancing shampoo with Johnson's Curl-Defining Leave-in Conditioner",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_40",
    "title": "Bath and Body Works Super Smooth Body Lotion Sets Gift For Women 8 Oz -2 Pack (Pink Pineapple Sunrise)",
    "price": 23.95,
    "rating": 4.7,
    "rating_count": 15082,
    "image_url": "https://m.media-amazon.com/images/I/41pb2k14nVL.jpg",
    "description": "LOTION FOR YOUR BODY - The women's lotion offers fast-absorbing and non-greasy formula that feels good to your skin and provides you 16 hours of continuous moisture. - The women body lotion contains Shea Butter & Coconut Oil that your skin will love as it feels soft, smooth, and nourished. - This moisturizing lotion is also infused with protective Vitamin E and conditioning Vitamin B5. TREAT YOUR SKIN WITH LOVE - Love your skin and treat it right with the right products. This lotions for women helps you to keep your skin smooth and soft throughout the day or night. - For best results, apply the women's body lotion daily before going to sleep or after preparing for work. - The scented body lotion set includes 2 Bath & Body Works Wrapped in Sugar (Soft Marshmallow) Body lotion in 8 oz each. The Bath and Body Works body lotion are as sweet as can be. The scented lotions for women has a warm mix of Coconut Martini, Marshmallow Musk, Soft Amber, and Warm Woods. The Bath and Body lotion is infused with Shea Butter to keep your skin soft and moisturized with protective Vitamin E and conditioning Vitamin B5 for continuous moisture for 16 hours. Apply the body lotion daily to achieve the best and amazing results especially before going to bed or before starting your day. The body moisturizer for women set contains 2 Bath and Body Works Wrapped in Sugar (Soft Marshmallow) lotion in 8 oz each. (Packaging may vary) Bath & Body Works (Packaging may vary) SOFTER AND SMOOTHER SKIN - Infused with nutrient-rich ingredients, these lotions for women help your skin to feel soft and smooth with a sweet fragrance. The body lotions contain skin-loving Shea Butter, protective Vitamin E, Coconut oil and conditioning B5 to deliver 16 hours of continuous moisture. LOVE YOUR SKIN WITH JUST THE RIGHT CARE - The scented lotion helps your skin to feel amazing and wonderful. To get the best result, apply the body lotion daily before you go to bed or preparing for work. SET OF 2 - The set includes ",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_41",
    "title": "LAURA GELLER NEW YORK Award-Winning Baked Balance-n-Brighten Color Correcting Powder Foundation - Sand - Buildable Light to Medium Coverage - Demi-Matte Natural Finish",
    "price": 29.0,
    "rating": 4.2,
    "rating_count": 16892,
    "image_url": "https://m.media-amazon.com/images/I/410-Myh+1KL.jpg",
    "description": "BALANCE-N-BRIGHTEN COLOR CORRECTING CC POWDER FOUNDATION: A light-medium coverage powder foundation that contain color correcting pigments for Weightless, Creamy Coverage that Self-Adjusts to leave skin looking Even, Flawless and Beautifully radiant. SELF-ADJUSTS TO MATCH YOUR SKIN TONE: Color correcting swirls of multicolored liquid pigments are baked for 24 hours on terracotta tiles and hand-finished in Italy. Infused with antioxidants Centella Asiatica and White Tea Extract for soothing hydration throughout the day. BUILDABLE FOUNDATION COVERAGE FROM LIGHT to MEDIUM: Our buildable foundation offers light to medium coverage for a natural, never cakey look that feels natural and weightless with a demi-matte finish. Use all over your face for an even and healthy glow. PERFECT FOR : mature skin, uneven complexions, fine lines & wrinkles. For LIGHT COVERAGE, SWIRL OUR RETRACTABLE KABUKI BRUSH – with sleeve pushed all the way down- onto the powder then stroke on face. Blend outward and upward. Repeat to build coverage. For medium coverage apply with our retractable kabuki brush protective sleeve pulled almost all the way up. Swirl onto the powder then stroke on face. Blend outward and upward. Repeat to build coverage.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_42",
    "title": "Dove Beauty Bar More Moisturizing Than Bar Soap for Softer Skin, Fragrance-Free, Hypoallergenic Beauty Bar Sensitive Skin With Gentle Cleanser 3.75 oz, 14 Bars",
    "price": 15.74,
    "rating": 4.8,
    "rating_count": 14446,
    "image_url": "https://m.media-amazon.com/images/I/41NxVnNF0CL.jpg",
    "description": "Dove Sensitive Skin Beauty Bar combines classic Dove cleansers and ¼ moisturizing cream in a fragrance free, hypoallergenic bar that’s gentle enough for sensitive skin. And now, we are bringing you Dove's same great formula in an all-new look. Dermatologist recommended and suitable for daily use, it can be used as a hand soap, gentle facial cleanser and body soap. Proper sensitive skin care depends on having a cleanser that truly cares for your skin and won’t dry it out like an ordinary soap can. Washing with regular soap can cause skin to feel dry and tight. What makes Dove different. It’s the combination of gentle cleansers and moisturizing ingredients that help to nourish skin. With unscented, hypoallergenic cleansers and 1/4 moisturizing cream, Dove Beauty Bar can be used as a face cleanser, as well as a gentle cleanser for your body and hands, leaving you with instantly soft skin and lasting nourishment. The secret to beautiful skin is moisture, and no ordinary bar soap hydrates skin better than Dove. At Dove, our vision is of a world where beauty is a source of confidence, not anxiety. That’s why we are on a mission to help the next generation of women develop a positive relationship with the way they look—helping them raise their self-esteem and realize their full potential. GENTLE ON SENSITIVE SKIN: Nourish your skin with Dove Sensitive Skin Beauty Bar. With its fragrance free and hypoallergenic formula, it gently cleanses for softer skin than ordinary bar soap DERMATOLOGIST RECOMMENDED: Formulated with ultra-mild cleansers and ¼ moisturizing cream, Dove moisturizing Beauty Bar leaves skin instantly soft and smooth with lasting nourishment MILD AND MOISTURIZING: Help maintain your skin’s natural moisture barrier and hydration with this Beauty Bar for women, ideal to use as a gentle face cleanser and body soap for sensitive skin EFFECTIVE CLEANSING: A Beauty Bar that washes away dirt and germs, but won’t dry skin as ordinary bath soap can. This hypoallergenic",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_43",
    "title": "Old Spice Hydro Body Wash for Men, Smoother Swagger Scent, Hardest Working Collection, 16 Ounce (Pack of 4)",
    "price": 25.88,
    "rating": 4.7,
    "rating_count": 13618,
    "image_url": "https://m.media-amazon.com/images/I/512frTQgP9L.jpg",
    "description": "Old Spice Men's Hydro Wash Body Wash is like a genie in a bottle that, with continued use, will make all your wishes come true, as long as those wishes are limited to: fighting dry skin at the source with a rich, creamy lather, removing clods of dirt from your body, and smelling great. It's probably the worst genie in a bottle in history, but it's an excellent body wash nonetheless. Immerse yourself in the captivating aroma of Smoother Swagger—a lively fusion of pure success, hints of crisp apple, and fresh herbs. Old Spice Men's Hydro Wash drop-kicks dirt and odor for you, allowing you to channel your energy towards higher pursuits such as closing deals or even embarking on the extraordinary journey of teaching dolphins to speak. Smoother Swagger is a fresh and frisky merger of pure success and hints of crisp apple and fresh herbs Old Spice Hydro Wash gives you 2 benefits in 1: lasting scent and hydration Old Spice Men's Body Wash fights dry skin at the source with a creamy lather Hardest Working Collection: Legendary cleansing for legendary men Refreshing lather drop-kicks dirt and odor, does a clothesline on them, and then slams them with a folding chair",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_44",
    "title": "Celeb Luxury Colorwash Color Depositing Shampoo + Bondfix Bond Rebuilder, Semi Permanent Hair Color, Vegan Hair Dye, Viral and Gem Lites",
    "price": 35.0,
    "rating": 4.3,
    "rating_count": 24384,
    "image_url": "https://m.media-amazon.com/images/I/41NvbdJulpS.jpg",
    "description": "",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_45",
    "title": "ab gel 18 pcs Gel Nail Polish Kit, Include 6 pcs Metal Line Nail Stickers,16 Colors Soak Off UV LED Nail Gel Pastel Collection with Base and Top Coat Manicure Nail Art Salon",
    "price": 26.99,
    "rating": 4.3,
    "rating_count": 17599,
    "image_url": "https://m.media-amazon.com/images/I/519vAxZVfQL.jpg",
    "description": "Application: Step 1.Remove the cuticle, trim the edge, polish your nails for a clean and dry surface.Please roll the bottle to gently mix before opening the bottle. Step 2.Apply Base Coat: Apply thin base coat, cure under LED lamp for 60-90 seconds.Please note:don't need too thick. Step 3.Apply Color Gel Polish: Apply first thin layer of color gel polish then cure with the nail dryer for 90-120 seconds.If you need more brithter color,apply the second or third layer color gel polish.Cure with the nail dryer after each layer.Step 4.Add your favorite nail sticker pattern.Step 5.Apply Top Coat: Finish off with a layer of top coat, cure under LED lamp for 90-120 seconds. Removal: 1.Lightly buff off the shine from the top gel coat using a nail buffer,file off the top gel gently. 2.Take a piece of cotton soaked in pure acetone and wrap it over the nail.Please stay at least 10 minutes,check if ready if not leave a few minutes more. 3.Lightly buff nails again once all gel is removed\" \" About our brand: Ab gel is a factory brand which focus on gel nail innovation.Taking quality and health as the first priority and select popular colors among all functional gel to meet various needs. All of gel polish are made of natural resin as raw ingredient（high quality,long lasting,smooth and easy to apply）and suitable for all kinds of nails. ✨ 18 pcs Gel Polishes:In this nail polish kits, we have carefully prepared bast coat & top coat for you, you don’t need to purchase additional.This set include 16 colors gel nail colors.Many colors for you to choose.Each bottle has a large capacity of 7.5ml.This nail polish set include 6 pcs nail sticker,you can add it on your nail,you will get a brand new manicure style. ✨ Soak off UV Gel Nail Polish:We suggest cure the gel nail polish under LED/UV light,Average for LED light 60-120 secs, UV light 2-4 mins.You also can smudge edges,it will help keep longer lasting. ✨All year series nail polish:All season color theme,this set include 16 colors,it rea",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_46",
    "title": "Lipstick By Wet n Wild Mega Last High-Shine Lipstick Lip Color Makeup, Orange Tanger-ring the Alarm",
    "price": 2.29,
    "rating": 4.0,
    "rating_count": 12276,
    "image_url": "https://m.media-amazon.com/images/I/31weMd1KWXL.jpg",
    "description": "A luscious high-shine Lipstick infused with lip-loving ingredients including murumuru butter, Mango butter, and sunflower and watermelon seed oils will nourish your lips and deliver moisture. The formula is long-wearing and has a creamy texture for easy application. Silky, buildable color Effortlessly glides on for superior wear and will not feather or bleed. Available in 13 cruelty-free, gluten-free, and fragrance-free shades. Mega Last High Shine Lipstick: This lush lipstick is infused with Murumuru Butter, Mango Butter, and Sunflower and Watermelon Seed Oils to nourish lips while delivering long wearing buildable lip color Perfect Your Pout: Available in 13 Cruelty-free, Gluten-free, and Fragrance-free shades, this long wearing, creamy lip color has a buildable formula that glides on easily and won't feather or bleed Best Face Forward: From bronzer and blush to primer, highlighter, natural finish powder, and concealer, we've got you covered and photo ready for your next big thing. You've met your true makeup match Always Cruelty Free: We are 100% cruelty free and always have been! We also carry vegan makeup & tools such as foundation, nail polish, contour palettes, lipstick, makeup brushes and more Stay Wild: We are the trusted beauty destination for beauty lovers of all ages, ethnicities, skin colors, and economic statuses. No matter who or where you are in life, we have a product for you",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_47",
    "title": "Lime Crime Unicorn Hair Dye Full Coverage, Sea Witch (Rich Teal) - Vegan and Cruelty Free Semi-Permanent Hair Color Conditions & Moisturizes - Temporary Green Hair Dye With Sugary Citrus Vanilla Scent",
    "price": 17.0,
    "rating": 4.4,
    "rating_count": 11465,
    "image_url": "https://m.media-amazon.com/images/I/41y6umXXhjL.jpg",
    "description": "Sea Witch Unicorn Hair Dye: Dyed and gone to Unicorn Heaven! Lime Crime Unicorn Hair is a DIY-friendly, semi-permanent color dye that transforms hair into vibrant colors... all from the comfort of your own home. Sea Witch is a radiant rich teal that will make your fantasy hair color dreams come true, and its sugary citrus vanilla scent will make your transformation even sweeter! Why You Need It: Not only does our damage-free, vegan hair dye give you fun, vibrant color, but this formula also contains conditioning ingredients like fatty acids and vitamins that help to moisturize your hair and boost shine. Before You Use It: Unicorn Hair deposits super-saturated, vibrant color to pre-lightened platinum to medium blonde hair and adds a tint of color to dark blonde and light brown hair. The life cycle of the color depends on the shade and condition of your hair and how often you wash it. Always do a patch and strand test before coloring your full head because results may vary. Benefits: This formula is free of harsh chemicals like PPD, Peroxide and Ammonia. Lime Crime is certified by both Leaping Bunny and PETA, and we design, manufacture, and assemble quality products using globally sourced ingredients for high performance wear and strong color pay-off. Never Blend In: Lime Crime is a Vegan & Cruelty-Free makeup and hair brand that aims to inspire and invites self-expression. Through our vibrant color products, we encourage all to explore their individuality, embrace their uniqueness and always stand out from the crowd. Find joy through color and re-imagine your boundaries with Lime Crime.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_48",
    "title": "Color Wow Root Cover Up – Instantly cover greys + touch up highlights, create thicker looking hairlines, water resistant, sweat resistant root concealer- No mess multi award winning root touch up",
    "price": 34.49,
    "rating": 4.2,
    "rating_count": 15597,
    "image_url": "https://m.media-amazon.com/images/I/41AjcvE2Q-L.jpg",
    "description": "",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "beauty_and_personal_care_49",
    "title": "Just For Men Control GX Grey Reducing Beard Wash Shampoo, Gradually Colors Mustache and Beard, Leaves Facial Hair Softer and Fuller, 4 Fl Oz - Pack of 1",
    "price": 9.97,
    "rating": 4.1,
    "rating_count": 11436,
    "image_url": "https://m.media-amazon.com/images/I/51Vx60QVGmL._AC_.jpg",
    "description": "Control GX is the first and only shampoo smart enough to gradually reduce greys by slowly bringing them back to their natural shade while it cleanses and conditions your hair. You get an extremely natural look - just by shampooing as you normally do. Just use it instead of your usual shampoo until you like what you see. Then use it in rotation with your usual shampoo to maintain the look you like. There's never been an easier way to control your grey. Get the look you want: Use the control GX as your daily shampoo, and after the first few washes, you'll start to see a subtle reduction in the amount of gray. Continue to use it until you reach your desired level of grey reduction (generally within 2 to 4 weeks). You can even control how gradually you get to your desired result by using it daily or every other day at the start. Keep it that way: Once you've reached the level of grey reduction you like, you can reduce the frequency of use, alternating with another shampoo. In general guys use it as their daily shampoo at the start, and when they are in \"maintenance mode\" they use it 3 to 4 times a week. CGX Innovative beard color shampoo gradually reduces grey with every wash. Gently and thoroughly cleans and revitalizes, increasing volume for a thicker, fuller look. Reduces grey beard hairs gradually, for subtle, natural-looking results, unlike other dyes. No ammonia or peroxide. Triple patented formula, keeps beard hair looking stronger and healthier. This product works best for all shades of hair. Makes reducing gray easy: All you have to do is wash your beard Also available in shampoo, shampoo for light shades, and anti-dandruff shampoo Just use it instead of your beard wash until you like what you see. Then alternate with your regular beard wash to maintain the look you like.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  }
]