[
  {
    "sku": "electronics_0",
    "title": "BMOUO Kids Case for iPad 9.7 2018/2017/iPad Air 2/1/Pro 9.7, iPad 6th/5th Generation Case for Kids, Built-in Screen Protector, Shockproof Handle Convertible Stand Case for iPad 6th/5th Gen 9.7”, Rose",
    "price": 13.98,
    "rating": 4.7,
    "rating_count": 19162,
    "image_url": "https://m.media-amazon.com/images/I/51G-irrRjAL._AC_.jpg",
    "description": "➤【Fit Model】iPad 9.7 Case Designed for the iPad 9.7 inch 2018 (iPad 6th Generation),iPad 9.7 inch 2017 (iPad 5th Generation), iPad Air 2 9.7inch, iPad Pro 9.7\". ➤【Built-in Screen Protector】iPad 9.7 Case for Kids, with Crystal-clear, fully integrated screen protector fits over top tablet display ➤【Shockproof】iPad 6th/5th Generation Case for Kids, made of Durable, heavy duty EVA foam is shock-resistant prevents bumps, and scratches from damaging ➤【Full Access】iPad Air 2 Case for Kids, Cutouts for clear access to all buttons, ports, speakers and rear-camera for 9.7 inch ipad ➤【Built-in Kickstand】Built in kickstand, makes your iPad 9.7 6th/5th generation with multi-angle watching!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_1",
    "title": "ASURION 4 Year Housewares Protection Plan ($40 - $49.99)",
    "price": 8.99,
    "rating": 4.6,
    "rating_count": 14727,
    "image_url": "https://m.media-amazon.com/images/I/410NIWr8VuL._AC_.jpg",
    "description": "Includes repairs, parts, labor and Transport COVERAGE: Plan starts on the date of purchase. Drops, spills and cracked screens due to normal use covered for portable products and power surges covered from day one. Malfunctions covered after the manufacturer's warranty. EASY CLAIMS PROCESS: File a claim anytime online. Most claims approved within minutes. We will send you an Amazon e-gift card for the purchase price of your covered product. In some cases, we will replace or repair it. MORE DETAILS: Additional information about this protection plan is available within the \"Product guides and documents\" section. Simply click \"User Guide\" for more info. Asurion will also email your plan confirmation with Terms & Conditions to the address associated with your Amazon account within 24 hours of purchase (if you do not see this email, please check your spam folder).",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_2",
    "title": "Shintop Cord Organizer, 6 Pack Black Charger Holder Cable Clips Wire Clips for Organizing Desk Nightstand Car Phone Charger",
    "price": 5.99,
    "rating": 4.5,
    "rating_count": 15289,
    "image_url": "https://m.media-amazon.com/images/I/41jLxvUlOmL._AC_.jpg",
    "description": "Package and Material: Come with 6 pcs black cord holders, cord clip can hold a variety of sizes of cables/chargers/cords. Material: Rubber Good Adhesion: Cord keepers are made of strong 3M adhesion tape which holds them securely. Easy to peel and stick self-adhesive cable clip Great Organizing Tool: They keep your cords from slipping off your desk, nightstand or table. no longer have to finding your cables on the ground, keeping cables neat and hidden, no more mess on the table Multi Purpose: Cable management perfect for organizing phone charger, mouse cord, usb cord, charging wires, headphone, game controller cords, computer cords, HDMI and DisplayPort cables, toothbrush holder and skinny pencil Wide Applications: The adhesive pad at the back of the cable drop allows you to stick it anywhere you want. Good for smooth and clean surfaces at home and office, such as glass, ceramics, marble and wood. Please cleaning the wall, car, desk surface first",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_3",
    "title": "100ft - 1 inch PET Expandable Braided Sleeving – Black – Alex Tech braided cable sleeve",
    "price": 22.99,
    "rating": 4.6,
    "rating_count": 21633,
    "image_url": "https://m.media-amazon.com/images/I/41XVb4K-DfL._AC_.jpg",
    "description": "Size: Diameter: 1\"| Length: 100 Feet | Color: Black. Diameter expands by 50%. Our wire sleeve is made from PET Operating temp(degree F.):-103 to 257|Melt temp: 446.Our braided cable sleeve is used in automotive Hifi audio speaker hdmi wire Our PET expandable braided sleeving : UL | ROHS | REACH | Halogen Free Our cable sleeving protects and prolongs the life of wires. Economical and easy to install Recommended: Cut Braided Sleeving with a HOT KNIFE to prevent fraying, if a Hot Knife is not available, make sure to sear the edges with another heat source (example: use the flame from a lighter)",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_4",
    "title": "Tzowla Travel Laptop Backpack Water Resistant Anti-Theft Bag with USB Charging Port and Lock 15.6 Inch Computer Business Backpacks for Women Men Gift,Bookbag Casual Daypack",
    "price": 25.49,
    "rating": 4.6,
    "rating_count": 42892,
    "image_url": "https://m.media-amazon.com/images/I/51X-3qi5olL._AC_.jpg",
    "description": "[Large Capacity and Organized] Tzowla backpack has one separate laptop compartment that can hold any laptop up to 15.6 inch. It also has one spacious compartment for storing any item like daily necessities, tech related items, accessories, toiletries and many more. The front compartment comprises of many pockets, key hook to store your item in an organized manner and easier to find. [USB and Headphone Port] This backpack has external USB port with built-in charging cable offers convenient charging your cellphone by connecting your own power bank. The headphone port outside gives easy access to Earphone usage as well. [Anti-Theft Design] This backpack has fixed password lock and durable metal zippers. You can rest assured that the items inside are safe and secure without worrying about theft. [Multipurpose Design] This backpack is made up of high-quality polyester fabric material and comfortable wide padded shoulder strap design which makes it easy to carry around. It is also unisex design and has various built-in compartments as well which makes it perfect for daily use at office and travel.(THIS ITEM IS NOT INTENDED FOR USE BY CHILDREN 12 AND UNDER.) [Durable] The outer dimensions are 20 x 11.8 x 5.5 inch and made up of water resistant 300D outer nylon and a protected soft cushioned inside give exceptional sturdiness and longevity. The tough materials will withstand ripping and abrasion, ensuring a long-lasting use. It can also carry your equipment like water bottle, tablets, journal, pen, pencil, cellphone, etc.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_5",
    "title": "JETech Screen Protector for iPad 2 3 4 (Oldest Models), Tempered Glass Film, 1-Pack",
    "price": 9.99,
    "rating": 4.6,
    "rating_count": 18227,
    "image_url": "https://m.media-amazon.com/images/I/516CXVvjQiL._AC_.jpg",
    "description": "Fit for iPad models: A1395 A1396 A1397 A1416 A1430 A1403 A1458 A1459 A1460. Note: for earliest editions of iPad: iPad 2/3/4 9.7\". NOT for later iPad such as iPad Mini, iPad Air, iPad Pro, NOT for newest 2017 iPad 9.7\" Extremely high hardness: resists scratches up to 9H (harder than a knife) High-response and high-transparency Dust-free, fingerprint-free, one-push super easy installation, bubble free Retail package includes: 1-Pack tempered glass screen protector, cleaning cloth, dust removal stick, guide stick, instructions, customer service card",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_6",
    "title": "FEEL2NICE iPhone Charger Cable [MFi Certified] ，(3 Pack 6 Foot) Nylon Braided Lightning Cable, iPhone Charging Cord USB Cable Compatible with iPhone 11/Pro/X/Xs Max/XR/8 Plus /7 Plus/6/ iPad （Black",
    "price": 15.99,
    "rating": 4.5,
    "rating_count": 47700,
    "image_url": "https://m.media-amazon.com/images/I/51bfrM+0JrL._AC_.jpg",
    "description": "Super Performance:Phone cable with anti-resistant aluminum alloy connectors, high toughness PVC, tinned copper core cables to guarantee 100% compatibility to transmit data stably. Anti-overheating, support 2.4A current(Max) and the latest IOS system. Compatible Devices: Compatible All iphone fast-charging charger cable support IOS13/12/11/10.Compatible with iPhone 11/11 Pro/11 Pro Max/ XS Max/XS/XR/X/8 Plus/8/7 Plus/7/6s Plus/6s/5s/5c/5/iPad Pro/iPad Air/Air 2/iPad mini/mini 2/mini 4/iPad 4th gen/iPod Touch 5th gen/ iPod Nano 7th gen and Beats Pill+ Ultra Durable iPhone charger: Reinforced stress points with a 10000+ bend lifespan make iPhone cord many times more durable than anything else on the market. Perfect 6FT: With the 6ft length, you can lie on the couch or sofa and use your devices while you are charging at the same time. And you can use freely in your bedroom, office and even in the backseat of your car. What You Get: 3 Pack 6 ft iPhone charger cable （Black）",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_7",
    "title": "Amazon Fire HD 10 Tablet Cover (Only compatible with 11th generation tablet, 2021 release) – Olive",
    "price": 39.99,
    "rating": 4.6,
    "rating_count": 18834,
    "image_url": "https://m.media-amazon.com/images/I/31lOk0iln2S._AC_.jpg",
    "description": "Designed by Amazon to protect and perfectly fit your Fire HD 10 tablet (compatible with 11th generation, 2021 release). Slim design with built-in stand for hands-free viewing. Full-cover case with magnetic connection keeps the cover securely closed while on the go, with easy access to buttons, ports, and cameras. Automatically wake your tablet or put it to sleep by simply opening or closing the case. Premium fabric with a microfiber interior to protect your screen and keep it clean. Supports Fire HD 10 Plus Tablet wireless charging with Made for Amazon Wireless Charging Station by Anker (sold separately). Made with 23% post-consumer recycled plastics and 61% post-consumer recycled fabric. 90% of this accessory’s packaging is made of wood fiber-based materials from responsibly managed forests or recycled sources.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_8",
    "title": "Furinno JAYA Large Entertainment Stand for TV Up to 55 Inch, Blackwood",
    "price": 77.03,
    "rating": 4.2,
    "rating_count": 24541,
    "image_url": "https://m.media-amazon.com/images/I/3121CXp4VES._AC_.jpg",
    "description": "Furinno Large Entertainment Center is a perfect fits into your modern simple lifestyle. It features the large top panel which holds up to 55-Inch Flat Panel TV. There are open display shelves to hold your entertainment equipment and two compartments with doors for your loose stuff such as CDs, DVDs and games. It is easy to assemble, lightweight and space saving. The manufacturing process complies with the green rules of production. There is no foul smell, durable and the material is the most stable amongst the medium density composite woods. The PVC tubes are made from recycled plastic and is tested for its durability. A simple attitude towards lifestyle is reflected directly on the design of Furinno Furniture, creating a trend of simply nature. All the products are produced and assembled 100-percent in Malaysia with 95% - 100% recycled materials. Care instructions: wipe clean with clean damped cloth. Avoid using harsh chemicals. Pictures are for illustration purpose. All decor items are not included in this offer. Note : To ensure proper assembly, please follow all steps provided in the installation manual (provided in pdf below) Large top panel holds up to 50-inch flat screen TV. Open shelves and closed compartments are great for display and storage of entertainment equipment. Material: made from quality particle board and PVC tubes. Easy to assemble. Assembly instruction and hardware pack included. Product Dimension: 47. 24(W) x 19. 53(H) x 15. 87(D) Inches. Weight Capacity: 50 lbs",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_9",
    "title": "Coffea Protective Silicone Case with Keychain for Apple AirPods 2 (Black)",
    "price": 4.99,
    "rating": 4.6,
    "rating_count": 16190,
    "image_url": "https://m.media-amazon.com/images/I/41k1rSapl4L._AC_.jpg",
    "description": "Made of durable 3mm lightweight, flexible silicone; Shock resistant; Features anti-slip grip. Compatible with all Qi standard wireless charging pads; No need to remove the case while wireless charging. ONLY for AirPods 1/2 charging case, NOT FOR AIRPODS PRO. Equipped with a metal carabiner clip; Convenient to attach to a handbag or a backpack. Precise cutout for lighting port with dust cap keeps the charging port clean when not in use. 0.3mm see-through thin wall allows you to check the LED indicator status any time. AirPods Silicone Case ONLY, AirPods and Charging Case NOT Included.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_10",
    "title": "TiMOVO Case for New iPad Air 5th/4th Generation 10.9 inch, iPad Air 5 Case/iPad Air 4 Case, [Support 2nd Gen Apple Pencil Charging] Slim Stand Protective Cover with Auto Wake/Sleep - Midnight Green",
    "price": 16.99,
    "rating": 4.6,
    "rating_count": 15830,
    "image_url": "https://m.media-amazon.com/images/I/41cwUiD50HL._AC_.jpg",
    "description": "💥【Perfect Compatibility】: Preciously designed for New iPad 10.9 inch, iPad Air 5th generation 2022(Model Number: A2588/A2589/A2591), iPad Air 4th generation 2020 (Model Number: A2072/A2316/A2324/A2325). Note: It will not be compatible with other iPad Models. 💥【Full Protection】: This iPad Air 5th/4th generation case with front PU leather and back hard PC cover to provide full-body protection against scratches, shocks, drops and impacts. It is convenient for you to see the Apple icon and your favorite color with the frosted translucent back cover. 💥【Slim & Light-weight】: Slim and lightweight add no bulk to your iPad Air, you could carry it with your iPad Air 2022/2020 everytime and everywhere. 💥【Auto Wake / Sleep】: With Auto Wake / Sleep function, easy and convenient to use. It is access to all features and controls with the case on. Precise cutouts, support Touch ID unlock function. 💥【Convenient Stand Cover】: iPad Air 5/4 trifold stand case cover provides convenient stand position for reading, watching movies or typing.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_11",
    "title": "eMACROS Long Range Solar Wireless Driveway Alarm Outdoor Weather Resistant Motion Sensor & Detector-Security Alert System-Monitor & Protect Outside Property",
    "price": 99.99,
    "rating": 4.4,
    "rating_count": 13125,
    "image_url": "https://m.media-amazon.com/images/I/41+MjUMeUmL._AC_.jpg",
    "description": "eMACROS ADVANTAGE-30 years+ solar driveway alarm wireless and solar driveway alert system produced in our own factory with our leading-edge systems technology. Wireless Solar Driveway Alarm Includes 1 AC Powered Receiver and 2 Sensors. EASY TO INSTALL- Quick Start Guide has you operational in minutes. Can expandable up to 4 sensors and unlimited receivers for complete coverage of your perimeter. Wireless driveway alarm Detects movement from humans, cars, and large animals. Over 4 fun & unique chimes to choose from. Match different chimes with different sensors around your property to differentiate where wireless driveway alarm motion is being detected. SUPER LONG RECEIVING RANGE -We use newer technology components and excellent manufacturing techniques. Our system has been real-world tested in settings with trees, buildings, walls, and vehicles. It easily achieves a 1500FT wireless range in most conditions. It has been tested through thick forestry, hail storms, gusty winds, heavy rains, scorching heat, and snow. SOLAR POWERED NO NEED REPLACE BATTERIES- The sensor is powered by a battery which will be charged by the solar panel, so no need replace the battery, the sensor also can be powered by the DC5V power adapter. EXTREMELY RELIABLE - Much time went into developing and testing our reliable Infrared outdoor driveway alarm wireless detector that will dependably alert you to activity around your property. False alarms are minimized by adjusting the sensitivity of the sensor “eye” with Switch. (Hi = 30ft,Low = 20ft.) See the owner’s instruction manual. Swivel mount to refine the focus and detection angle of the sensor.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_12",
    "title": "Heavy-Duty Wrap-It Storage Straps (Assorted 12 Pack) - Hook and Loop Hanging Extension Cord Organizer for Cable Management and Storage on Garage Wall, RV Gadgets and Appliances",
    "price": 29.99,
    "rating": 4.7,
    "rating_count": 13627,
    "image_url": "https://m.media-amazon.com/images/I/51tQO-+HdcL._AC_.jpg",
    "description": "You know you can hang with the big boys. But can they hang with you? Get your bulky cables, hoses, cords and ropes looped, wrapped tight and stored up and away like a power-lifter with our best-selling Heavy-Duty Storage Straps. Use as a long electrical cord caddy to clear some needed space on your work bench. QUALITY MATERIAL: Made with heavy-duty weatherproof polypropylene, industrial strength hook and loop, and a rust-resistant stainless steel grommet, these heavy-duty storage straps are built to last—indoors or out. Heavy-duty hook and loop can hold up to 50 lbs / 22kgs (10”-28” sizes). GET ORGANIZED: Climb the ladder to a cleaner home without the need for a bulky extension cord reel. These cord hangers mount a case for the best wrapper alive. Their fastener flow makes a great addition to any tool box or kitchen drawer. ENDLESS USES: Use these as an extension cord holder, electric equipment carrier, thick hose hanger, the uses are endless! Give your lonely garage hooks some pro level wraps to carry your cluttered garage into the tide of beautiful, organized, bliss. INCLUDES: (3) 7-inch, (3) 10-inch, (3) 13-inch and (3) 17-inch Heavy-Duty Wrap-It Storage Straps. Give that special person in your life a gift they'll actually use this year!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_13",
    "title": "WINONLY Sleep Headphones Wireless Bluetooth Headband - Valentines Day Gifts for Him Upgrade Soft Eye Mask for Sleeping Long Time Play Music Sport Headbands for Workout Running Yoga Unique for Men",
    "price": 16.99,
    "rating": 4.2,
    "rating_count": 13312,
    "image_url": "https://m.media-amazon.com/images/I/51uvqhFCL2L._AC_.jpg",
    "description": "Top Value from Editional Recommended [Multipurpose Bluetooth Headband Sleep Headphones] - Sleep Headphones & Sleep Eye Mask & Sports Headband 3 in 1. WINONLY Bluetooth headband allows you to listen to your music without having to additional headphones and protects you from being disturbed by your messy hair and sweat. Built-in microphone to let you won't miss any callings. Perfect for sports running yoga office airplane rest & most activities. Even if no play music, the eye cover is comfortable enough to sleep in any position [Longer Playtime and High-quality Playback] - WINONLY sleep headphones offer an upgraded USB chargeable battery, charging about 2-2.5H providing up to 12H playing time. Quality chip sets ensure clear sound and lossless music even if the headphones are in sports. There are built-in microphones and volume control buttons that enable users to answer hands-free phone calls and handle previous/next songs without having to use the phone. WINONLY Bluetooth headband brings you peaceful sleep all night [Super Comfy Soft & Breathable Headband] - WINONLY Bluetooth Headband sleeps headphone is extremely soft and lightweight, with breathable fabric which makes a comfortable experience even if long time use, will easily stretch to fit all head sizes, and also incredibly soft and hypoallergenic. WINONLY Bluetooth headband headphones are washable, simply remove the speakers and clean the band. Useful for wearing an eye mask for sleeping so the light-blocking feature is helpful [Bluetooth 5.2 Stereo Sound with Thin Speakers] - Built-in ultra-thin speaker, which is very comfortable for side sleepers. True HD HIFI sound featuring the latest Bluetooth 5.2 technology that produces great sound quality, Bluetooth can pair your all cellphone and any other Smartphone or iPad Tablet easily. Compatible with Android and Ios. It is the best gift idea for women men family or friends on travel and airplane at festivals [Satisfied Warranty] - Achieve your best sleep with WINO",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_14",
    "title": "Cat6 Ethernet Cable, 12 Feet (2 Pack) LAN, utp Cat 6, RJ45, Network Cord, Patch, Internet Cable - 12 ft - Black",
    "price": 11.99,
    "rating": 4.7,
    "rating_count": 24207,
    "image_url": "https://m.media-amazon.com/images/I/41K1rwo7GSL.jpg",
    "description": "QUALITY CONTROL - Each Cat 6 internet cable 50 ft goes through rigorous testing to ensure a secure wired internet connection with exceptional speed and reliability PERFORMANCE -High performance Cat6 ethernet patch cables are designed with extremely well-matched components for outstanding uniform impedance and very low return loss, providing lower crosstalk, and a higher signal-to-noise ratio; They support frequencies of up to 500 MHz and are suitable for high-speed 10GBASE-T internet connection for LAN network applications such as PCs, servers, printers, routers, switch boxes, and more, while remaining fully backward compatible with your existing network CERTIFICATION - Cat6 Ethernet cable with CM grade PVC jacket complies with TIA/EIA 568-C.2, is ETL verified and RoHS compliant CONFIGURATION - The 12 feet cat 6 ethernet patch cable features 8 solid copper conductors 24 AWG; Each of the 4 unshielded twisted pairs (UTP) are separated by a PE cross insulation to isolates pairs and prevent crosstalk and covered by a 5.8mm PVC jacket with RJ45 connectors and gold-plated contacts; The molded strain relief boots help avoid snags that will damage your cables; They are molded for flexibility and resist common wear and tear",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_15",
    "title": "KLO Bluetooth Mouse for MacBook/MacBook air/Pro/iPad, Wireless Mouse for Laptop/Notebook/pc/iPad/Chromebook (BT/A deep Pink-Black)",
    "price": 14.99,
    "rating": 4.3,
    "rating_count": 23550,
    "image_url": "https://m.media-amazon.com/images/I/41PJuy3JEfL._AC_.jpg",
    "description": "Adopt bluetooth 3.0/5.2 technology, built-in 500mAH A product lithium battery, configuration charging line, like a mobile phone, easy to charge, more scientific, charge and discharge of more than 500 times, the mouse no longer need to buy a battery. size: 113mm x 58mm x23mm weight : 3.2 oz package: Bluetooth mouse x1, USB Charging Cable x1 How to use Bluetooth wireless mouse:Apple Mac MacBook/pro/Air 2012/2013/2014/2015/2016/2017/2018/2019: first, open the mouse switch, open the computer system preferences, open the bluetooth, when the computer Bluetooth display is searching for nearby Bluetooth devices, hold down the mouse button (at the bottom of the mouse small black button) and keep 3 to 8 seconds, and then your computer display the search bluetooth mouse, bluetooth device click on the link, and then the connection is successful Win7/8/10/XP series notebook computer usage instructions: First, open the mouse switch, open the computer settings, open the device Bluetooth function, open add Bluetooth, open Bluetooth, when the computer Bluetooth display is searching for nearby Bluetooth devices, hold down the mouse button (at the bottom of the mouse small black button) and keep 3 to 8 seconds, and then your computer display the search bluetooth mouse, bluetooth device click on the link, and then the connection is successful ✪✪3DPI SWITCH:Using high-performance optical chips, up to 1600 dpi(800, 1200, 1600) accurately tracking,to meet different needs. ✪✪Adopt bluetooth 3.0/5.2 technology,built-in durable 500mAh Lithium polymer rechargeable battery,high cycle life, The charging time is about 1.5-2.5 hours, lasting use time, the Auto Switch Off function will help you save energy as your bluetooth mouse will switch off when your PC is turned off or the receiver is disconnected. If you do not use the mouse for eight minutes, it will go to sleeping mode, you can press the any button to weak it up. energy saving and extremely low power consumption. ✪✪It is compatible with M",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_16",
    "title": "elago Silicone Case with Keychain Compatible with Apple AirPods Case 1 & 2, Front LED Visible, Supports Wireless Charging, Protective Silicone [Dark Grey]",
    "price": 9.99,
    "rating": 4.6,
    "rating_count": 12481,
    "image_url": "https://m.media-amazon.com/images/I/418cbyF9CNL._AC_.jpg",
    "description": "AT ELAGO ALL CASES ARE DESIGNED JUST FOR YOU with a simple and functional design in mind. These cases support BOTH WIRED AND WIRELESS charging for AirPods 2 & 1. We want to make your life SIMPLE AND HASSLE FREE so we added a CARABINER TO KEEP IT HANGING CLOSE! THE PROBLEM WITH MOST CASES ARE that they don’t fit correctly and don’t protect from drops well. ELAGO CASES ARE MADE WITH premium silicone and a special coating applied inside the cap to PREVENT IT FROM FALLING OFF to give you the BEST DROP PROTECTION! THE CASE ALWAYS STAYS on with the hinge design - NEVER HAVE TO WORRY about losing the cap or it falling off. Since the case was MADE SPECIFICALLY FOR AIRPODS, FULL ACCESS TO ALL FEATURES and functions are a given! PERFECT GIFT FOR any AirPods user! Great for BIRTHDAY PRESENTS for loved ones and gifts during the holiday season – ESPECIALLY CHRISTMAS FOR STOCKING STUFFERS! elago is a DESIGN COMPANY FIRST AND FOREMOST. Our motto is SIMPLE SOPHISTICATION because we create products that are USEFUL AND AWESOME! WE ALWAYS CREATE products that WE OURSELVES USE, so we know YOU WILL LOVE IT!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_17",
    "title": "SUPLIK Kids Case for iPad 5th/6th Generation (9.7-inch, 2017/2018), iPad Air 2 Case with Screen Protector, iPad Pro 9.7 Durable Shockproof Protective Cover with Handle Stand for Kids, Black",
    "price": 15.98,
    "rating": 4.6,
    "rating_count": 12854,
    "image_url": "https://m.media-amazon.com/images/I/51+59i44HWL._AC_.jpg",
    "description": "Compatible with iPad 9.7\" 2018(6th Gen,Model:A1893,A1954),iPad 9.7\" 2017(5th Gen,Model:A1822,A1823),iPad Air 1(Model:A1474,A1475,A1476),iPad Air 2(Model:A1566,A1567), iPad Pro 9.7 (Model:A1673,A1674,A1675).NOTE:IT DOESN'T work for Air 3(10.5\") / Air 4/5(10.9\") / iPad 7/8(10.2\") / iPad 1/2/3/4(9.7\").Pls refer the compatible model table at 2nd image. Made from a lightweight,durable,kid-safe,impact-resistant eva&rubber material,provides protection against bumps and drops Non-slip Handle grip is designed to be easy for little hands to carry,it also fits adults Precise cut-outs for buttons, ports and cameras,easy access to all features without removing the case 2 built-in foldable kickstands can stand up your ipad on the desk for hands-free horizontal viewing angle or typing position.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_18",
    "title": "AirPods Case, Full Protective Silicone AirPods Accessories Cover Compatible with Apple AirPods 1&2 Wireless and Wired Charging Case(Front LED Visible),Matcha",
    "price": 10.99,
    "rating": 4.7,
    "rating_count": 24347,
    "image_url": "https://m.media-amazon.com/images/I/41-aMLLlrTL._AC_.jpg",
    "description": "100% SATISFACTION GUARANTEE:We promise to bring the best quality AirPods case to our customer,If you are not satisfied with our products,you can get returns and money back within 12 months. HIGH PREMIUM SILICONE:SATLITOG AirPods case is made of food grade silicone material, which is different from other ordinary silicone case. Even if it is used for a long time, it is still comfortable and does not age. 360°FULL PROTECTIVE:SATLITOG AirPods case use the latest one-piece molding process and micro-matte technology on the surface, leaving no fingerprints,anti-fall and 100% dust-proof,which can be washed quickly. PERFECT FOR YOUR AIRPODS:The newly upgraded fitting technology, without gaps, and the bottom dust plug design, which is a wonderful design that is more convenient for your life,whether you are traveling or in sports. WHAT DO YOU GET:A cost-effective luxury package,you will get:1xAirPods case 1x Carabiner(NOT INCLUDE AIRPODS)",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_19",
    "title": "LTROP New iPad 9th Generation Case 2021, iPad 8th/7th Generation Case for Kids, iPad 10.2 Case 2021/2020/2019, Shockproof Handle Stand Kids Case for iPad 9th/8th/7th Gen 10.2-inch, Teal and Rose",
    "price": 16.99,
    "rating": 4.6,
    "rating_count": 24695,
    "image_url": "https://m.media-amazon.com/images/I/51ar2s8MgIL._AC_.jpg",
    "description": "🍎 Durable Case specifically designed for New iPad 9th Generation 10.2-inch 2021 Release, iPad 8th generation case 2020 (Model: A2428, A2429, A2430, A2270), iPad 10.2 2019 (7th Generation, Model：A2197, A2200, A2198) 🍎 Protect Your Tablet - iPad 9th/8th/7th Generation Case designed to be snug-fitting case with built-in stand allows hands-free viewing in landscape and portrait orientations 🍎 Precise Openings - New iPad 10.2 case 2021 gives easy access to buttons, ports, and cameras 🍎 Great for the Entire Family - Durable lightweight shockproof new iPad 10.2 case comes in a series of enjoyable bright fun colors, great for both kids and adults 🍎 Shop with Confidence - If the item you've received is defective in any way, don't hesitate to e-mail us for free replacement or refund",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_20",
    "title": "INFILAND Compatible with iPad Air 5th Generation Case (2022), iPad Air Case 4th Generation (2020) 10.9 inch with Pencil Holder & Clear Transparent Back [Support Pencil Wireless Charging] Mint Green",
    "price": 14.95,
    "rating": 4.7,
    "rating_count": 13051,
    "image_url": "https://m.media-amazon.com/images/I/4167+VzKOsL._AC_.jpg",
    "description": "Only fit for Apple iPad Air 5th Generation case 2022 released (model number: A2588/ A2589/ A2591) & iPad air case 4th generation 2020 release 10.9 inch (Model A2072/2316/2324/2325),DO NOT compatible with other iPad models. This iPad air 5th generation case / iPad air case 4th generation is built in Apple Pencil Holder, allowing your pencil to charge while storing on the slot, keep the apple pencil as safe as your iPad all the time. Apply durable PU leather exterior, and soft TPU frame with enhanced corners and crystal clear back, this iPad air case 4th generation/ iPad air 5th generation case protects your device against fingerprints, scratches, shocks or accidental drops. Wonderful Tactile & Strong Grip. Automatically Wake up or sleep your device with quick snap on and off the iPad air 4 case / iPad air 5 case. Easy operation and energy-saving. This iPad air 4th generation case / iPad air 5th generation case has Raised Cutout for Camera & easy access to headphone, charging and microphone, offer all-around protection to your new iPad air 2022/2020 released.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_21",
    "title": "Surge Protector Power Strip with USB, TROND Ultra Thin Flat Plug 10ft Long Extension Cord 1625W, 3 USB A & 1 Type C, 4 AC Outlets 1440J Surge Protection Wall Mount for Home Office Dorm Room, Black",
    "price": 21.99,
    "rating": 4.6,
    "rating_count": 11808,
    "image_url": "https://m.media-amazon.com/images/I/31zkgDerkUL._AC_.jpg",
    "description": "Surge Protector Power Strip: This power strip surge protector turns one wall outlet into four with 1440 joules surge protection, protecting your home/office equipment such as tv, computer, printers, copiers, and routers from voltage fluctuations, surges, and spikes. Power Strip with USB: This usb power strip has 3 USB A & 1 USB C charging port, eliminating the need for multiple chargers for your phone, laptop, fire tablet & reader. Great for office, desktop, home, bedside, college dorm room, kitchen, etc. Deliver the faster charge speed up to USB A ports (5V/2.4A) and USB C port (5V/3A) max for each port, (3.4A/17W in total). Ultra Flat Plug & Wall Mountable: The low-profile right angled flat plug design is great for stashing under or behind furniture. Four screw-mounting tabs allow this wall mount flat plug power strip to be securely installed on workbenches, behind the tv, garage, bedside, under counters/desks/cabinets, and dressers. Widely Spaced AC Outlets: We specially designed one ac outlet with super ample space(49mm/1.93\") for plugging large power adapters without blocking other outlets, whether as an indoor desktop power strip or a nightstand charging station, it’s easy to plug your pc, monitor, printer, fan, air purifier, etc. 10ft Extesion Cord: This flat plug power strip comes with 10ft flat extension cord (1625W, 125V/13A), helping you get rid of tangling cords and cable clutter. The portable and slim size make it suitable for home office desktop workbench dorm room, etc.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_22",
    "title": "SAMSUNG 23.5” CF396 Curved Computer Monitor, AMD FreeSync for Advanced Gaming, 4ms Response Time, Wide Viewing Angle, Ultra Slim Design, LC24F396FHNXZA, Black",
    "price": 158.0,
    "rating": 4.7,
    "rating_count": 24081,
    "image_url": "https://m.media-amazon.com/images/I/41dYF-lTQ0L._AC_.jpg",
    "description": "Enjoy a truly immersive viewing experience with the Samsung CF390 Curved Screen Computer Monitor. The 1800R curvature of the screen lets you enjoy big, bold and stunning panoramic views while you work or play. With its design inspired by the curve of the human eye, this monitor delivers a comfortable and enjoyable viewing experience for your home or office use. Featuring an ultra slim and sleek profile, it measures less than 0.5-inch thick. Samsung’s advanced VA panel technology minimizes light leakage across the entire screen and corners to deliver deeper, more uniform blacks. AMD FreeSync dynamically syncs the screen refresh rate with the frame rate of your content to minimize input latency and dramatically reduce image tearing and stutter during gaming. With its 4ms response time, you'll see the fastest on-screen motion clearly and smoothly with less blur, judder, and ghosting. The fast response time provides a steady visual, allowing gamers to compete at the highest level. Eye Saver Mode optimizes your viewing comfort by reducing blue light emissions and flickers at the touch of a button. The excellent 3000:1 contrast ratio delivers deep blacks and bright whites, so you can see clearly in the darkest or brightest scenes. The brightness is 200cd/m2. The Eco-Saving Plus feature reduces screen brightness to save power. IMMERSIVE VIEWING EXPERIENCE: The 1800R curvature of the screen lets you enjoy big, bold and stunning panoramic views while you work or play at home or the office SUPER SLIM DESIGN: Make a stylish statement with its ultra-slim and sleek profile; Monitor measures less than 0.5 inch thick and the simple circular stand adds a modern look to your space ADVANCED GAMING w/ AMD FREESYNC: This technology allows users to enjoy smooth images, even during the fastest moving scenes; It minimizes input latency, dramatically reduces image tearing and stutter FAST 4ms RESPONSE TIME: With its 4ms response rate, you'll see the fastest on-screen motion clearly and smo",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_23",
    "title": "Amazon Fire TV 65\" Omni Series 4K UHD smart TV with Dolby Vision, hands-free with Alexa",
    "price": 599.99,
    "rating": 4.5,
    "rating_count": 22744,
    "image_url": "https://m.media-amazon.com/images/I/41n7s9IdXpL._AC_.jpg",
    "description": "Cinematic 4K entertainment - Get true-to-life picture quality and rich, brilliant colors with support for 4K Ultra HD, Dolby Vision, HDR 10, HLG, and Dolby Digital Plus, and control the TV hands-free with Alexa. HDR like you've never seen - Dolby Vision brings spectacular color, contrast, clarity, and brightness to your screen. Hands-free TV with Alexa - With built-in microphones, just ask to turn on the TV, and find, launch, and control content, so you can put down the remote. Watch what you want - Stream over 1 million movies and TV episodes. Watch favorites with subscriptions to Netflix, Prime Video, Disney+, and more. All your entertainment in one place - Watch live and free TV, play video games, and stream music. Smart and always getting smarter - Fire TV adds new Alexa skills, features, smart home capabilities, and voice functionality all the time. Connect all your devices - Use the 3 HDMI inputs to connect to cable or satellite and video game consoles. The HDMI eARC lets you add audio equipment for enhanced sound. Designed to protect your privacy - Built with privacy protections and controls, including a switch that electronically disconnects the microphones.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_24",
    "title": "MoKo Case Fit iPad Air 5th/4th Generation 10.9 Inch Case 2022/2020, Slim Trifold Stand Cover with Soft Frosted Back, Auto Wake/Sleep, Support Touch ID iPad 2nd Pencil Charging, Dreamy Nebula",
    "price": 15.99,
    "rating": 4.6,
    "rating_count": 11721,
    "image_url": "https://m.media-amazon.com/images/I/51Hovlco-tL._AC_.jpg",
    "description": "🔥 Compatibility - Custom design to your iPad Air 5th Generation 10.9 inch 2022 (Model number: A2588, A2589, A2591)/ iPad Air 4th Generation 10.9 inch 2020 (Model: A2324, A2325, A2072, A2316); accurate cutouts for easy access to all features and controls 🔥 2 Stand Angles - iPad Air 5/4 case foldable front cover help to create a stand with 2 angles for comfortable viewing and typing needs, free your hands for other entertainments 🔥 Support Touch ID Function and Auto Wake/Sleep - Side opening also for Touch ID to function well and with built-in magnetic strip, the case automatically wakes or puts the device to sleep when the lid is opened and closed; protects and extends battery life 🔥 Quality - This iPad Air 10.9\" case made of durable PU leather exterior, soft microfiber lining and covered with soft TPU back shell, providing full body protection against fingerprints, shocks, scratches and dust 🔥 Simple Fashion Design – Slim and lightweight design adds minimal bulk while protecting your precious iPad Air 2022/2020; simple design with translucent frosted back cover allows you to see the icon through your favorite color",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_25",
    "title": "StarTech.com 20ft (6m) Power Extension Cord, NEMA 5-15R to NEMA 5-15P Black Extension Cord, 13A 125V, 16AWG, Outlet Extension Power Cable, NEMA 5-15R to NEMA 5-15P AC Power Cord - UL Listed (PAC10120)",
    "price": 17.94,
    "rating": 4.8,
    "rating_count": 10553,
    "image_url": "https://m.media-amazon.com/images/I/419ZsmTBCGL._AC_.jpg",
    "description": "This 20-foot Computer Power Cord Extension Cable instantly turns a large, awkward power connector into a smaller, streamlined connector. The power adapter will fit into any socket, maximizing the space on your power strip, surge protector, or wall outlet. The power adapter also doubles as a power cord extender, giving you an extra 20ft of reach for your monitor, computer case, or any other powered device. POWER EXTENSION CORD: This 20ft (6m) 16AWG AC power extension cable with NEMA 5-15R and NEMA 5-15P connectors is suitable for workstations/home office | Indoor use | Rated to carry 125V at 13A PERFORMANCE AND SAFETY: UL listed (UL62 & UL817) | Fully molded strain relief on connectors for durability | Fire Rating: VW-1 | 3 Conductor extension cord with 100% copper wire | This cable is available in other lengths SPECS: 20ft (6m) AC Power Cord | NEMA 5-15R to NEMA 5-15P | 16AWG | 125V 13A (Max) | Jacket Type: SJT | Jacket Material: PVC | Black | Temperature Range: 37°F to 140°F (3°C to 60°C) | Cable Outer Diameter: 0.33in (8.5mm) COMPATIBILITY: PC Power Extension Cord NEMA 5-15P works with North American outlets | Extend a 3-prong power connection from your desktop computer, server, or printer | Replacement power supply cable/cord THE IT PRO’S CHOICE: Designed and built for IT Professionals, this extension cord is backed for life, including free lifetime 24/5 multi-lingual technical assistance",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_26",
    "title": "JLab Audio JBuds Pro Bluetooth Wireless Signature Earbuds | Titanium 10mm Drivers | 6-Hour Battery Life | Music Controls | Noise Isolation | Bluetooth 4.1 Extra Gel Tips and Cush Fins | Black/Purple",
    "price": 19.87,
    "rating": 4.2,
    "rating_count": 11257,
    "image_url": "https://m.media-amazon.com/images/I/31BylRo+XcL._AC_.jpg",
    "description": "PREMIUM SOUND QUALITY: These earbuds use 10 mm sound drivers to deliver full range audio with deep bass all in a compact size. The design of the JBuds Pro helps block out ambient sounds so that you can listen to your music/video’s comfortability in public places such as trains and buses. 6-HOUR PLAYTIME: Keep your music hassle-free by wirelessly linking your Bluetooth enabled device and streaming from up to 30 feet away. With up to 6 hours Bluetooth playtime of mind-blowing sound that’ll leave you with good vibes all day long. COMFORTABLE FIT: The earbuds fit perfectly in your ears and provide a comfortable listening experience you can use all day. 3 soft silicone gel tips provide a super comfortable, noise-reducing fit and 2 Cush Fins guarantee a perfect fit. TAKE CONTROL: The JBuds Pro are built with and in-line remote and microphone, so you can control the volume, skip tracks, activate Siri, Google Assistant and answering or hanging up calls all without taking out your phone. TWO YEAR WARRANTY/30 DAY GUARANTEE -We are so sure you’ll be happy with your purchase that we offer a “30-Day Money-Back Guarantee” to ensure customer satisfaction of our Jlab products. Also included with our products is a 2-year limited warranty to ensure you are covered for up to two years in case any issues with our products arise.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_27",
    "title": "UGREEN Micro HDMI to HDMI Cable Adapter 4K 60Hz Ethernet Audio Return Channel Compatible with GoPro Hero 7/6 Raspberry Pi 4 Retroid Pocket 2+ Yoga 3 B500 Sony A6000 Camera Video Capture Card 6FT",
    "price": 11.99,
    "rating": 4.6,
    "rating_count": 12419,
    "image_url": "https://m.media-amazon.com/images/I/41imRVnSHJL._AC_.jpg",
    "description": "4K Micro HDMI Cable: UGREEN HDMI to Micro HDMI cable supports 4K, 2K, 1080P Full HD Resolution, 3D, Audio Return Channel(ARC), providing life-like and fluent frames to your large display screen, bringing you a realistic 3D screen experience. NOTE: This product is Micro HDMI to standard HDMI, not Micro USB to HDMI. Bi-Directional: This micro cable supports HDMI Micro to HDMI & HDMI to Micro HDMI. It can help you to stream audio and video from a camera with a Micro HDMI Port to Your TV with an HDMI port. It enables you to play games on your big-screen HDTV display or share a high-definition video together with your family and friends. Textured and High-quality Materials: Featuring gold-plated connectors, copper conductors, aluminum foil, and braid shielding, this high-speed HDMI to Micro HDMI male to male cable is built with enhanced durability and minimal interference. Reliable Signal Transmission: Tinned copper core wire with multiple shielding ensures efficient transmission with less data loss. Give you an immersive experience without interruption. Wide Compatibility: Compatible with a video capture card, Raspberry Pi 4, GoPro Hero 7, Hero 6 Hero5, Hero 4, Hero 3, Hero3+, Go Pro Hero 2018, Sony A5000 Handycam, Sony A6500 A6000 A6400 A73 A7S camera, Nikon b500, Canon EOS M50, IdeaPad Miix 300 Tablet, Ideatab Miix 700 Miix 2 710 S6000, ThinkPad 10 8, Yoga 2 Pro 3 ultrabook, Yoga 700 710, 710s, ASUS ZenBook UX305UA, Transformer Mini T102HA. Note: This Micro HDMI cable can not compatible with Samsung phones or tablets with a Micro USB port.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_28",
    "title": "UESWILL Compatible with MacBook Pro 13 inch 2016-2022, Model A2338 M2 M1 A2289 A2251 A2159 A1989 A1706 A1708 Touch Bar USB-C, Matte Hard Shell Case Cover, Peacock Green",
    "price": 13.99,
    "rating": 4.4,
    "rating_count": 10687,
    "image_url": "https://m.media-amazon.com/images/I/31-VAqaGS0L._AC_.jpg",
    "description": "Compatible with: MacBook Pro (13-inch, 2016,2017,2018,2019,2020, Two/Four Thunderbolt 3 ), MacBook Pro (13-inch, M1, 2020),MacBook Pro (13-inch, M2, 2022), Model: A2338 / A2289 / A2251 / A2159 / A1989 / A1706 / A1708. Made of high polycarbonate, Hard Shell Case with Rubber oil Paint for Rich Silky-smooth touch while Protecting your MacBook from everyday scrapes and scratches. The slim design of the cases make it easy to carry inside your bags,or briefcase. Access to all Ports: Case Design lets you Open/Close your MacBook all the way and Access to all Ports. *Crafted with vent slots to ensure proper heat dissipation. *No Apple Logo cut out design. NOT Compatible with Macbook Air 13\", Not Compatible with old MacBook Pro 13\" with CD-ROM A1278 and 2012-2015 MacBook Pro Retina 13\" (A1502/A1425). Please double check your MacBook's model number \"Axxxx\" on the bottom of the laptop to determine the compatibility. ONLY for Model A2338 / A2289 / A2251 / A2159 / A1989 / A1706 / A1708.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_29",
    "title": "Anker USB-C to USB-C Cable, 643 Cable 100W 6ft, USB 2.0 Type C Charging Cable Fast Charge for MacBook Pro 2020, iPad Pro 2020, iPad Air 4, iPad Mini 6, Galaxy S21, Pixel, Switch (Lilac Purple)",
    "price": 19.54,
    "rating": 4.8,
    "rating_count": 9653,
    "image_url": "https://m.media-amazon.com/images/I/31HSrQvW-2L._AC_.jpg",
    "description": "Soft to the Touch: You've never felt a cable like this before; The silicone finish feels remarkably soft between your fingers as you plug PowerLine III Flow into your device Super Strength: Our softest cable ever is also one of our strongest;PowerLine III Flow has a 25,000-bend lifespan, more than enough to handle the stresses and strain of charging on the go Bend It, Twist It, Flex It: Remains tangle-free even when stuffed into a bag or pocket, or wrapped around a portable charger Fast Charging: Supports a max power output of 100W to charge virtually any USB-C device, including phones, tablets, and laptops",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_30",
    "title": "FosPower (3 Feet 24K Gold Plated Toslink Digital Optical Audio Cable (S/PDIF) - [Zero RFI & EMI Interference] Metal Connectors & Ultra Durable Nylon Braided Jacket",
    "price": 8.99,
    "rating": 4.7,
    "rating_count": 10544,
    "image_url": "https://m.media-amazon.com/images/I/51DIz2oBQgL.jpg",
    "description": "[PROTECT YOUR TOSLINK CABLE WITH BUILT-IN END CAPS] FosPowerâ€s toslink digital optical audio cable has built-in end caps to protect your connectors. No longer worry about broken connection points. [INTERFERENCE FREE TOSLINK CABLE] No more Interference! Constructed from a high-quality fiber that completely eliminates RF, EM, and group loop interference. [PREMIUM QUALITY DESIGN] Unlike others, FosPowerâ€s Toslink cable is designed with high-quality parts. With metal connections and a durable nylon mesh jacket this cable is optimized for maximum protection against wear and tear. [24k GOLD-PLATED CONNECTION] This Toslink digital optical cable has 24k gold-plated connections and ferrules that resist corrosion, tarnish, and provide maximum protect for the fiber tip [LIMITED LIFETIME WARRANTY] This FosPower product includes a limited lifetime warranty. Please visit our FosPower website for more details",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_31",
    "title": "Walkie Talkies Long Range, Topsung M880 FRS Two Way Radio for Adults with Mic LCD Screen/Durable Wakie-Talkies with Noise Cancelling for Men Women Outdoor Adventures Cruise Ship (Yellow Green 2 in 1)",
    "price": 29.99,
    "rating": 4.3,
    "rating_count": 9077,
    "image_url": "https://m.media-amazon.com/images/I/41pNUMwhIhL._AC_.jpg",
    "description": "Topsung adult walkie talkies can achieve one-to-many communication with legal free license, so you can stay in touch with all family members  or all your travel partners at the same time, there is no call charges will be generated.   Topsung travel walkie talkies are easy to operate and carry even for kids. So they are suitable for indoor and outdoor activities,  such as home, mall, cs games, camping, hiking, cycling, cruise ship, road trip, etc. 【 Main Parameters 】 1. Long standby time ( Up to 3-4 days ) 2. Power by 3 AA batteries ( Not included ) 3. Long range in different terrains ( Up to 1 / 4 / 16 miles ) 4. 22 main channels and 121 privacy codes ( 2662 Combinations ) 【 Smart System 】 1. Auto squelch system mutes the background noise to get crisp and smooth sound 2. Auto monitor function checks for signals fast with pressing monitor button 3. Auto memory function keeps all setting when the walkie talkies power off 4. Auto scan function finds active channel fast with a click of scan button 5. Auto switch to power saving mode when the radios are not in use 6. Auto remind you to charge or replace the batteries 【 Friendly Design 】 1. Palm size 2. Lightweight ( 2.9oz ) 3. Hands free function ( VOX ) 4. Keypad lock ( Channel lock ) 5. Adjustable power and volume 6. Belt clip with lanyard hole 7. LCD screen with backlight 8. 2.5mm earpiece jack with dust plug 9. Durable and environmentally friendly materials ( ABS ) 【 What You Get 】 1. 1 × User's Manual 2. 2 × Family Walkie Talkies 3. Amazon FBA Service 4. 30 Days Return Service 5. Topsung Friendly Customer Service 【Smart System】: Auto squelch system, Auto monitor function, Auto memory function, Auto scan function, Auto power saving, Low battery alert 【Main Parameters】：22 main channels and 121 privacy codes(2662 Combinations), Long range in different terrains(Up to 1/4/16 miles), Long standby time(Up to 3-4 days), Power by 3 AA batteries(Not included) 【Friendly Design】：Palm size, Lightweight(2.9oz), Hands free functio",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_32",
    "title": "ISSUNTEX 10X16 ft Background Muslin Backdrop, Photo Studio, Collapsible High Density Screen for Video Photography and Television-White",
    "price": 39.99,
    "rating": 4.5,
    "rating_count": 8746,
    "image_url": "https://m.media-amazon.com/images/I/21Vic+UfxPL._AC_.jpg",
    "description": "Size: 10X16ft (3X4.8M) Background, perfect for television, video production and digital photography Soft fabric: High quality soft fabrics, effective wrinkle resistance Non-gloss: Microfiber non reflective and non-gloss surface Easy to instell: Rod pocket on each top edge allows to be draped or hung Easy to care: Simply dust off the surface and it will be ready to use. Machine washable.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_33",
    "title": "VIZIO Sound Bar for TV, 29” Surround Sound System for TV, Home Audio Sound Bar, 2.0 Channel Home Theater with Bluetooth – SB2920-C6",
    "price": 149.99,
    "rating": 4.4,
    "rating_count": 9088,
    "image_url": "https://m.media-amazon.com/images/I/31mknK0mSOL._AC_.jpg",
    "description": "The all-new VIZIO 29\" 2.0 Sound Bar offers amazing audio in a compact size. Its sophisticated new design makes it an attractive addition to any 32\"+ class TV. Use Bluetooth to stream music from your smartphone, tablet or computer. With everything you need for a quick and easy setup, upgrading to an amazing home theater experience has never been easier - plug the Sound Bar in, connect it to your TV, sit back and enjoy. The 2.0 Sound Bar features two powerful full-range stereo speakers that boost your audio and deliver amazing sound. Streamlined Design VIZIO Sound Bars are crafted to accentuate your TV with a minimalist body style that blends in with any room of your home. VIZIO Sound Bars utilize DTS audio technologies to deliver elevated multi-channel audio for the most immersive sound quality. 2.0 Premium Audio The VIZIO 2.0 Sound Bar is an easy way to enhance your audio experience when watching your favorite content on the TV. The full-range stereo speakers boost your audio, while DTS technologies simulate incredible surround sound Bluetooth Streaming Lose the wires and listen to your music with a tap of a finger from anywhere in the room. (Performance and compatibility among Bluetooth devices may vary.) Easy Setup With everything you need for a quick and easy setup, upgrading to a powerful audio experience has never been easier. Connect the Sound Bar to your TV using one of the included cables, sit back and enjoy Features DTS Studio Sound, DTS TruVolume and DTS TruSurround Ergonomic Remote for convenient access to volume, input and audio controls Table-stand or wall-mount options Dimensions",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_34",
    "title": "Kinmac 360° Protective Waterproof Laptop Case Bag Sleeve with Handle for MacBook Pro 16, and 15 inch-15.6 inch Laptop (Banana Leaf)",
    "price": 21.38,
    "rating": 4.8,
    "rating_count": 8699,
    "image_url": "https://m.media-amazon.com/images/I/51SGCz3G5vL._AC_.jpg",
    "description": "Kinmac 360° super shockproof design: High rebound EVA bubble around the bag protect you laptop from any angle's drop Interior Dimension:14.17 inch x 9.45 inch x 0.79 inch COMPATIBLE WITH: Macbook Pro 16|2021 Newest Dell Inspiron 15 5510, Dell Inspiron 15 5515 |2021 New XPS 15 Laptop |2021 Dell Vostro 15 5510| ASUS VivoBook 15 Thin and Light Laptop| ASUS ZenBook 15 Ultra-Slim Laptop |14 inch-15 inch Laptop Size smaller than 14.17 inch x 9.45 inch x 0.79 inch Extra Pocket with zipper can hold mouse, cables, power, chargers, mobile phone and so on The retractable handle design is comfortable to carry laptop Waterproof canvas can effectively prevent your device from water and rain.Soft and fluffy interior avoid your laptop from scratching",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_35",
    "title": "MoKo Case Fit Apple iPad Pro 9.7 Inch 2016 Release Tablet (A1673/A1674/A1675) - Slim Lightweight Smart Shell Stand Cover with Translucent Frosted Back Protector, Black (with Auto Wake/Sleep)",
    "price": 12.99,
    "rating": 4.5,
    "rating_count": 8771,
    "image_url": "https://m.media-amazon.com/images/I/31HukDkBRDL._AC_.jpg",
    "description": "Compatibility - Designed exclusively for Apple iPad Pro 9.7 2016 Release (model number A1673, A1674, A1675) tablet. Note: DO NOT fit other Tablet. Access to all features and controls. Adjustable Angles - Strong magnetic connection to create a stable viewing stand for your tablet. Two angles are provided for satisfying your viewing and typing needs. Avoid any joint pain, and free your hands for other entertainments. Auto Wake/Sleep - Built-in magnetic strip, automatically wakes or puts iPad Pro 9.7 2016 to sleep when the lid is opened and closed. Protects and extends battery life. Excellent Quality - Made of durable PU leather exterior, soft microfiber lining and coverage with translucent PC back shell, this case provides total full body protection against fingerprints, shocks, scratches and dust. Professional Design - Precise cutouts for improved access to all features and controls. The slim and lightweight soft back design adds minimal bulk while protecting your precious device. The translucent frosted back cover allows you to see the icon through your favorite color.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_36",
    "title": "Herschel Little America Laptop Backpack, Ash Rose, Classic 25.0L",
    "price": 104.54,
    "rating": 4.7,
    "rating_count": 8682,
    "image_url": "https://m.media-amazon.com/images/I/41OJKq3x54L._AC_.jpg",
    "description": "An iconic silhouette with timeless appeal, the popular little America backpack elevates a classic mountaineering style with modern functionality. HERSCHEL COLLECTION: Click on our brand logo at the top of the page to explore the full collection from Herschel Supply. DURABLE DESIGN: A timeless silhouette inspired by the classic mountaineering style. Sturdy polyester and nylon fabric, made for all adventures. Signature striped liner, drawcord closure and magnet-fastened straps with metal pin buckles. Finished with Herschel’s classic woven label. Spacious, versatile and tech-friendly, the Herschel Little America is suited for both your everyday commutes and your airplane carry-ons. MEN/WOMEN/UNISEX: The Herschel Little America Backpack was made for everyone. Use it for your commute, the school week, a business trip, or a weekend adventure. 25L CAPACITY: 19.25” high and 11. 25” wide. From your passport to your heavy textbooks, there’s plenty of space to fit everything you need for school, work or travel. COMFORTABLE CARRYING: Padded, contoured shoulder straps and breathable air mesh back padding, designed for a more supportive and comfortable commute to work or school. The Herschel Little America also makes for the perfect airplane carry-on. EASY TO ORGANIZE: Multiple compartments for keeping your essentials in place. Front pocket with key clip and hidden zipper, offering anti-theft protection. Tech-safe sleeve is padded and lined with fleece, fits laptops up to 15”. An internal media pocket is the ideal fit for your smartphone, and the additional headphone port is perfect for an on-the-go playlist.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_37",
    "title": "Laptop Sleeve Elastic Neoprene Case Compatible with 13-14 inch MacBook Air/Pro M1 M2, XPS 13, Surface Laptop 13.5\", Water Repellent Notebooks Hand Bag with Handle and Small Case,Butterfly",
    "price": 15.99,
    "rating": 4.6,
    "rating_count": 8298,
    "image_url": "https://m.media-amazon.com/images/I/51wJ5C7w1+S._AC_.jpg",
    "description": "【DIMENSIONS & COMPATIBILITY】: The big bag internal dimension is: 13.58 x 0.79 x 9.64 inch (L x W x H); The additional small pouch bag internal dimension is: 5.71 x 0.59 x 5.12 inch (L x W x H); Fits 13-14 inch MacBook Air/Pro M1 M2, Surface laptop 13.5\", XPS 13-14 inch and most popular 13-13.5 inch notebooks. 【360°PROTECTION】: Thick internal plush lining cushioning base on low rebound foam padding provides shock and scratches absorption for your laptop and high-grade neoprene is Waterproof Durable and comfortable to touch. 【EXTRA-STORAGE】: Additional small storage pouch bag for you to storage Macbook mouse / Macbook charger / earphone. This small pouch bag has a hook easy to carry with the laptop handbag, harmony and stylish. 【EASY to CARRY】: This slim laptop sleeve with the leather handles bring a good touch and easy to carry, it features a small D ring & hook to carry on the small accessory bag. 【LIFE-TIME QUALITY ASSURANCE】: LIFE-TIME Warranty from Hseok and friendly 7x24 hours customer service.If you are not 100% satisfied, we are not. We will refund the full purchase price or provide replacement - without ifs & buts!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_38",
    "title": "GE Personal Security Window and Door Alarm, 1 Pack, DIY Protection, Burglar Alert, Wireless, Magnetic Sensor, Off/Chime/Alarm, Easy Installation, Ideal for Home, Garage, Apartment and More, 56789",
    "price": 7.99,
    "rating": 4.5,
    "rating_count": 11619,
    "image_url": "https://m.media-amazon.com/images/I/41pHbqBnONL._AC_.jpg",
    "description": "Product Description The GE Personal Security Window/Door Alarm provides a simple-to-use, cost-effective security solution to protect you and your family against home invasions thanks to the 120-decibel alarm, loud enough to make a would-be intruder think twice about entering through your window or door. The alarm is also extremely easy to use. The window/door alarm features a contemporary design with easy access buttons and controls for simple operation. This straightforward concept makes using the GE Personal Security Window/Door Alarm intuitive, no matter what your technological skills may be. The GE Personal Security Window/Door Alarm includes one window/door alarm with a built-in 120-decibel alarm for even greater home security. With no wires required for installation, protecting any window/door in your home is as easy as attaching the alarm to your window/door with double-sided tape (included). Each window alarm features an on/off/chime switch for easy operation and a low battery test button for checking battery life. Perfect for homes, apartments, dorm rooms and offices. From the Manufacturer The GE Personal Security Window/Door Alarm provides a simple-to-use, cost-effective security solution to protect you and your family against home invasions thanks to the 120-decibel alarm, loud enough to make a would-be intruder think twice about entering through your window or door. The alarm is also extremely easy to use. The window/door alarm features a contemporary design with easy access buttons and controls for simple operation. This straightforward concept makes using the GE Personal Security Window/Door Alarm intuitive, no matter what your technological skills may be. Perfect for homes, apartments, dorm rooms and offices. Safe and Secure – Ward off would-be intruders with a 120-decibel alarm triggered by a high-quality magnetic sensor, or choose for a chime to sound when windows or doors are opened and closed User Friendly – Features an easy-to-use OFF/CHIME/ALARM",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_39",
    "title": "GTSE 12 Inch Yellow Zip Ties, 100 Pack, 40lb Strength, UV Resistant Long Nylon Cable Ties, Self-Locking 12\" Tie Wraps",
    "price": 9.99,
    "rating": 4.7,
    "rating_count": 7504,
    "image_url": "https://m.media-amazon.com/images/I/318C2HvJWpL._AC_.jpg",
    "description": "What's in the package? You'll receive a 100-pack of high-quality yellow nylon zip ties, which have been designed for both indoor and outdoor use. Item specifics Dimensions (length x width): 12\" x 0.14\" Material: Durable and UV-resistant nylon polyamide 6/6 Color: Yellow Active working temperature: -40°F to +185°F Flammability rating: UL 94 class V2 Dielectric strength: 50,000 volts/mm More about this product These great-value 12\" x 0.14\" premium zip ties are perfect for all sorts of applications, whether you're just putting together something in your home, or carrying out a huge building project as part of a commercial contract. At an industry-standard 12\" (300mm) length, you've got plenty of room for manoeuvre with these zip ties - and their larger-than-normal width keeps objects even more secure. PACKAGE CONTAINS: 100 high-quality nylon cable ties SIZE: 12\" x 0.14\" (Strength 40lb) COLOR: Yellow BUILT TO LAST: Made of industrial strength nylon 6/6, GTSE zip ties are able to withstand even the toughest weather conditions (working temperature -40°F to +185°F). Each zip tie features a durable self-locking mechanism which doesn't falter over time. LIMITLESS APPLICATIONS: Perfect for home DIY, commercial purposes, cable management and gardening. Our zip ties are proudly used by households, contractors and industry all over the world!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_40",
    "title": "LEADSTAR HDMI Cable 4K 60HZ 25 Ft, 18Gbps High Speed HDMI 2.0 Cable HDCP 2.2 HDR 3D ARC Ethernet - Braided HDMI to HDMI Cord Compatible with Monitor Xbox Series X, Playstation 5, Switch, Fire TV",
    "price": 18.99,
    "rating": 4.7,
    "rating_count": 7023,
    "image_url": "https://m.media-amazon.com/images/I/41WfVS20MtL.jpg",
    "description": "【 High Quality HDMI Cable 】 Durable nylon-braided with a bend lifespan of 10000+, Pure copper core manufacturing; Built with gold-plated connectors,and top American chips to ensure high-speed and flawless signal transmission 【High Speed】 Our HDMI Cord Supports high dynamic range imaging (HDR) video transmission bandwidth of up to 18 GBPS 4 k @ 50 and 60 / (2160 p),The Video resolution clarity is four times as 1080P/60 Video resolution clarity,Up to 32 audio channels for multidimensional and immersive audio experience,CEC extensions provide more extension commands and control of consumer electronics devices through a single control point. 【 improvement HDMI 2.0 cable 】 This HDMI Cable meets the latest standard HDMI 2.0 Version,It has been tested for many times on many hdmi devices and certified,Perfectly fit for all devices with HDMI 2.0 standard as well as compatible with previous HDMI 1.2,1.3,1.4,1.5,1.8,2.1.It's a good choose for advanced work and entertainment,It can provide a stable and high quality picture image to improve and guarantee the work efficiency and the visual effect of watching movie at home. 【Compatible HDMI Device】Widely compatible with Set - top box、DVD player、PC、video game（PS3/PS4/PS5）、Integrated Amplifier、digital audio、TV set Blu-ray players、Fire TV、Apple TV、XBox one、Xbox 360、Ethernet Monitor、HDTV 4K Fire Netflix、computers and other HDMI-enabled devices to Roku Fire TV Switch Vizio Sony LG Samsung、TVs、displays、A/V receivers、xbox series x etc 【 Quality Warranty】Leadstar 4K HDMI Cable 25ft can offer replacement if it doesn't work within 12 months,please contact us for help via Amazon if any problem related to this HDMI 2.0 cable,we will help you within 24 hours.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_41",
    "title": "ieGeek 11.5\" Portable DVD Player with SD Card/USB Port, 5 Hour Rechargeable Battery, 9.5\" Eye-Protective Screen, Support AV-in/ Out, Region Free, Purple",
    "price": 69.99,
    "rating": 4.5,
    "rating_count": 7131,
    "image_url": "https://m.media-amazon.com/images/I/51J6twD-s3L._AC_.jpg",
    "description": "👨‍👩‍👧 Portable and Magical ---- Compact design makes it easy to carry out with you. Take it on your road trip, be companioned by your child, brings tons of fun for your journey. ieGeek DVD player can be easily swiveled as a tablet and mounted to the car headrest. 👨‍👩‍👧 Durable and Safe ---- Upgraded battery capacity to 2500mAh, ensures 5 hours lasting time. We also provide a certificated AC power adapter and high-quality car charger in the package, no more worries about the battery dying out when you are out. 👨‍👩‍👧 Sonorous and Loud Volume ---- ieGeek portable DVD players equipped with two high-power speakers, which makes the volume louder and clearer. Not enough? There is a 3.5mm earphone jack on the right side of the player so that you can get a concentrated and clear sound. 👨‍👩‍👧 All Regions, Multi Formats ---- Supports CD, DVD, DVD+R(-R), DVD+RW(-RW), VCD, SVCD-R(RW), CD-R(RW) from 6 regions (Blu-ray and pirated discs are not supported); ieGeek also supports multi-media files via USB and SD Card (16-32GB), such as VOB, AVI, MPEG, MP3, WMA, JPEG. 👨‍👩‍👧 Protective and Gorgeous Screen ---- ieGeek adopts the HD Eye-protective Screen, and refuses the recycled screen, aiming at alleviating eye fatigue caused by the long use, more comfortable and protective screen for your kids’ eyes.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_42",
    "title": "Postta HDMI Cable(100 Feet Yellow) HDMI 2.0V with Built-in Signal Booster-Support 4K,3D,1080P,Ethernet,Audio Return-1 Pack",
    "price": 59.99,
    "rating": 4.6,
    "rating_count": 7899,
    "image_url": "https://m.media-amazon.com/images/I/417KBPziYiL._AC_.jpg",
    "description": "Postta 100 Feet HDMI Cable can compatible with Blu-Ray player,PS3,PS4,XBOX 360,DVD Players,3D TV's,Computer,Home Entertainment device and other HDMI-compatible device. Product Features Cable use 24K gold plated connectors and high-quality PVC material,CL3 rated for in wall installations,with environmentlly-friendly,wear-resisting and aesthetic features to ensure the using process more secure and reliable. The cable can support 3840*2160,3D,1080P,Ethernet Channel,Audio Return Channel and more. The cable can reach 18Gbps transfer speed and bring you faster and more HD experience. Fit Blu-Ray player,PS3,PS4,XBOX 360,DVD Players,3D TV's,Computer and more HDMI-compatible device. Product Specification HDMI2.0 Version OD:8.8 ± 0.2mm 99.99% Oxygen Free Copper conductor 24K Gold Plated connectors High-quality PVC material With CE,ROHS and REACH Certification 1 Year Warranty PLEASE NOTE INPUT(Source):Connect Laptop,PC,DVD,Cable Box,TV Box,Blu-Ray Player and more source device with HDMI Port.OUTPUT(Screen):Connect HDTV,Monitor,Projector and more display devices with HDMI Port. 100 Feet Speed HDMI 2.0V Cable,24K Gold Plated Connectors with 99.99% Oxygen Free Copper Conductor for Better Image/Sound Quality/Stable signal transmit and more durable. Built-in Signal Booster can support 4K,3D,1080P,Ethernet Channel,Audio Return Channel and more,It can reach 18Gbps transfer speed and bring you faster and more HD experience. Compatible with Blu-Ray player,PS3,PS4,XBOX 360,DVD Players,3D TV's,Computer,Home Entertainment device and other HDMI-compatible device. Cable use high-quality PVC material,CL3 rated for in wall installations,with environmentlly-friendly,wear-resisting and aesthetic features to ensure the using process more secure and reliable. PLEASE NOTE:This 100 Feet HDMI Cable with Built-in Signal Booster is Directional,If you Plan to Permanently install this Cables,Recommends that You Test and Connect the Cable before Installing.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_43",
    "title": "RICHEN 11 11.6 12 12.5 13 inches Case Laptop/Chromebook/Ultrabook/MacBook pro air Notebook PC Messenger Bag Tablet Travel Case Neoprene Handle Sleeve with Shoulder (11-13.3 inch, Butterflies)",
    "price": 22.98,
    "rating": 4.7,
    "rating_count": 7306,
    "image_url": "https://m.media-amazon.com/images/I/51U-pjnzvAL._AC_.jpg",
    "description": "100% Brand New Neoprene bag,High Quality Printing on Both Side of The Sleeve with Handle & Soft Inner Lining. Zipper Closure with External Pocket for Mouse, Adapter,USB etc SUPER SOFT NEOPRENE MATERIAL:Outside Soft Handle and Adjustable Shoulder Strap for Easy Carrying,Same Image on Both sides,soft,Waterproof,Light and comfortable,Washable,easy to Dry, Never Fade DOUBLE ZIPPER DESIGN: External Pocket for Adapter and Mouse, Double Zipper Design for the Main Compartment,Reinforced Dual Zipper to Secure Your Device & D ring Hook (eyelets) For Shoulder Strap SHOULDER BAG MESSENGER BAG DIMENSION :About 33.5cm(13.2 inch) x 25.5cm( 10 inch),Please Measure from side to side,not Diagonal. Compatible with : Most of 13\"/ 13.1\"/ 13.3.\"/ laptops Tablets COMPLETE SATISFACTION: Our RICHEN Shoulder Bag Messenger Bag Case Bag is Available in a Variety of Wonderful colors, However, If You aren't Completely with our RICHEN Laptop Shoulder Bag, Simply Return (Doesn't affect secondary sales) Them Within 30 days For a Full Refund.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_44",
    "title": "MoKo Case Fits Kindle Fire 7 Tablet (9th Generation, 2019 Release), Premium PU Leather Slim Folding Stand Shell Multiple Viewing Angles Cover with Auto Wake/Sleep - Black",
    "price": 12.99,
    "rating": 4.7,
    "rating_count": 7680,
    "image_url": "https://m.media-amazon.com/images/I/51YYqyFZxuL._AC_.jpg",
    "description": "Perfectly compatible with All-New Amazon Kindle Fire 7 Tablet (9th Generation - 2019 Release). Automatically wakes or puts your device to sleep when the lid is opened and closed. Lightweight and portable. Premium PU leather exterior and microfiber interior adds more comfort. Flip stand design for typing and viewing angles conveniently. Magnetic closure for easy opening and closing your Tablet. Precise cutout. Easy access to all features and controls. You can charged your Tablet without removing the protective case. Please search \"MoKo Kindle Fire 7 2019 Case\" for other accessories offered by BSCstore.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_45",
    "title": "May Chen Compatible with MacBook Air 13 inch Case 2021 2020 2019 2018 Model: M1 A2337 A2179 A1932, Plastic Matte Hard Shell Case for MacBook Air 13 inch with Retina Display Fits Touch ID, Airy Blue",
    "price": 18.99,
    "rating": 4.2,
    "rating_count": 7113,
    "image_url": "https://m.media-amazon.com/images/I/41JMc7AovHL._AC_.jpg",
    "description": "Compatible with： For Macbook Air 13 2018 2019 2020 2021 Release ( Models: A1932 A2179 A2337) * Release 2020: MREE2LL/A, MREC2LL/A, MRE82LL/A, MREA2LL/A, MREF2LL/A, MRE92LL/A * Release 2019: MVFH2LL/A, MVFM2LL/A, MVFK2LL/A, MVFJ2LL/A, MVFN2LL/A, MVFL2LL/A * Release 2018: MREE2LL/A, MREC2LL/A, MRE82LL/A, MREA2LL/A, MREF2LL/A, MRE92LL/A Note: Please kindly check the model number \"A1XX\" on the bottom of your for MacBook before purchase Case Not Compatible with : -- Not fit for MacBook Air 13.6\" M2 wtih Liquid Retina display and Touch ID 2022 Release. -- Not fit for Macbook Air 13\" (Model: A1369 / A1466) -- Not fit for Macbook Pro 13\" with Retina Display with touch bar & touch ID (A2159 / A1706 / A1989) -- Not fit for Macbook Pro 13\" with Retina Display without touch bar & touch ID (A1708) -- Not fit for Macbook Air 13\" (Model: A1369 / A1466) -- Not fit for Old Macbook Pro 13\" with Retina Display (A1502 / A1425) -- Not fit for Old Macbook Pro 13\" (A1278) MacBook Hard Shell Cover Made from High Quality PC Material. Prevent Fingerprints, Slipping, Scratches, Drops, Dirt, Smudges and Other Damages Efficiently. Adding different colors to your life and bringing comfortable touch feeling. With cut-out designed, it can let you Open/Close your MacBook all the way and Full Access to All Ports. Bottom Shell Case Cover Vented for Maximum Heat Dissipation and Disbursement. Totally removable, easy to put on and take off that can protect your MacBook Air from scrapes and scratches. Package including: 1* Hard Shell Case ( with Top Cover + Back Cover) 1* Screen Protector 1* Silicone Keyboard Cover 1* Dust plug 【 COMPATIBLE WITH 】 Designed to Fits Perfectly New For MacBook Air 13 inch with Retina Display & Touch ID Models: M1 A2337 A2179 A1932, 2021 2020 2019 2018 Release MVFH2LL/A, MVFM2LL/A, MVFK2LL/A, MVFJ2LL/A, MVFN2LL/A, MVFL2LL/A, MREE2LL/A, MREC2LL/A, MRE82LL/A, MREA2LL/A, MREF2LL/A, MRE92LL/A . 【 WARNING PROMPT： Please read the incompatible models carefully 】This case is NOT comp",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_46",
    "title": "Lens Cap Bundle - 4 Snap-on Lens Caps for DSLR Cameras - 4 Lens Cap Keepers - Microfiber Cleaning Cloth Included - Compatible Nikon, Canon, Sony Cameras (55mm)",
    "price": 7.99,
    "rating": 4.6,
    "rating_count": 7235,
    "image_url": "https://m.media-amazon.com/images/I/41thJshCU4L._AC_.jpg",
    "description": "Protects the front portions of your lens from water, dust, and scratches. Center pinch design allows easy attachment and removal, even with a lens hood in place. Pinch the sides of the cap and snap it into place. Includes lens cap keeper to prevent losses. Material: high impact plastic. Color: Black. Free Microfiber Cleaning Cloth 5.5x3.0\" included",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_47",
    "title": "DGLK Stroller Fan, Portable Fan, 5200mAH Battery Powered Bladeless Small Fan, Like USB Mini Fan, Suitable for Stroller, Desk, Handheld, Suspended",
    "price": 17.99,
    "rating": 4.2,
    "rating_count": 7283,
    "image_url": "https://m.media-amazon.com/images/I/41xokfK8YhL._AC_.jpg",
    "description": "【Stroller Fan】The latest stroller fan, unique alien design, adopts closed turbine bladeless movement, foldable silicone non-slip tripod, eye-shaped mesh air outlet, effectively enhances wind and reduces noise, very suitable for you and your baby to use in summer . 【Bladeless & Safe】The bladeless stroller fan adopts a closed 52-piece turbine bladeless movement, which rotates at a high speed to effectively enhance the wind power and reduce the noise. With the design of the mesh air outlet, it can effectively prevent the hair twist and the baby's fingers, and can be used by babies confidently 【Foldable Tripod】The portable fan is specially designed with a foldable tripod and edible-grade threaded silicone, which effectively improves the grip. It can also be folded into various shapes according to your and your child's preferences. It is very cute and cool. It is both a toy and a fan where you and your child deserve it. 【Battery & Gear】Stroller fan, USB charging, built-in 5200amh polymer battery, super long endurance up to 15 hours (depending on the wind speed), equipped with 3 gears: natural, cold and strong wind. You can switch easily with one key according to your needs. 【Portable & Multifunctional】Portable stroller fan, unique design, multi-function, can be used as stroller fan, treadmill fan, hand-held fan, mobile phone rack fan, desktop fan, student bed fan, car seat fan and camping fan. Great for for kids, family and friends in the summer.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_48",
    "title": "BTECH, BaoFeng BL-5 Battery Eliminator for for BF-F8HP, UV-5X3, and UV-5R Radios",
    "price": 18.49,
    "rating": 4.7,
    "rating_count": 7003,
    "image_url": "https://m.media-amazon.com/images/I/51GQmEsRVnL._AC_.jpg",
    "description": "BaoFeng BF-F8HP, BF-F8+ and UV-5R Series Battery Eliminator with DC Adapter.  This is the genuine eliminator with the full heavy duty cable and correct voltage transformer. Counterfeit eliminators send direct voltage which may damage your radio and will not let it function properly. Including: circuit damage and not allowing the radio to transmit while under high power, unregulated voltage  This is the battery eliminator for the BaoFeng BF-F8HP, UV-5X3, and UV-5R series radios. To use the eliminator simply clip it to the back of the radio in place of the battery, then plug the cable into a cigarette lighter or accessory socket (12V only).  This allows your radio to run off the vehicle or selected 12V source. The eliminator supplies power to the radio directly from car.  Technical Specs:  Over Current Protection Input : DC 12-24V  Output MAX :7.8V 3A  What's Included:  ++ Battery Eliminator for BaoFeng BF-F8 and UV-5R Series Radios  It works on:  UV-5X3 BF-F8HP All UV-5R Series Radios (every model UV-5RA, UV-5RB, UV-5Rv2+, UV-5RS - etc) Supply power to the BF-F8 and UV-5R series BaoFeng radios directly from your car with this battery eliminator Replaces your radios stock battery while in the vehicle to direct DC power your radio Note: This is a battery eliminator, not car charger for your existing battery Helpful BaoFeng Guides and Programming Tips are available from at BaoFengTech and Miklor BTECH is proud to be in the USA, which allows you to have the best available local support for any issue that may arise. BTECH only engineers and develops radio products. That brand focus allows you to have the best available radios and accessories with the most features, with real USA warranty and support.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "electronics_49",
    "title": "ELFRhino Headphone Case Cord Organizer Earbuds Holder Earphones Case Wrap Winder Headset Keeper Cord Manager Cable Organizer Black",
    "price": 6.49,
    "rating": 4.4,
    "rating_count": 8906,
    "image_url": "https://m.media-amazon.com/images/I/41N7kfJKtHL._AC_.jpg",
    "description": "High quality Silicone material for durable use, natural color The metallic snap for easy opening and closing, easily winds all kinds of cables and cords within seconds Compact and classic design, fashion and practical, soft and flexible, convenient to carry Releases earbuds instantly and tangle-free with a single pull, make your life easier Small size to fit easily in pockets, purses or bags, a great option for an organized home or workplace. Package Includes: 1 X Earphone Winder, please note that earphone is not included!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  }
]