[
  {
    "sku": "home_and_kitchen_0",
    "title": "Jay Franco Blaze and The Monster Machines Off to The Races 7 Piece Full Size Bed Set - Includes Comforter & Sheet Set - Super Soft Fade Resistant Microfiber (Official Blaze Product)",
    "price": 69.99,
    "rating": 4.8,
    "rating_count": 35033,
    "image_url": "https://m.media-amazon.com/images/I/515rP6wxInL._AC_.jpg",
    "description": "Microfiber PERFECT FIT & FUN DESIGN - This full bed set includes (1) 76 x 86 inch full comforter, (1) 54 x 75 inch fitted sheet, (1) 81 x 96 inch flat sheet, (2) 20 x 30 inch standard pillowcases, and (2) 20 x 26 inch shams. Add a touch of decorative enchantment to your room with our fashionable and super soft Blaze and the Monster Machines bed set. HIGH QUALITY & EASY CARE - Keep your little one as cozy as can be! Our breathable fabric is super soft and great for all seasons. Made using 100% brushed microfiber material, our polyester shell is fade resistant allowing a comfortable night's sleep. To clean, machine wash cold. To dry, air/tumble dry on low. GREAT GIFT - Blaze and the Monster Machines bed set will make any child smile and will transform any bedroom, guest room, kids room, RV, or vacation home. Great gift for school or home. It rolls up for easy storage and travel. SHOP THE BLAZE COLLECTION - Complete your bedroom with our other Nickelodeon Blaze products - coordinating bedding and accessories available (sold separately). OUR FAMILY COMPANY - Our company is still small and family run. We take great pride in our products and our unsurpassed customer service. We know that our wonderful customers are the reason we are in business! We offer excellent quality, non-toxic products. With our coordinating Blaze accessories, you can mix and match our high-quality and unique boy’s comforter sets, girl’s comforter sets, kids sheet sets, or kids pillows.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_1",
    "title": "MCS Trendsetter Poster Frame, Black, 22.75 x 34 in, Single",
    "price": 32.99,
    "rating": 4.4,
    "rating_count": 36973,
    "image_url": "https://m.media-amazon.com/images/I/517rXJvm2mL._AC_.jpg",
    "description": "The MCS Trendsetter Frame is a simple and functional black frame that makes it easy to frame your posters, photographs, and finished puzzles. The Trendsetter line features a wide 1-inch frame for added stability and strength, as well as a shatterproof styrene face designed to prevent breakage during shipping and enhance safety during handling. For easy display, gently lift the attached flex tabs, remove the cardboard backing, insert your desired medium, reinsert the cardboard backing, and gently flatten the attached flex tabs. Attached to the back of each photo frame are hinged hangers for easy vertical or horizontal frame mounting. (Instructions included). The Trendsetter has become one of our top sellers over the years and will provide you the service and quality you expect from MCS frames. The minimalist contemporary design will never go out of style, and is always available for the right price. MODERN AND FUNCTIONAL: Create a contemporary display for all your most esteemed art prints, photos, posters, puzzles, and more with the MCS Trendsetter Frame featuring a sleek black finish DIMENSIONS: Wall picture frame measures 23 x 35 inches and holds one 22 x 34 inch poster, puzzle, or picture QUALITY CONSTRUCTION: Our poster frames feature a back-loading design with a clear styrene front to protect artwork and puzzles from damage; Lightweight cardboard backing and a durable plastic profile makes adding or swapping posters a breeze EASY TO USE: Trendsetter poster and puzzle frames feature attached hinged hangers for simple vertical or horizontal wall hanging VERSATILE DECOR: With a passion for design, trend, and functionality, MCS delivers best-in-class products, like our modern picture frames, that help make your house a home; Showcase posters, photographs, or puzzles with the MCS Trendsetter Frame collection; With multiple sizes and finishes to choose from, you can outfit your living room, bedroom, or home office with sleek, contemporary wall decor",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_2",
    "title": "Ashler faux fur rug, Fluffy Shaggy Area Rug Ultra Soft 2 x 6 Feet Sheepskin Fur Rug, Frosted Bottom Pink Fuzzy Rug Machine Washable Shag Rug, Nursery Decor Throw Rugs for Bedroom, Living Room",
    "price": 28.04,
    "rating": 4.5,
    "rating_count": 46418,
    "image_url": "https://m.media-amazon.com/images/I/51o8lhyXDQL._AC_.jpg",
    "description": "【 Upgrade Material Fur Rug 】Made of premium Mongolian faux fur, featuring our faux sheepskin rug to super soft and fluffy feeling. Durable high-density material with great stitching makes it not easy to shed. 【 Non-slip Backing 】 Slip-resistant suede leather is used for the bottom side with superb sewing, which ensures the firmness and durability of the rug, preventing shifting and skidding effectively. 【 Superior Dyeing Process 】Our luxury and cozy area rug is manufactured by a special dyeing process, the tip part of the rug is an elegant white. Two-tone design and gradient effect bring ultimate visual experience. 【 Perfect Size 】Ashler faux sheepskin fur rug in various sizes, wonderful size for home decor. Widely used in the living room, kid's playroom, bedroom, nursery, balcony to cover the hardwoods, bedside, or leisure areas. 【 Easy Clean and Care 】As a portable rug, shake it to fluff up the faux fur when taking out the item. Easy to vacuum it or wipe with a damp cloth, flat to dry.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_3",
    "title": "1500 Supreme Collection Twin XL Sheet Sets Lilac - 3 Piece Bed Sheets and Pillowcase Set for Twin XL Mattress - Extra Soft, Elastic Corner Straps, Deep Pocket Sheets, Twin XL Lilac",
    "price": 24.99,
    "rating": 4.6,
    "rating_count": 125679,
    "image_url": "https://m.media-amazon.com/images/I/41qlILh3jLL._AC_.jpg",
    "description": "Sweet Home Collection Why Choose Us? At Sweet Home Collection, we strive to create products using the finest textiles possible at reasonable prices. We find techniques that include better stitching, stronger weaving, and more affordable materials. Quality: Our 1500 Supreme Collection is a fine display of our commitment to quality and customer feedback. Our goal is to create repeat customers for years to come. Microfiber is paving the way for a future of fine linens using the latest technology. Used across all industries and growing in popularity, microfiber continues to get strong and more reliable every year. Price: Compare our price to other similar products. We are not only the best quality, but the best price as well. Easy on the wallet is one of our core values. Shop With Us: Have a look at our entire Sweet Home Collection bedding line to restore your bedroom. We provide your essential sheet sets, bed skirts, duvets, comforters, furniture protectors, and much more. Feel free to contact us so we can assist you.   How We Measure Up: Here are our measurements for bedding, Queen: 1 Flat (92\"\" x 102\"\") 1 Fitted (60\"\" x 80\"\") and 2 Std Pillow Cases (20\"\" x 30\"\"). King: 1 Flat (102\"\"x105\"\") 1 Fitted (78\"\"x80\"\") and 2 Std Pillow Cases (20\"\"x40\"\"). Cal King: 1 Flat (108\"\"x102\"\") 1 Fitted (72\"\"x84\"\") and 2 Std Pillow Cases (20\"\"x40\"\"). Full: 1 Flat (81\"\"x96\"\") 1 Fitted (54\"\"x75\"\") and 2 Std Pillow Cases (20\"\"x30\"\") What's inside the package: The Full, Queen, King, and Cal King come with 1 fitted sheet, 1 flat sheet, and 2 pillowcases. The Twin comes with 1 fitted sheet, 1 flat sheet, and 1 pillowcase. Easy Care: Feel free to wash on cold and tumble dry without having to iron after because our bedding is wrinkle resistant. LUXURY QUALITY 3 PIECE (TWIN XL) SHEET SET - Embroidered pillowcases, deep pocket fitted sheets, 100% double brushed bed sheets for premium comfort and heirloom-style quality. A fresh set of bed sheets is always welcomed whether it be for your own bed o",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_4",
    "title": "BGment Room Darkening Curtains 95 Inches Long - Grommet Thermal Insulated Drapes Window Treatment Curtains for Bedroom, 2 Panels, 52 x 95 Inch, Light Grey",
    "price": 35.99,
    "rating": 4.6,
    "rating_count": 55666,
    "image_url": "https://m.media-amazon.com/images/I/31mDsDXa20S._AC_.jpg",
    "description": "Package Includes: Set of 2 light grey blackout curtains; Each panel measures 52 Inch wide by 95 Inch long. Grommet Construction: Each curtain panel has 8 silver metal grommets on top. Each grommet inner diameter is 1.6 inch, comparable with most rods. Easy to hang, and slide smoothly. Blackout Functions: Our bedroom curtains can block out 85%-99% sunlight and UV ray ( Darker colors work better), perfect for late sleepers and afternoon naps. Thermal Insulated: Our energy saving curtains insulate against summer heat and winter chill to balance your room temperature, cut down energy bills. Reduce outside noise, protect floor and upholstery from color shading. Easy to care: Machine washable in gentle cycle and cold water, do not bleach. Warm iron and tumble dry at low temperatures.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_5",
    "title": "Mellanni RV Bedding Short Queen - Double Brushed Microfiber Camper Bunk Sheets - Durable and Breathable Cooling Sheets - Fits Mattress Up to 10'' - Deep Pocket Queen Sheet Sets (Short Queen, Spa Blue)",
    "price": 34.97,
    "rating": 4.5,
    "rating_count": 340087,
    "image_url": "https://m.media-amazon.com/images/I/41Wk97GNWgL._AC_.jpg",
    "description": "Perfect Fit - for Short Queen RV mattresses up to 10\" deep. No more baggy uncomfortable sheets! Mellanni 4 Piece Queen short sheets, includes one flat sheet (99\" x 90\"), one fitted sheet (75\" x 60\") and two pillowcases (30\" x 20\"). Sheets Stay On, Are Easy to Put On and Take Off - thanks to specially designed durable 4 elastic corner bands and sewn in elastic all around. Mellanni RV bed sheets ensure a snug fit and will stays in place night after night. No more shifting! Highest Quality Double Brushed Microfiber – is silky soft, durable, breathable, pet friendly and long-lasting. Enjoy same comfort on the road as you would in your home. Fabulous color selection will match any decor and Our RV sheets are perfect for your motorhome, camper and travel trailer. Easy Care - fade, stain, shrink and wrinkle resistant. Mellanni RV Queen short sheets are machine washable and quick-drying - pet friendly and ideal low maintenance sheets for your camping and RV needs. Mellanni Lifetime Promise - Mellanni is a company that prides itself on providing the absolute best customer service in the industry. If you are not satisfied with your purchase at any point for any reason, you can return it with no questions asked. That's the Mellanni Promise; in fact, you don't even have to send back the product!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_6",
    "title": "Walensee Large Bathroom Rug (24 x 60, Black) Extra Soft and Absorbent Shaggy Bathroom Mat Machine Washable Microfiber Bath Mat for Bathroom, Non Slip Bath Mat, Luxury Bathroom Floor Mats",
    "price": 41.99,
    "rating": 4.3,
    "rating_count": 31438,
    "image_url": "https://m.media-amazon.com/images/I/41nvPkmlR2L._AC_.jpg",
    "description": "❤ MACHINE WASHABLE: Walensee 24 Inch x 60 Inch luxury Bath Rug can be machine washed time and time again. Easy for clearance. We use the more expensive TP Rubber backing material (not PVC or glue) which is much stronger and durable for long lasting use. ❤ PAMPER YOUR FEET: This cushioned bathmat for home is constructed with thousands of individual polyester micro fiber shags, sink your toes into the comfortable contentment of a bathtoom floor mat from threshold. Soft pile that soothes tired foot and shields toes from the cold floor. ❤ ULTRA ABSORBENT: The microfiber shag bath rug is much more absorbant than cotton bath rugs. High-pile helps save your floors from dripping water while you’re stepping out of the bath, shower, spa, or getting ready by the sink. Moisture is trapped in the mat’s deep pile, allowing the rug to dry quickly and cleanly. ❤ NON-SLIP: The nonslip room mat for floor is backed with TP Rubber to prevent shifting and skidding. Please place the non-skid toilet rug on DRY SMOOTH FLOOR only. Water under the bathroomrug can cause it to slip. Keep bottom of the bath rug dry. ❤ CREATE YOUR BATHROOMS OASIS: With many different solid colors and sizes to choose from, you will easily find rugs to coordinate with your decor! We stand by our products 100% and want our customers to love them as much as we do!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_7",
    "title": "DEZENE Throw Pillow Covers 18x18 Burgundy: 2 Pack Cozy Soft Velvet Square Decorative Pillow Cases for Farmhouse Home Decor",
    "price": 13.99,
    "rating": 4.6,
    "rating_count": 28345,
    "image_url": "https://m.media-amazon.com/images/I/414b982nLuL._AC_.jpg",
    "description": "AMAZING VELVET THROW PILLOWCASES: They will show two very different glosses if you look in two different directions, one is bright and smooth, the other is soft and plush ADD STYLE TO YOUR AREA: Rich Solid Color Throw Pillow Covers, Brings Luxury Look to Your Home Decorative, Bed, Sofa, Couch, Chair, Car, Patio, Farmhouse, Bedroom, Office, Indoor & Outdoor, Etc COZY SOFT METERIAL: These Decorative Pillow Covers Are Made of Durable Poly Velvet,Comfortable and Super Soft Touch, Grade A, High Class, Both Sides Same HIGH QUALITY: The Cushion Covers Color is Matched with The Invisible Zipper. Disassemble Freely, Convenient to Change. The Color of Fabric is Beautiful and without Color Fading EASY CARE: Machine Washable for Easy Care and Maintenance, Separately in Cold Water on The Gentle Cycle, Do Not Use Bleach and Iron.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_8",
    "title": "Silicone Utensil Rest with Drip Pad for Multiple Utensils, Heat-Resistant, Spoon Rest & Spoon Holder for Stove Top, Kitchen Utensil Holder for Spoons, Ladles, Tongs & More - by Zulay (Aqua)",
    "price": 9.99,
    "rating": 4.7,
    "rating_count": 34575,
    "image_url": "https://m.media-amazon.com/images/I/316yEmm7QKL._AC_.jpg",
    "description": "KEEP YOUR COUNTERTOPS CLEAN: Are you tired of random oil and sauce drips all over stovetops and kitchen counters while cooking? Say no more! Our spoon rest has raised edges to catch all the drips, making it a great addition to your kitchen gadgets for keeping counters and stoves splatter-free. Revolutionize your cooking, baking, or grilling experience with this beautifully designed square spoon holder. CLUTTER-FREE COOKING SESSION: With four slots, you get enough space to park your cooking utensils and keep them separated when multitasking in the kitchen. Use this cooking utensil holder for spoons, spatulas, ladles, brushes, tongs, or forks. Avoid running around finding the right tool, and keep your kitchen utensils closer for a stress-free time while cooking. HEAT RESISTANT AND EASY TO CLEAN: Made from food-grade material, this silicone spoon rest can be placed near the stove or countertop without it being affected by heat. It is designed with a non-slip base to prevent it from sliding and causing chaos while cooking. Once you are done with cooking, toss the kitchen tool holder in the dishwasher for a quick cleanup. ADDS VALUE TO YOUR KITCHEN: Our durable utensil rest is affordable and guaranteed to be your cooking partner for years to come. Say good-bye to paper towels and switch to this spatula holder for a squeaky clean counter. It could also make a great choice for a housewarming gift. Your loved ones will definitely appreciate your thoughtful gesture after a mess-free cooking session every time. HASSLE-FREE, ZULAY GUARANTEE: We love and take pride in our spoon holder for stove top and back it up with a lifetime guarantee. Have the confidence that this product will last. If there are ever any issues, just contact us and we will make it right.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_9",
    "title": "H.VERSAILTEX Modern Velvet Plush 4 Piece High Stretch Sofa Slipcover Sofa Cover Furniture Protector Form Fit Luxury Thick Velvet Sofa Cover for 3 Cushion Couch, Machine Washable (Sofa,Brown)",
    "price": 43.77,
    "rating": 4.5,
    "rating_count": 38051,
    "image_url": "https://m.media-amazon.com/images/I/31c4YpSj-BL._AC_.jpg",
    "description": "GREAT FIT: This innovated 4 Piece sofa couch cover is crafted from luxurious velvet plush fabric, including 1 piece of base cover and 3 piece of cushion covers. Sofa slipcovers (fit sitting width between 72-90 inch). Feature one-size-fits-most, kindly measure before ordering FULL PROTECT: These fantastic velvet slipcovers are unique and plump, put the cover and lie in the couch, create smooth, sweet chocolate dreaming taste. Cover stains and imperfections from everyday living. Avoid the costly investment of new furniture NON SLIP: Effortless for installation (guide photos on selling page), sewn with thick elastic loops to cover the bottom edges, base cover and cushion cover are separated for more fitting, high recommended for both leather and cloth furniture AESTHETIC DECOR: H.VERSAILTEX slipcovers are as close to custom as you can reasonably purchase. These beautiful couch covers save you money by extending the life of your sofa, make your old furniture appear brand new. Quickly and easily update the color or fabric of your existing furniture EASY CARE: Machine washable for easy care and maintenance, keep fresh look after many times washing. Separately in cold water on the gentle cycle, do not use bleach. Shopping more fit slipcovers styles in H.VERSAILTEX Shop for your sofa, loveseat, chair, recliner, wing chair, ottoman, dining chair and futon",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_10",
    "title": "Home Brilliant Pink Lumbar Pillow Cover 12x20 Soft Striped Velvet Accent Pillows for Bedroom Decorative Pillow Covers for Party, 12 x 20 inch, Blush Pink",
    "price": 13.99,
    "rating": 4.7,
    "rating_count": 28544,
    "image_url": "https://m.media-amazon.com/images/I/41hx61bF37L._AC_.jpg",
    "description": "100% Polyester Imported Features: Color: Blush Pink. Measures: 12x20 inch (30x50cm), tailored for 12x20 inch insert. Package: include 2 pcs pillow covers. No pillow insert. Washing Guide: Machine Wash Cold Separately, Gently Cycle Only, No Bleach, Tumble Dry Low. Easy Insertion: we use matching shade invisible zipper closure for an elegant look, Easy Insertion and washing. Material: This supersoft, flocking striped corduroy cushion cover is made of 100% high quality polyester.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_11",
    "title": "DASH Tasti-Crisp™ Electric Air Fryer Oven Cooker with Temperature Control, Non-Stick Fry Basket, Recipe Guide + Auto Shut Off Feature, 1000-Watt, 2.6Qt, Black",
    "price": 59.99,
    "rating": 4.5,
    "rating_count": 30602,
    "image_url": "https://m.media-amazon.com/images/I/41ZQmtXww2L._AC_.jpg",
    "description": "Cook crispy fried food in a dash with the Tasti-Crisp™ air fryer! Aircrisp technology fries with hot air instead of oil, for delicious fried food with up to 75% less fat than a traditional deep fryer. This convenient countertop air fryer is sized for any kitchen, making it easier to store while still providing ample 2.6 qt Capacity. The redesigned crisper basket allows for greater surface area inside the air fryer, so food gets more crisp, faster. HEALTHIER FRIED FOOD: Dash Tasti-Crisp Air Fryer uses AirCrisp Technology instead of oil to reduce added fat by 70-80% without sacrificing the flavor of your fried food. QUICK plus EASY: Short on time. Simply load the 2.6-qt capacity fryer basket set the temp and timer, and within minutes your food comes out crispy, every time. Cord length: 31.5 inches. SAFER: The auto-shut off function prevents overcooking and the cool touch handle makes it safe and easy to use. VERSATILE: The redesigned Crisper Basket allows for greater surface area inside the Air Fryer so food gets more crisp, faster. Perfect for cooking frozen treats like chicken nuggets, fish sticks, and other snacks, this is a compact air fryer families will love. COMPACT plus LIGHTWEIGHT: Half the weight of a standard fryer the Dash Tasti-Crisp Air Fryer is your must-have for that first apartment, smaller kitchen, college dorm life, camper/RV traveling, while its sleek design and trendy color options will accent any kitchen space.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_12",
    "title": "NTBAY 100% Brushed Microfiber Queen Pillow Shams Set of 2, Super Soft and Cozy, Wrinkle, Fade, Stain Resistant 20x30 Inches Oxford Pillowcases, Yellow",
    "price": 11.99,
    "rating": 4.5,
    "rating_count": 30156,
    "image_url": "https://m.media-amazon.com/images/I/31CKsZhxH5L._AC_.jpg",
    "description": "PACKAGE INCLUDES: 2 queen size pillow shams measuring 20\"x 30\" with a 2\" decorative flange (Pillow insert or cushion is not included.) PRODUCT FEATURES: Our double-sided high quality brushed microfiber pillow shams offer you unparalleled softness and comfort. These solid color envelope pillow shams are breathable, stain and wrinkle resistant, and not easy to fade. Good sewing stitch and exquisite workmanship bring a perfect combination of durability and softness. PRODUCT FUNCTION: These simple and ultra soft pillow shams are good bed products to decorate any room in your house in all seasons as there are a variety of colors to be choosen from. Our pillow shams provide excellent experience and comfort all night. Great gift for friends, parents, children and other relatives. EASY CARE: Machine wash cold, gentle cycle, only non-chlorine bleach when needed, tumble dry at low temperature, cool iron if needed. SATISFACTORY SALES SERVICE: We are so confident in the quality of our product that we offer 90 days return and replacement service. We also provide it with a life time free customer service. If you find that our products have quality problems, just contact us and we will solve the problem for you immediately.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_13",
    "title": "Love's cabin Silk Satin Pillowcase for Hair and Skin (Dark Gray, 20x26 inches) Slip Pillow Cases Standard Size Set of 2 - Satin Cooling Pillow Covers with Envelope Closure",
    "price": 6.99,
    "rating": 4.5,
    "rating_count": 77353,
    "image_url": "https://m.media-amazon.com/images/I/31yibifbNrS._AC_.jpg",
    "description": "100% POLYESTER SATIN: Satin refers to the weave of the fabric( how it's put together) not the fiber(what it is made of). Love's cabin satin pillow cover utilizes 100% polyester satin to provide resilient feel with a distinctive and lustrous appearance - High quality satin is more sturdy and durable than silk pillowcases which need professional cares. WRINKLE FREE &BEST FOR HAIR AND SKIN: Love's cabin slip satin silky pillowcases prevent hair from becoming knotted and matted,have good sleeping, great for preventing wrinkles, dry skin and frizzled hair, and morning bed head. She creates less friction of your beautiful curly hairstyle and reduces hair breakage than sleeping on cotton pillowcases - Will NOT absorb moisture to help retain your shiny hair, perfect for curly hair. ULTRA SOFT & SMOOTH MATERIAL: Envelop closure (no zipper) design | wrinkle resistant, comfort and better fit. The Envelope closure end design prevents your pillows escaping from pillowcase during your sweet dream. EASY TO WASH: Turn the satin pillow case inside out, place inside a mesh laundry bag, and wash with a mild detergent. The cooling luxury satin pillowcase holds up great in cold delicate wash and better AIR DRY it hanging on a rack instead of tumble dry. The drying temperature should not exceed 158℉. RISK FREE SHOPPING: We believe that you will love this best satin pillowcase as much as we do. But in case you don't, we offer a 100% money back guarantee. No questions asked. Because we want you to be happy!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_14",
    "title": "Elegant Comfort Luxury Soft 1500 Thread Count Egyptian 4-Piece Premium Hotel Quality Wrinkle Resistant Coziest Bedding Set, All Around Elastic Fitted Sheet, Deep Pocket up to 16inch, Queen, Red",
    "price": 24.49,
    "rating": 4.5,
    "rating_count": 39021,
    "image_url": "https://m.media-amazon.com/images/I/41CSWxdb1KS._AC_.jpg",
    "description": "Experience luxury like you've never felt before. Sheets that feel almost hedonistic, this sumptuous set is going to bring your dreams to a whole new level. Slip between the covers and let yourself wallow in the decadence that this bedding offers. Add in delightfully soft, ultra-plush pillowcase, and you'll truly feel pampered. These bed sheets are crafted from incredible, wrinkle-free microfiber yarns. It's available in a variety of beautiful colors, and no matter which one you choose, when morning comes and the alarm clock goes off, you just might be tempted to crawl farther beneath these covers and try to pick up where your dreams left off. Care Instructions: Machine wash Cold, Gentle Cycle. Do not bleach. Tumble dry low Microfiber Imported Elegant Comfort Queen-size Dimensions - Flat sheet 102\" x 90\", Fitted sheet 80\" x 60\", 2 pillowcases 20\" x 30\" - Fits Mattresses up to 16\" - 100% Satisfaction Guaranteed ! Thickness, softness and warmth breathable, stronger and more durable than cotton, with the strongest stitching to prevent tears Deep-pocket, fully elasticized fitted sheet for mattresses up to 16 Inch thick Wrinkle- and fade-resistant, cold-water washable and quick-drying Elegant Comfort Queen-size Dimensions - Flat sheet 102\" x 90\", Fitted sheet 80\" x 60\", 2 pillowcases 20\" x 30\" - Fits Mattresses up to 16\" - 100% Satisfaction Guaranteed ! Thickness, softness and warmth breathable, stronger and more durable than cotton, with the strongest stitching to prevent tears Deep-pocket, fully elasticized fitted sheet for mattresses up to 16 Inch thick Wrinkle- and fade-resistant, cold-water washable and quick-drying Elegant Comfort Queen-size Dimensions - Flat sheet 102\" x 90\", Fitted sheet 80\" x 60\", 2 pillowcases 20\" x 30\" - Fits Mattresses up to 16\" - 100% Satisfaction Guaranteed ! Thickness, softness and warmth breathable, stronger and more durable than cotton, with the strongest stitching to prevent tears Deep-pocket, fully elasticized fitted sheet for mattresse",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_15",
    "title": "Satin Sheets California King [4-Piece, White] Luxury Silky Bed Sheets - Extra Soft 1800 Microfiber Sheet Set, Wrinkle, Fade, Stain Resistant - Deep Pocket Fitted Sheet, Flat Sheet, Pillow Cases",
    "price": 33.99,
    "rating": 4.3,
    "rating_count": 28280,
    "image_url": "https://m.media-amazon.com/images/I/51hsSYUM0rL._AC_.jpg",
    "description": "✅ Feel The Difference - Sleep better and wake up each morning feeling refreshed and full of energy. Silky soft, most comfortable and luxurious bed sheets you can find. Best for any room in your house - bedroom, guest room, kids room, RV, vacation home ✅ California/Cal King Size Luxury 4pc Bed Sheets Set - 1 flat sheet 102\"x1082\", 1 fitted sheet 72\"x84\", 2 pillowcases 20\"x40\". Deep pocket fitted sheet with elastic all around (not just the corners, like other sheets). Fits mattresses up to 15\" ✅ Easy Care - Fade, stain, shrink and wrinkle resistant. Machine wash in cold. Dries quick on tumble dry low. More durable than cotton ✅ 100% Microfiber - Made of the highest quality microfiber and workmanship so you know it lasts! Fabulous selection of colors will make your bedroom look like it belongs in a magazine ✅ Pure Bedding Lifetime Promise - Pure Bedding prides itself on providing the absolute best customer service in the industry. For any reason you decide that this bed sheet set or pillowcase is not for you, you can return it with no questions asked. That is the Pure Bedding Promise",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_16",
    "title": "Foamily Throw Pillows Insert - (Pack of 4) Pillow 12\" x 12\" Inches for Bed and Couch - 100% Machine Washable Cotton Pillow - Indoor Decorative Throw Pillows for Couch & Bed",
    "price": 15.99,
    "rating": 4.5,
    "rating_count": 62755,
    "image_url": "https://m.media-amazon.com/images/I/31xQBBhJ-+L._AC_.jpg",
    "description": "COTTON PILLOWS - Our Cotton Blend pillow cover and filling provide a soft and delicate experience. The soft shell will always look FULL and PLUMP, providing long-term durability. MACHINE WASHABLE - Foamily's decorative pillow inserts for couch or bed are machine washable. Toss them in the washer to get fast and easy clean decorative pillows. FORM PACKAGING - The item comes compressed in a rectangular package showing one large or round pillow. Open carefully and allow inserts to recover inch by inch. INDOOR USE - Do not use the euro pillows for outdoor use - only in a home or office cushion - indoor use only—perfect size for the bed, couch, office, hotel, and dorm. DIMENSIONS: Each pillow measures 12 x 12 inches. Order one size up for an extra overstuffed look. It'll make decor fabric big bulk with euro/european look. Note: not for toddler use.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_17",
    "title": "Mejoroom Full Size Sheet Set,Extra Soft Luxury Brushed Microfiber 1800 Full Sheets with 16 Inch Deep Pocket - Breathable Wrinkle Fade Stain Resistant Hypoallergenic - 4 Piece (Full, Aqua)",
    "price": 27.99,
    "rating": 4.6,
    "rating_count": 26775,
    "image_url": "https://m.media-amazon.com/images/I/31lHOkXBhnL._AC_.jpg",
    "description": "JUST LIKE SLEEPING ON CLOUDS - Mejoroom luxury 4 piece full sheet set are made of 100% Double Brushed Microfiber Polyester.these full size sheets have deep pockets to will fit even the 14-15 inches mattresses, .They are softer,smoother,more resilient and more breathable than even the finest Egyptian cotton to bring you a comfortable and relaxing night's sleep here,make you sleep better and wake up each morning feeling refreshed and full of energy. PERFECT FIT FOR YOUR BED - Includes (flat sheet 81\"x96\"-1PC), (fitted sheet 54\"x75\"-1PC), (pillowcase 20\"x30\"-2PCS). These bed sheets grip and fit better than any other full sheet set! Mejoroom microfiber Bed sheet set is designed to fit nearly all mattresses with a depth that does not exceed 15\". It fits so well that you don't have to worry about how it will loosen up in bed. Also available in Twin, Twin XL, Queen and King sizes. COMFORTABLE ENVIRONMENT - Mejoroom bed sheets are hypoallergenic,those with sensitive skin or conditions like eczema rest in a healing environment instead of being further irritated at night. Our 1800 Series Ultra-Soft Double Brushed microfiber fabric is stain resistant, fade resistant, and wrinkle resistant. . And Mejoroom sheet set is manufactured by factory that is certified OEKO - TEX Standard 100. SELECT PATTARN - Moroccan print design, simple but not monotonous through aqua and white color collocation, visually beautiful and comfortable, give your bedroom a new look. Go into your bedroom, get comfortable in bed, and relax. EASY CARE - They are machine washable in cold water and dry quickly on tumble! Do not bleach. Equivalent to 1800 Thread Count king size Sheets Set. Brand New and Factory Sealed No Ironing Necessary. Say goodbye to wrinkles, and tedious tasks like ironing, and hello to cozy, soft, and comfortable bedding!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_18",
    "title": "Yimobra Memory Foam Bath Mat Large Size, 36.2 x 24 Inches,Soft and Comfortable, Super Water Absorption, Non-Slip, Thick, Machine Wash, Easier to Dry for Bathroom Floor Rug, Denim Blue",
    "price": 25.99,
    "rating": 4.5,
    "rating_count": 44450,
    "image_url": "https://m.media-amazon.com/images/I/41SWtZAJq9L._AC_.jpg",
    "description": "Soft Coral Velvet Cozy Memory Foam: Enjoy the comfort of standing on the clouds! Thick and fluffy contact surface offers exceptional comfortable feels. Perfect for bathroom, vanity, vacation home, master bathroom, kid's bathroom and guest suite. Great gift idea for all occasions, Christmas, Wedding, Father's Day, Mother's Day and Valentine's Day Super Water Absorption: The soft velvet microfiber layer can absorb as much water as possible from your wet feet. And the water do not stay on the surface on the bath mat A Breeze!-Machine Wash & Dry: Yimobra bathroom rug is easy to clean. Machine wash with cold water and mild detergent (no chlorine or bleach) tumble dry at low speed or hang dry. Color will not fade and will stay vibrant for many years no matter how many times you wash and dry Non Slip Backing: Yimobra bathroom mat rug is constructed with strong and durable PVC backing which helps to prevent shifting and skidding. And it will hold up for years to come, unlike many other brands, whose rubber backing tends to wear and peel off after multiple washes. Prevent from slipping, please make sure the surface under the mat is smooth, clean and dry How Is the Feeling of Walking on the Clouds? It's Yimobra Memory Foam Bathroom! - Thicker and better constructed memory foam bathroom mat, provides comfortable experience for your feet, just like walking on the soft clouds. We have a variety of colors for you to select. Please choose one of your favorite colors to match the home decoration perfectly. Take the clouds home now",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_19",
    "title": "NICETOWN Kitchen Blackout Curtains and Drapes - Triple Weave Energy Saving Thermal Insulated Solid Grommet Blackout Panels for Patio (1 Pair, 52 inches by 72 Inch, Cappuccino)",
    "price": 23.75,
    "rating": 4.7,
    "rating_count": 47446,
    "image_url": "https://m.media-amazon.com/images/I/41ioY6YTltL._AC_.jpg",
    "description": "Polyester Imported Elegant Design: 2 panels per package. Each Blackout Curtain measures 52\" wide x 72\" long. The design of silver grommet (1.6-inch inner diameter) creates casual elegance for your house, which makes the curtains easy to install and slide. Nice Material: Super heavy and soft Blackout Curtain Panels are very upmarket. Besides, 85%-99% light blocking, thermal insulated, soundproof, and energy-efficient. Thread trimmed and wrinkle-free, both sides are the same color. Wise Budget: Protect your furniture and floor exposed to the sun, while still helping you save money on heating and cooling your home. Privacy protection. The greatest benefit is to bring you a good night's sleep, making you full of energy every day. Wide Compatibility: Don't bother looking for sheer curtains to match, choosing different styles of voile curtains with white color in the NICETOWN store. Such curtain sets provide a more permanent harmonious window dressing, making your home lively. Easy Care: Good quality finishing will withstand years of use. Machine washable and Wash the water temperature below 86℉. Mild detergent no bleaching. Low-temperature ironing. Don’t use sharp things scratching curtains.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_20",
    "title": "Easy-Going 8 Pieces Microfiber Stretch Sectional Recliner Sofa Slipcover Soft Fitted Fleece 3 Seats Couch Cover Washable Furniture Protector with Elasticity for Kids Pet(Recliner Sofa, Deep Teal)",
    "price": 81.99,
    "rating": 4.1,
    "rating_count": 20763,
    "image_url": "https://m.media-amazon.com/images/I/21RKq1Q2hIL._AC_.jpg",
    "description": "Easy-Going brand household,The brand's goal:to make homes more comfortable Soft Material: High quality stretchy and comfortable materials. Elastic Bottom: Give furniture a whole protection Utility: Give a fresh look and comfortable feeling while protecting furniture against stains, wear and tear. Easy Care: Machine washable in cold water. Wash separately at gentle cycle. Using mild laundry detergent. Do not bleach. Easy to Install: Just slip on. (Installation Instructions Included). DIMENSIONS： 1. Recliner slipcover：fit seat width 23-35 in 2.Recliner Loveseat slipcover：fit seat width 40-55 in 3.Recliner Sofa slipcover：fit seat width 60-82 in Please measure before purchasing; See measuring guide in photos for a list of all measurements. Advisement: 1. Not Waterproof 2. Because slipcover is elastic, do not iron. If ironed, will lose some elsticity 3. Due to different computer/screen displays, the color of the product may be a bit different from the picture. And because we are making our products by hand, there may be a deviation of about 2 cm. Risk free purchase: 30 day money-back guarantee! HIGH QUALITY MATERIAL: We have a patent for this product.Micro Fiber,more soft , comfortable.sturdy DIMENSIONS:Recliner Sofa slipcover：fit seat width 60-82 in. More details please refer to the measurement guide in photo, please measure before purchasing FURNITURE PROTECTOR: Protect your sofa from daily wear and stains. Various colors are prepared, you can choose the color you like to cover EASY TO INSTALL: Check the installation guide carefully, it can be finished within 12 minutes by one person, PACKAGE:One Slipcover include 8 parts EASY CARE: Machine washable, wash at temperature around 30 degrees Celsius, mild laundey detergents are advised, please do not bleach. Iron on a low heat",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_21",
    "title": "Bedsure Twin Duvet Cover Pale Blush - Soft Brushed Microfiber Duvet Cover Set 2 Pieces with Zipper Closure, 1 Duvet Cover Twin XL 68x90 inches and 1 Pillow Sham (No Comforter)",
    "price": 21.99,
    "rating": 4.4,
    "rating_count": 23227,
    "image_url": "https://m.media-amazon.com/images/I/41iADTHxqHL._AC_.jpg",
    "description": "Ultra Soft: Using premium microfiber fabric, this brushed duvet cover set offers exceptional softness so you can enjoy a restful night's sleep. Its smooth and breathable fabric provides maximum comfort without any crinkling noise. Enhanced Durability: This premium quality and durable duvet cover set features neat stitching construction that ensures a stronger connection at the seams for increased durability. The unique dyeing technique brings out the colors and prevents them from fading. Multiple Colors: Available in multiple solid hues, this microfiber duvet cover adds a unique and stylish touch to your decor and pairs well with various color palettes of your bedroom accessories. Thoughtful Details: Eight corner ties inside the duvet cover provide a secure fit to prevent the fill from bunching or slipping. The hidden zipper allows you to seal your duvet faster (and easier) than with a traditional button closure. Easy Care: Designed for effortless upkeep, this duvet cover is machine washable and dryer safe. Simply machine wash on a gentle cycle separately with cold water. Air dry or tumble dry low. What You Can Get: This Bedsure twin duvet cover set comes with 1 duvet cover (68\" x 90\") and 1 pillow sham (20\" x 26\").",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_22",
    "title": "SESENO. 12 Pack Shoe Storage Boxes, Clear Plastic Stackable Shoe Organizer Bins, Drawer Type Front Opening Shoe Holder Containers",
    "price": 34.99,
    "rating": 4.2,
    "rating_count": 19502,
    "image_url": "https://m.media-amazon.com/images/I/51Wbzm2LfJL._AC_.jpg",
    "description": "Keep your shoes dust free and neatly organized with these stackable shoe box storage bins Clear stackable design to help maximize your space. Stack or use them side by side to keep your shoes organized and easy to find. Each bin measures approx. 13.1” L × 9” W × 5.5” H Ideal for closets, bedrooms, bathrooms, laundry rooms, craft rooms, mudrooms, offices, play rooms, garages, or any room of your home / apartment / condo / dorm room / RV or camper Made of durable High Quality strong plastic material. Practically designed with rear ventilation holes to allow air circulation and odor prevention SESENO - 12 Pack Shoe Storage Boxes. Keep your shoes dust free, neat and organized with these stackable shoebox storage bins. Clear design to keep your shoes organized and easy to find. Use them separate or stack to maximize your space. Size: 13.1In L×9In W×5.5In H. Ideal for closet, bedroom, bathroom, laundry room, craft room, mudroom, offices, play room the garage, or any room of your home / apartment / condo / dorm room / RV or camper. Made of durable high quality strong plastic material. Practical, designed with rear ventilation holes to allow air circulation and odor prevention.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_23",
    "title": "Elegant Comfort Luxury 4-Piece Bed Sheet Set - Luxury Bedding 1500 Thread Count Egyptian Quality, Wrinkle Resistant Cool & Breathable, Easy Elastic Fitted, Full, Black",
    "price": 21.0,
    "rating": 4.6,
    "rating_count": 19610,
    "image_url": "https://m.media-amazon.com/images/I/41Jbh-8PcZL._AC_.jpg",
    "description": "Experience luxury like you've never felt before. Sheets that feel almost hedonistic, this sumptuous set is going to bring your dreams to a whole new level. Slip between the covers and let yourself wallow in the decadence that this bedding offers. Add in delightfully soft, ultra-plush pillowcase, and you'll truly feel pampered. These bed sheets are crafted from incredible, wrinkle-free microfiber yarns. It's available in a variety of beautiful colours, and no matter which one you choose, when morning comes and the alarm clock goes off, you just might be tempted to crawl farther beneath these covers and try to pick up where your dreams left off. Care Instructions: Machine wash Cold, Gentle Cycle. Do not bleach. Tumble dry low Microfiber Elegant Comfort Full-Size Dimensions - Flat sheet 81\" x 96\", Fitted sheet 54\" x 75\", 2 standard pillowcases 20\" x 30\" - Our sheets are soft, light weight, warm, and breathable. The material is stronger and more durable than cotton, with the strongest stitching to prevent tears. Deep-pocket, fully elasticized fitted sheet for mattresses up to 16 Inch thick. They are wrinkle- and fade-resistant, cold-water washable and quick-drying. WELCOME TO ELEGANT COMFORT: Extra Durable weave creates an everlasting softness. Discover the ultimate in high-end bedding with our silky-smooth bedding. Breathable, and cool to the touch, our luxuriously soft bedding set will create a heavenly sleeping experience! The microfiber material is processed to make it resistant to shrinkage and fading which adds to the longevity of the set by keeping it in great condition. LUXURY MEETS PERFORMANCE: Elegant Comfort provides superior performance and luxurious feel begin with yarns that are even finer, longer, and stronger than silk. These microfiber yarns are finished with a meticulous brushing and conditioning process before being woven into premium fabrics, then undergo an additional brushing to attain the lustrous, ultra soft finish sought by connoisseurs of fine ",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_24",
    "title": "Basic Beyond King Size Comforter Set Reversible Down Alternative Aqua Blue Comforter Set King 3 Pieces Bed Comforter with 2 Pillow Shams for All Season (Aqua Blue/Ivory)",
    "price": 54.99,
    "rating": 4.6,
    "rating_count": 24701,
    "image_url": "https://m.media-amazon.com/images/I/51oO5wXy0IL._AC_.jpg",
    "description": "IN THE BOX - King size down alternative reversible comforter (104\"x92\") + 2 pillow shams (20\"x36\") with 2 inches flange and invisible zipper. LIGHTWEIGHT BUT WARM - Made of brushed microfiber fabric which makes the comforter more soft and comfortable. Plush polyester fill comforter that provides amazing all season warmth. PRETTY AND COLORFUL - Refresh your bedroom with this bed comforter set from basic beyond.Its reversible design features two solid colors so you can achieve two different looks. CARE INSTRUCTION - Machine wash in cold water on gentle cycle, and simply sun-dry or tumble dry on a low heat setting. GREAT GIFT - Give your bedroom a style update with this beautiful comforter set that also has a matching pillowcase for a relaxing daytime nap or a cosy night's sleep.This comforter set can be an enchanting and valuable gift to your family or friends.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_25",
    "title": "Mellanni King Pillow Cases 4 Pack - Iconic Collection Pillowcases - Hotel Luxury, Extra Soft, Cooling Pillow Covers - Envelope Closure - Wrinkle, Fade, Stain Resistant (4 PC King Size 20\"x40\", Black)",
    "price": 27.0,
    "rating": 4.6,
    "rating_count": 24944,
    "image_url": "https://m.media-amazon.com/images/I/31u1wjjIkiL._AC_.jpg",
    "description": "Good Housekeeping Best Bedding Award Winner - Tried, tested, & named \"Buttery Budget Buy\" in 2022, Mellanni's Iconic Collection offers unbelievable soft bedding at an affordable price. Treat your hair and skin to the luxurious comfort of our most popular Pillowcases King Size 20\" x 40\". Temperature Regulating - Moisture-wicking, breathable, & silky to the touch. Mellanni double-brushed microfiber is cozy or cooling, depending on the season. Our lightweight envelope pillowcases are ideal for all sleepers, including those with sensitive skin. Easy Care Technology - Signature Mellanni Weave is quick drying and more durable than cotton. Stain, shrink, fade, wrinkle, & pill-resistant. Easy to spot clean and machine washable, they're the perfect pillowcases for busy households with kids, pets, and more. Unparalleled Quality & Construction - Oeko-Tex certified & environmentally friendly. Envelope closure keeps the pillow tucked into case and hidden from view, providing complete protection for your pillow with no inconvenient zippers. Easy on and off. Mellanni Lifetime Promise - If you are not satisfied with your purchase for any reason at any time, you can return it, no questions asked. We pride ourselves on providing the absolute best customer service in the industry. Buy now with confidence.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_26",
    "title": "sancua Square Tablecloth - 54 x 54 Inch - Stain and Wrinkle Resistant Washable Polyester Table Cloth, Decorative Fabric Table Cover for Dining Table, Buffet Parties and Camping, White",
    "price": 17.99,
    "rating": 4.4,
    "rating_count": 15606,
    "image_url": "https://m.media-amazon.com/images/I/21eIR-B7aEL._AC_.jpg",
    "description": "100% Polyester HIGH QUALITY MATERIAL: Our tablecloth are crafted from high quality durable polyester fabric, perfect to protect and decorate your tables. The package will include 1 piece tablecloth measuring 54 W by 54 ​L inch. MEASUREMENTS: This table cloth is available in various sizes: 54x54 inch, 54x78 inch, 54x108 inch, 60x84 inch, 60x102 inch, 60x120 inch etc. Please measure the size before purchasing. STAIN RESISTANT & WRINKLE FREE TABLECLOTH: Featuring a fade resistant polyester fabric, our tabletop covers easily protect your tables and furniture from scratches, stains and sun rays. MULTIPLE PURPOSES: This easy to clean heat resistant table cover is suitable for buffet dinners, dining table, tea table, party, birthday, cafes, banquet, picnic, BBQ, camping, barbecue, indoor, outdoor and everyday use. EASY CARE: Machine washable, no bleach. Wrinkle free after ironing.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_27",
    "title": "Noahas Fluffy Bedroom Rug Plush Fuzzy Rugs for Kids Room Living Room, Soft Shaggy Nursery Rug Furry Floor Carpet Modern Indoor Bedroom Decor Cute Boys Girls Room Rug, 2x3 Feet, Black",
    "price": 12.74,
    "rating": 4.3,
    "rating_count": 16229,
    "image_url": "https://m.media-amazon.com/images/I/51B7z3tU-+L._AC_.jpg",
    "description": "Material and Size: The carpet has super soft shaggy surface, non-slip plastic spots bottom, makes you feel like lying on the clouds, 2 feet x 3 feet / 24 inches x 36 inches, it's available in a choice of colors and sizes Super Soft Feeling: Our shaggy and fluffy area rugs are elegant in texture and soft to the touch, this fluffy carpet provides a tranquil refuge for your family to rest their body and mind after a hectic day Multi-purpose: Embellish your floors with this shag rugs, it's a perfect home decor for bedroom, kids room, girls room, nursery room, college dorm living room or study room and harmoniously blend with most floors and furniture Contracted Style: We are an advocate of minimalist design where every details should be purposeful and direct, we take advantage of the simple line and the single color to interpret the concept of the Modern area rugs Easy to Clean: Please try to shake off outdoors, hand wash or wipe clean with a wet rag, it's not shrink or fade after wash, airing is under ventilated place, drying machine is not allowed",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_28",
    "title": "Big Red House Heat-Resistant Oven Mitts - Set of 2 Silicone Kitchen Oven Mitt Gloves, Turquoise",
    "price": 15.07,
    "rating": 4.7,
    "rating_count": 15215,
    "image_url": "https://m.media-amazon.com/images/I/41eAPKHBNEL._AC_.jpg",
    "description": "HEAT-RESISTANT: Our high-quality, high heat oven mitt is cast-iron safe up to 480 °F - so however hot the kitchen, you can keep your cool. SILICONE STRIPING: This oven mitt set features an impressive silicone striping that provides a non-slip grip for superior handling. QUALITY: Crafted from a combination of silicone and cotton, and lined with a soft terry cloth, our oven mitts for baking provide maximum heat protection, flexibility, and comfort. EASY CLEAN: Machine washable and complete with a handy hook, our oven mittens are designed to make your life easier. PROTECTION: Measuring an optimum 12.5\" in length and available in 6 different colors, these oven mitts will fully cover your hands and wrists.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_29",
    "title": "HLC.ME 2 Piece Sheer Voile Window Curtain Grommet Panels for Bedroom & Living Room (54\" W x 95\" L, Black)",
    "price": 19.99,
    "rating": 4.6,
    "rating_count": 21818,
    "image_url": "https://m.media-amazon.com/images/I/41U5crSZXmL._AC_.jpg",
    "description": "100% Polyester Beautiful Sheer Curtain Grommet Panels will liven up your indoor or outdoor spaces with a sense of airiness and beauty. Made from solid color polyester voile. Bring elegance and class to any room with this light filtering sheer curtains. Our luxurious sheer panels give your home a new & elegant look. Allows natural light to flow through the room. For a full look use two (2) panels to cover a standard window. This picture shows two (2) sheer panels and this package contains two (2) Panels. Construction: The header on the panel measures 4\" inch, bottom hem measures 2\" inch, side hem measures 1\" inch. 8 Grommets per panel; Color of Grommets: Brushed Nickel; Content: Two (2) Voile Sheer Curtain Grommet Panels Material: Polyester / Style: Voile Sheer Grommet / Machine Washable Each panel measures 54\" inch Wide.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_30",
    "title": "SENDESTAR Stainless Steel Water Bottle, 2 or 3 Lids(32 oz,40 oz,64oz), Double Wall Vacuum Insulated Leak Proof, Wide Mouth Water bottle with Straw Lid, Spout Lid, Keep Liquids Hot or Cold",
    "price": 29.99,
    "rating": 4.7,
    "rating_count": 15964,
    "image_url": "https://m.media-amazon.com/images/I/51wT+bRoArL._AC_.jpg",
    "description": "The water bottle is double-walled and made from high quality food grade 18/8 stainless steel that will not break. The exterior of the vacuum sealed area is dipped in copper for added insulation. Copper reduces the transfer of temperature, adding even more insulation to your bottle. Wide mouth makes it easy to clean, BPA-free lid which means they are very safe.2 lids can be switched at any time, the Spout Lid is perfect for the beach, camping, the Flex Cap fit for office and hiking This Growler Won't Leak. lid with handle for easy carrying. While sitting anywhere in any temperature condition, your cold drink will stay perfectly chilled up to 24 hours or your coffee or tea will keep hot for up to 12 hours. Beer growler 64oz (1/2 gallon) carries over 5 bottles of beer; if use it like water bottles (insulated) - this volume is enough for your daily hydration. Choose between the most popular and durable powder coated colors on the market, The Powder Coat works with the premium insulation, which prevents condensation from forming on the outside of the bottle, to give you exactly what you want in an everyday refreshment delivery system. What You Get : 1 X Sendestar 64 oz Water Bottle,1 X Spout Lid,1 X Flat Cap, 1 X Water bottle Pouch, warranty and friendly customer service.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_31",
    "title": "OstepDecor 1.5mm Thick Frosted Table Cover, 48 x 32 Incheses, Coffee Table Cover, Heavy Duty Table Top Cover Table Mat, Transparent Table Cover",
    "price": 36.99,
    "rating": 4.4,
    "rating_count": 16893,
    "image_url": "https://m.media-amazon.com/images/I/51l9h8N7kWL._AC_.jpg",
    "description": "✔️【Updated Version Frosted】: This frosted table protector is recommended for glass, glossy, marble, white and other smooth surfaces.Unlike clear one, it will not leave bubbles or water marks on these tops. Use with the smooth side up and the textured side down. ✔️【Material】: This waterproof desktop protector is made of PVC material without BPA, o-benzene, and formaldehyde. It can be in direct contact with food. Maximum heat resistant up to 176°F/80°C, it can tolerate warm plates & cup. A placemat on top of it is recommended for hot plates. ✔️【Cut to Size】: You can mark the exact size with a pencil, and then use a sharp knife or scissors to cut. Note: We reserve a size longer than the actual size to reduce the size. If you need a custom size, please go to OstepDecor storefront, find Have a question for OstepDecor? Click Ask a question to contact us for your customization request. ✔️【Easy to Clean】: Waterproof and dustproof, simply use a dishcloth to wipe stains or clean the pad with water. The table cover protector allows you to enjoy and protect your beautiful desktop, tabletops, or additional surfaces. ✔️【We Care About You】: OstepDecor will be fully responsible for every product that has been sold. We are a professional manufacturer of household products. If you have any questions, please contact us in time, we will provide you with services 24/7.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_32",
    "title": "Foxemart Computer Desks Modern Sturdy Office Desk PC Laptop Notebook Study Writing Table for Home Office Workstations, White",
    "price": 72.99,
    "rating": 4.5,
    "rating_count": 19181,
    "image_url": "https://m.media-amazon.com/images/I/31u+rrHEIRS._AC_.jpg",
    "description": "Foxemart Computer Office Desk, Study Writing Table - Stable Structure, Easy assembly, Convenient Move, Strong and Durable. With a contemporary, minimalist design, the Foxemart computer desk offers you a suitable space wherever you work at. The natural beauty comes from a specially lacquer which makes the surface durable. A real wood feeling and a unique table – Without time-consuming upkeep. ADVANTAGES ● Stylish, minimalist features offer a contemporary look to any your room, office or workspace. ● Extra sturdy metal frame design and adjustable leg pads to ensure stability, even on uneven floor. ● Made of E1 0.6\" thicker desktop board, which is sturdy enough to to support heavy weights, smooth finished, superior healthy environmental protection, besides it is also waterproof and very easy to clean. ● The generously wide desktop gives you large working space for dual monitors, laptops, books and any other work tools you need. ● Scratch-resistant melamine finish protects the desks surface from daily wear and tear. ● The underneath leg distance leaves you ample legroom for rest and for storage. ● Minimal assembly required - just attach the legs and struts. WIDE USAGE This desk is perfect for office, study room, bedroom, living room, workstation, hotel room, co-working spaces as computer desk, meeting desk, study table, writing desk, gaming desk, corner desk and shelves etc. SPECIFICATIONS Top material: E1 MDF (Wooden Medium Density Fibreboard) + Sturdy Metal Frame  Dimension: 39.4”(L) x 19.7”(W) x 29.2”(H) Adjustable leg pads: 1-2cm lengths  Self-assembly: All tools included. ★ SUPER STURDY & STABLE DESIGN – Adjustable leg Pads, Extra fixed steel brackets and Triangular junction design ensure greater stability, and accommodate uneven floors, which also allow to support lots of heavy weights. ★ EASY ASSEMBLY – Minimal assembly required. Just need to attach the legs and struts. Effortlessly assembles in under 15 minutes. ★ HIGH QUALITY & DURABLE – This computer desk is m",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_33",
    "title": "Cuisinart MultiClad Pro 12\" w/Helper Handle Skillet, Inch, Stainless Steel",
    "price": 74.95,
    "rating": 4.7,
    "rating_count": 15268,
    "image_url": "https://m.media-amazon.com/images/I/31VnIYyll4L._AC_.jpg",
    "description": "Enjoy the Fine Art of Cooking Inspired by the great French kitchens, Cuisinart began making professional cookware almost 30 years ago. Constructed of the finest materials available to perfectly perform all of the classic cooking techniques, Cuisinart cookware continues a long tradition of excellence. Cuisinart's commitment to quality and innovation continues with the MultiClad Pro Stainless cookware, designed to meet the demands of gourmet chefs everywhere. Unique triple-ply construction joins a brushed stainless steel exterior, a pure aluminum core that provides even heat distribution, and a stainless steel interior, for optimal performance. MultiClad Pro Stainless lets you celebrate the fine art of cooking. What is MultiClad Pro Stainless Cookware? Premium cookware that features professional triple-ply construction, a core of pure aluminum bonded to a stainless steel interior and a brushed stainless exterior. Heat Surround technology maintains even heat distribution along the bottom and side walls of the cookware, eliminating hotspots. Premium stainless steel cooking surfaces do not react with food or alter natural flavors. Updated Cool Grip handle design Tight-fitting stainless steel cover Tapered rim for drip-free pouring The Cuisinart Details Designed to provide professional gourmet cooking results, this cookware offers perfect heat and perfect results, every time. The Choice of Professionals Aluminum core heats and cools quickly for precise temperature control. Heat Surround technology provides even heat distribution along the bottom and up the side walls of the cookware. Stainless steel interior is ideal for delicately simmering sauces, perfectly sautéing vegetables, browning meats, or boiling several servings of pasta. Cover Seals in Nutrients A tight-fitting stainless steel cover seals in food's natural juices and nutrients for healthier, more flavorful results. The cover is dishwasher-safe. Drip-Free Pouring The rim is tapered for drip-free pouring. Profes",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_34",
    "title": "storageLAB Under Bed Shoe Storage Organizer, Adjustable Dividers - Set of 2, Fits 24 Pairs Total - Underbed Storage Solution",
    "price": 38.99,
    "rating": 4.8,
    "rating_count": 14684,
    "image_url": "https://m.media-amazon.com/images/I/51M9t4W13WL._AC_.jpg",
    "description": "Easily see and access all of your shoe collection at once. No more sifting through shoe boxes or piles of shoes in the closet. Clear top cover protects shoes from dust and adjustable dividers keeps them organized! Stores a good amount - set of 2 under the bed shoe organizers that holds up to 12 pairs each. Finally underbed shoe storage that makes practical use of space and are durable enough to use everyday. 30''x24.5''x5.3'' & adjustable - configurable compartments fit different shoe sizes, whether it's kids shoes or high heels and boots. These shoe organizer under bed also work great as underbed storage for bedding and clothes. Built for daily use - these under bed shoe organizers are designed with sturdy reinforced sides, riveted handles and large zippers so you can pull and tug without worry. Low friction bottom fabric makes for easy maneuvering. Check out our collection of under bed storage products. From shoe storage, clothes and bedding storage to low profile storage for platform beds, we’ve got a variety of solutions for your bedroom storage and organization needs.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_35",
    "title": "CHICOLOGY, Door, Blinds & Shades Camper, Mini, Horizontal Window Blinds, 70\" W X 64\" H, Cappuccino (Commerical Grade)",
    "price": 39.19,
    "rating": 4.4,
    "rating_count": 14752,
    "image_url": "https://m.media-amazon.com/images/I/41Fcv8fkfXL._AC_.jpg",
    "description": "Vinyl, Plastic Wand, Stainless Steel, Metal Window Blinds Cordless - Upgrade your home's décor with 1\" inch mini blinds. Blinds for Doors - Its smooth and safe design is made to compliment any room. Sidelight Blinds - Switch between light filtering and blackout by rotating the wand. Cordless Blinds - Width has a 1/2-inch deduction. Hardware and instructions provided. Venetian Blinds - Our vinyl blinds come in popular colors for a sleek finish.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_36",
    "title": "CHILLOUT LIFE 20 oz Stainless Steel Tumbler with Lid - Double Wall Vacuum Insulated Coffee Mug with Splash Proof Lid and Straw for Hot & Cold Drinks",
    "price": 13.49,
    "rating": 4.7,
    "rating_count": 18386,
    "image_url": "https://m.media-amazon.com/images/I/41sar1q+MgL._AC_.jpg",
    "description": "5-year Warranty & 100% Satisfaction - Yes! CHILLOUT LIFE products come with a a 5-year warranty plus special bonus - Free Delicious Coffee Recipes eBook - which will be emailed to you within 48 hours of your purchase. If you are not positively thrilled with our 20 oz insulated tumbler, just let us know and we will make things right for you! - Hassle Free! Double Wall Vacuum Insulated Technology - High tech insulation methods prevent heat transfer to the outer walls of the tumbler, keeping your cold drinks ice-cold for up to 24 hours & your hot drinks scalding-hot for up to 6 hours. Our stainless steel tumbler use a SWEAT FREE DESIGN that prevents any temperature changes or condensation from forming on the outside, making sure that this cup never leaves a spot & you never burn yourself again! Easy To Clean - The large, wide mouth opening allows easy access to the stainless steel surface, eliminating hard to reach spots and helping you keep every inch washed - Hand Wash Only. BPA Free & Eco-friendly - This makes a safe, green, flavor free and healthier alternative to plastic bottles and cups. Save money on disposable cups that won't keep your liquids hot or cold by buying this cup that lasts a lifetime. Fill your tumbler with coffee, sweet tea, beer, ice water, milkshakes, lemonade, soda and more! Fits Most Cup Holders - The bottom of the mug is conveniently sized to fit car cup holders for easy portability. Save money on disposable cups that won't keep your liquids hot or cold by buying this travel coffee mug that lasts a lifetime. Fill your thermal coffee mug with coffee, sweet tea, ice water, milkshakes, lemonade and more!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_37",
    "title": "Mellanni Full Fitted Sheet Only - Iconic Collection Bedding Sheets - Soft & Cooling Sheets with up to 16 inch Deep Pocket - All Around Elastic - Wrinkle, Fade, Stain Resistant - 1 PC (Full, Spa Blue)",
    "price": 18.97,
    "rating": 4.5,
    "rating_count": 23981,
    "image_url": "https://m.media-amazon.com/images/I/41ktCA6Do+L._AC_.jpg",
    "description": "Fitted Sheet - Super Silky Soft - Highest Quality 100% Brushed Microfiber BeddingWrinkle, Fade, Stain Resistant - Deep Pocket Luxury Fitted SheetBest For Bedroom, Guest Room, Childrens Room, RV, Vacation Home, Bed in a Bag Addition Mellanni Fine Linens wraps you in elegance, luxury and comfort. Indulge in silky soft, 100% brushed microfiber carefully crafted in every detail Here’s What A Few Of Our Raving Fans Are Saying“Softest Sheets Ever!” “Best sheets I've ever slept on” “Best customer service on Amazon, Period” “Beats any other product” Microfiber sheets are breathable, keep moisture away. Comes in Twin, Twin XL, Full, Queen, King and California King.Perfect for adults, kids, toddler, teen girls and boys. These luxuries fitted sheet stay fresh, cool during hot nights and warm in cold nights - leaving you and your family rested and ready for a new day. Extremely soft and comfortable! Mellanni Lifetime Promise - Mellanni is a different kind of company that prides itself on providing the absolute best customer service in the industry. If you are not satisfied with your purchase at any point and for any reason, you can return it with no questions asked. That's the Mellanni Promise (in fact, you don't even have to send back the product) Good Housekeeping Best Bedding Award Winner - Tried, tested, & named \"Buttery Budget Buy\" in 2022, Mellanni's Iconic Collection offers unbelievable soft bedding at an affordable price. Enhance your bed with the luxurious comfort of our most popular Fitted Sheet Full Size 54\" x 75\". Temperature Regulating - Moisture-wicking, breathable, & silky to the touch. Mellanni double-brushed microfiber is cozy or cooling, depending on the season. Our lightweight fitted sheet is ideal for all sleepers, including those with sensitive skin. Easy Care Technology - Signature Mellanni Weave is quick drying and more durable than cotton. Stain, shrink, fade, wrinkle, & pill-resistant. Easy to spot clean and machine washable, it's the perfect fitted she",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_38",
    "title": "JELLYMONI 100% Washed Cotton Duvet Cover Set Twin Size, Luxury Soft Bedding Set with Button Closure. Solid Color Pattern Duvet Cover(No Comforter) (Pink, Twin, 2Pcs)",
    "price": 41.99,
    "rating": 4.5,
    "rating_count": 18799,
    "image_url": "https://m.media-amazon.com/images/I/515Nmra5eyL._AC_.jpg",
    "description": "JELLYMONI is committed to offer premium bedding with style. Our mission is to bring warm, cozy comfort to families all over the world. SUPERIOR MATERIAL CHOSEN: Made by High-quality material, it is skin-friendly, breathable, machine washable and never fade. Washed cotton is the raw material handled by special process. It is more comfortable than other materials. This ultra-soft comfy and breathable fabric is perfect for a restful night’s sleep. NATURAL DESIGN: The nature wrinkled fabric and button closure presence a cozy and vintage style. No ironing required to maintain wrinkled texture. Colors available tend to be neutral and can easily bring a relaxed, lived-in look to any room's decoration especially the vintage style. There are ties in the corners to hold your duvet in place. HOW TO CARE: Machine wash separately on cold, tumble dry on low with similar colors and low temperature iron when needed. We advise you wash the set and using fabric softener before putting it over your comforter or lavish home quilt set, do not bleach. WHAT YOU CAN GET: Available in JELLYMONI Washed cotton Soft Breathable Comforter Cover Set Bedding Sets in Twin Size 68\" x 90\", 1 pillow case 20\" x 26\"; JELLYMONI provides 1-Month return and replacement service & life-time free customer service - We want our customers to be 100% happy and satisfied - You are always welcome to us!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_39",
    "title": "Brightown Hanging Window Curtain Lights 9.8 Feet Dimmable, Connectable with 300 Led, Remote, 8 Lighting Modes, Timer for Bedroom Wall Party Indoor Outdoor Decor, Blue Lights (Curtain is Not Included)",
    "price": 16.98,
    "rating": 4.6,
    "rating_count": 13203,
    "image_url": "https://m.media-amazon.com/images/I/51T3uVYivtL._AC_.jpg",
    "description": "",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_40",
    "title": "storageLAB Underbed Storage Containers, Storage Bin for Clothes, Blankets, Shoes and Pillows (1 Piece with Wheels)",
    "price": 64.99,
    "rating": 4.7,
    "rating_count": 12909,
    "image_url": "https://m.media-amazon.com/images/I/41iLHT1hYGL._AC_.jpg",
    "description": "Wheely good under bed storage! Set of 2 underbed drawers: - 27 x 24½ x 6¼ inches - 50L capacity and holds up to 35lb each - Linen exterior, metal support frame - 4 casters for great maneuverability These under bed drawers on wheels each holds up to: - 10 pairs of shoes, or - 2 queen-size summer blankets - 60 shirts or t-shirts IT’S GOOD, WHEELY GOOD - rolls easily even on carpet. Combines a homely linen exterior with the rigidity of a metal support frame. Works great as under bed drawers. IT’LL NEVER TYRE of being pushed around. Designed with daily use in mind with four casters and a durable front handle. Ideal for organizing shoes and clothes you frequently access. READY TO ROLL IN MINUTES - wheels come preinstalled. No finicky hooks or snaps to deal with. We designed this to be the easiest underbed storage with wheels to assemble. 27 x 24½ x 6¼ inches. Set of two, each with 50L capacity and holds up to 35lb. A detachable middle divider sets this up perfectly for under bed shoe storage, though it also stores clothes and blankets just as well. PATENT PENDING. We didn’t re-invent the wheel, just under bed storage. The entire StorageLAB team is really proud of this one.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_41",
    "title": "Wilton White 6-Inch Lollipop Sticks, Cake Pop Sticks, 100-Count Currenlty #1 item for \"lollipop sticks\" search",
    "price": 7.8,
    "rating": 4.8,
    "rating_count": 13798,
    "image_url": "https://m.media-amazon.com/images/I/41UneNutsnL._AC_.jpg",
    "description": "Have these Wilton lollipop sticks on hand whenever you want to make a tasty treat. Made of sturdy paper, this baking essential can be used as cake pop sticks or for chocolate lollipops made with Wilton candy melts candy and molds. Includes 100 sticks. MADE EASY: These sturdy baking essentials can be used to create a wide variety of tasty treats. Whether making as cake pops for a baby shower from a favorite cake mix or delicious lollipops made with Wilton Candy Melts candy and molds BAKING ESSENTIAL: These Wilton paper sticks are just the right size for cake pops or candy pops CONVENIENT: Includes 100 Wilton paper sticks to help create treats that will please the sweet tooth of a large crowd of family and friends MORE FROM WILTON: Wide variety of candy molds and other tools so you can create treats for any occasion. Homemade candy makes a great gift, and it’s a fun way to spend time together when you’re looking for an easy and tasty activity to do! INCLUDES: 100 Wilton lollipop sticks, 6 inches each (not for use in the oven)",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_42",
    "title": "Mezzati Ultra Soft and Lightweight Bed Sheet Set - Brushed Microfiber Bedding for a Comfortable Night's Sleep (Persimmon Orange, Full Size)",
    "price": 32.7,
    "rating": 4.5,
    "rating_count": 14223,
    "image_url": "https://m.media-amazon.com/images/I/31Gs4q8ElDL._AC_.jpg",
    "description": "Mezzati Luxury Bed Sheets are super soft and comfortable. Soft, Microfiber Sheets Set The sheet set includes a flat sheet, fitted sheet with 14” pocket depth (will fit mattress up to 16 inches deep), and pillow case(s) with envelope like closure. We offer multitude of colors to match your mood, design or inspiration. All-Season Comfort Ultra-soft with peach-like finish and pleasant to the touch, the bedding set provides all-season long comfort with its breathable brushed microfiber material. Machine Washable The durable sheets are so easy to care for. Simply machine wash on warm and tumble dry on low or high. Just make sure to remove promptly. Use only non-chlorine bleach as needed. Microfiber Imported Full Size 4pc Set - 1 flat sheet (81\" x 96\"), 1 fitted sheet (54\" x 75\"), and 2 standard size pillowcases (30\" x 20\"). All-around elastic on 14” fitted sheet allows for snug, secure fit of most mattress sizes up to a 16” mattress depth. Brushed microfiber material is stronger than cotton, offers exceptional softness, easy to care for, affordable, light weight, wrinkle and fade resistant and feels great to the touch. Care instructions: machine wash on warm, no bleach, tumble dry low. Mezzati Luxury sheets. The feel of pure comfort.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_43",
    "title": "Exquisite 12-Pack Premium Plastic Tablecloth 84in. Round Table Cover - Pink",
    "price": 20.99,
    "rating": 4.6,
    "rating_count": 11637,
    "image_url": "https://m.media-amazon.com/images/I/41ZLlTY2eSL._AC_.jpg",
    "description": "PREMIUM QUALITY PROTECTION: This 12 pack of 84 in. Pink Round plastic tablecloths will cover any table up to 7 feet. Unlike your typical paper table clothes these disposable table covers for parties are spill and waterproof!!! HIGH OPACITY: covers any table with minimal transparency. Great plastic tablecoth for parties, weddings, holdiay party, , birthday parties, christmas, thanksgiving dinner, bbq, and any other color themed event. DOSPOSABLE: Disposable works! When the party is over, cleanup is easy - just roll up the disposable tablecloth and dispose of it. INCLUDES: 12 heavy duty disposable Pink plastic table cloth that will cover your table for protection and is great for homes with children, kitchen tables, dinning tables, dinners, family outings. bbq's and more!!! SELECTION: Our heavy duty plastic table covers are available in rectangle and round. cover your tables with our disposable checkedered or solid table coverings made heavy plastic and sure to hold up well. You can also match them with our full line of plastic table skirts, forks, knives, spoons, plates, cups and more!!!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_44",
    "title": "Deconovo Back Tab and Rod Pocket Blackout Curtains for Living Room, Thermal Insulated Light Blocking Curtains, 42x84 Inch, Dark Forest, 2 Panels",
    "price": 18.89,
    "rating": 4.6,
    "rating_count": 20775,
    "image_url": "https://m.media-amazon.com/images/I/41tUtNISF9L._AC_.jpg",
    "description": "BLACKOUT EFFECT - As room darkening curtains, these BLACKOUT CURTAINS for bedroom can reduce and block 85%-98% sunlight and streetlight(Darker Colors block more)for an increased comfort for you and your families. Provide you a superior sleep experience by hanging these deconovo blackout curtains in your bedroom. INCREASED COMFORT - As thermal insulated blackout curtains for living room, they can help balance the room temperature by blocking out sunlight during summer and retaining it in during winter. They also reduce the noise outside, giving you a decent space to enjoy no matter how noisy your neighbors are. BASIC INFORMATION - 1 Package contains 2 BLACK OUT curtain panels. Each Drape measures width 42x84 length (Inches). There are 3 hanging styles to choose from: back loops(back tab), rod pocket or with your own clip-rings. DESIGN and TEXTURE - This solid color blackout curtain features a smooth and elegant fabric with a silky touch and a beautiful drape that bring charm and modernity to your interior. Also thses black out curtains can suitable for most decoration styles. CARE INSTRUCTIONS - Designed for the everyday busy home owners with a smooth fabric for effortless hanging. For convenience, these curtains are machine washable. Wash below 86°F on gentle cycle. Do not bleach or tumble dry, low iron.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_45",
    "title": "Walensee Bathroom Rug Non Slip Bath Mat (24x17 Inch Lavender) Water Absorbent Super Soft Shaggy Chenille Machine Washable Dry Extra Thick Perfect Absorbant Best Small Plush Carpet for Shower Floor",
    "price": 17.99,
    "rating": 4.5,
    "rating_count": 11826,
    "image_url": "https://m.media-amazon.com/images/I/51DBB+ywRYL._AC_.jpg",
    "description": "Chenille Non-slip: Skid resistant bottom is made of high quality hot melt. This anti-skid backing keeps bathmat firmly in place. It won't slip or slide. Please place the non-skid toilet rug on DRY SMOOTH FLOOR only. Water under the bathroomrug can cause it to slip. Keep bottom of the bath rug dry. Machine Washable & Dry: Walensee 24 x 17 Inch luxury Bath Rug have been tested and can be machine washed and machine dried time and time again. Easy for clearance and anti slipping adhesive backing is much stronger and durable for long lasting use. The colors keep vibrant even after many times washes. Extra Softness & Thick: Pamper your feet! This bath mat features a luxurious soft pile that soothes tired feet and shields toes from the cold floor. Compare the normal quality 1350g/sm, this chenille carpet is more bushy and up to 2000g/sm weight. The density and plushness of our pile surpasses that of most other brands. Great for vanity, vacation home, master bathroom, kids bathroom, guest suite. Great gift idea for all occasions, christmas, wedding, fathers day, mothers day, valentines. Ultra Absorbent: The microfiber shag bath rug is much more absorbant than cotton bath rugs. High-pile chenille fabric helps save your floors from dripping water while you’re stepping out of the bath, shower, spa, or getting ready by the sink. Moisture is trapped in the mat’s deep pile, allowing the rug to dry quickly and cleanly. Create Your Bathrooms Oasis: With many different solid colors and sizes to choose from, you will easily find rugs to coordinate with your decor! The elegant rugs can be used at tub side, front of the sink, or at any place where you want support and warmth on your toes! It can make a significant difference in overall color scheme of your bathroom scheme or coordinate with towels and other decor or accessories. We stand by our products 100% and want our customers to love them as much as we do!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_46",
    "title": "Silk Pillowcase for Hair and Skin,Soft,Breathable and Sliky 100% Queen Silk Pillow Case Set of 2,Both Sides Natural Mulberry Silk Pillowcases with Hidden Zipper(Queen Size 20\"X 30\",2pcs)",
    "price": 30.59,
    "rating": 4.6,
    "rating_count": 11648,
    "image_url": "https://m.media-amazon.com/images/I/31-L5j4h8jL._AC_.jpg",
    "description": "💎【Silk Pillowcase】Our pillow cases are made of Silk, with rich elastic touch, extremely soft appearance, not easy to wrinkle, strong and durable, not easy to be damaged by repeated use, not easy to stain, simple in appearance, easy to match, and improve the happiness of life. 💎【Smooth and Soft Silk Pillowcase】The surface of the Silk Pillowcase is smooth and shiny, reducing friction on beautiful curly hairstyles and the face. The pillow covers does not absorb any moisture after styling for one night, keeping the hair and skin smooth and shiny, without entanglement. 💎【Cool Silk Pillowcase】It can be applied all year round. It has a cool body feel, keeps a comfortable body temperature in hot weather, cools the body, and perfectly enjoys the moment of sleep. The cool Silk Pillowcase does not absorb moisture. 💎【Firm & Easy to Clean】Put the silk pillowcase into a net-like laundry bag and add it to a neutral washing machine. It can be machine-washed or hand-washed, but it is not easy to twist it too dry. Let the pillowcase keep a certain amount of moisture and dry it in the shade to avoid wrinkles. 💎【Best Gift Choice】Gorgeous and luxurious outer silk pillowcase packaging. Everyone needs a pillowcase for one-third of the time every day，a suitable pillowcase can make your sleep more comfortable.Not only silk pillow cases for women, our pillow cases are also suitable for men, the elderly, and children. We recommend buying two or more, because these Silk Pillow Cases can be the luxurious present for Birthdays, Valentine's Day, Christmas, Thanksgiving gifts.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_47",
    "title": "Evershine (6-Pack Heavy Duty Plastic Table Covers Tablecloth (Reusable) (Rectangle 54\" x 108\", Black)",
    "price": 15.99,
    "rating": 4.7,
    "rating_count": 11585,
    "image_url": "https://m.media-amazon.com/images/I/41aBMpvgNeL._AC_.jpg",
    "description": "Tablecloth Plastic Plastic Table Cover. Color: Black. Rectangle 54\" X 108\". 6 pack. Premium Heavy Duty Quality: Our selection of round heavy duty plastic cover will cover any table up to 7 feet. This is made from durable premium heavy duty plastic. It covers any table with minimal transparency. Multiple purpose: Great plastic tablecloth for home, restaurant, parties, weddings, outdoor events, catering, theme party and any other special events. It can also be used to cover up the floors to avoid any spills or any other small particles. Reuseable or Disposable: Our heavy duty plastic table cover can be reusable after party, simply rinse it up with water. OR disposable, easy clean up, roll up the table cover and dispose. Over 20 colors available: We offer different size of package quantities in over 20 colors. Save more by going larger size package quantity.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_48",
    "title": "opux Lunch Box Insulated Lunch Bag for Women | Dual Compartment Double Deck Large Lunch Cooler Bag Tote, Leakproof Soft Cooler Lunch Box for Adults Work Office",
    "price": 17.99,
    "rating": 4.6,
    "rating_count": 11648,
    "image_url": "https://m.media-amazon.com/images/I/51xn5TmR9EL._AC_.jpg",
    "description": "Thermal Insulated Dual Compartment Lunch Bag by OPUX This durable, functional, and easy to use Premium Thermal Dual Compartment Lunch Bag by OPUX is perfect for meal prepping and taking your lunch to work, picnic or on the go. Bring a healthy and fit lifestyle anywhere you'd like! This durable, functional, and easy to use Premium Thermal Dual Compartment Lunch Bag by OPUX is perfect for meal prepping and taking your lunch to work, picnic or on the go. Bring a healthy and fit lifestyle anywhere you'd like! These Eco-friendly lunch bags are lined with thermal insulated lining and are spacious enough to fit more than one person's lunch! Our double-decker lunch pail is spacious and includes 2 side mesh pockets for drink bottles and soda cans. These Eco-friendly lunch bags are lined with thermal insulated lining and are spacious enough to fit more than one person's lunch! Our double-decker lunch pail is spacious and includes 2 side mesh pockets for drink bottles and soda cans. These insulated bags offer different ways of packing your food with its double-deck design, which allows you to separate hot and cold food and beverages. This extra room also allows for ice packs and ice blocks to keep your food and drinks extra cold like a cooler. These insulated bags offer different ways of packing your food with its double-deck design, which allows you to separate hot and cold food and beverages. This extra room also allows for ice packs and ice blocks to keep your food and drinks extra cold like a cooler. Measures at 10\" x 7.5\" x 10\" (L x W x H) and is made from high-quality nylon and polyester fabric with reinforced zippers, ensuring maximum durability. Measures at 10\" x 7.5\" x 10\" (L x W x H) and is made from high-quality nylon and polyester fabric with reinforced zippers, ensuring maximum durability. OPUX creates quality products for your many lifestyles. Our Vision To provide premium kitchen and wine products that greatly simplifies your life. We will continue to innovate a",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "home_and_kitchen_49",
    "title": "Nestl Extra Twin Deep Pocket Sheets Set - 4 PC Soft Microfiber Twin Sheets Deep Pocket - Fade Resistant Bedding Sheets & Pillowcases - Twin, Hunter Green",
    "price": 23.99,
    "rating": 4.6,
    "rating_count": 11668,
    "image_url": "https://m.media-amazon.com/images/I/41NjpdVCYzL._AC_.jpg",
    "description": "Microfiber EXTRA DEEP POCKET SHEETS: Deep pocket sheets fit deep pocket 18, 20, 21, 22, and 24-inch mattresses. These are great for extra deep matresses/large matresses/very tall matresses and fits well matresses with 3 inch or 4 inch memory foam mattress toppers, double pillow top, memory foam toppers, or big mattress pads! TWIN SIZED: includes one extra deep pocket fitted sheet, 1 flat sheet, and two pillowcases. Extra deep pocket fitted sheet measures 75 inches x 39 inches with 21-inch pockets. Flat Sheets measure 96 inches x 66 inches. Pillowcases measure 20 x 30 inches. Also available in Twin, Twin XL, Full, Full XL, Queen, and King sizes. SUPER SOFT PREMIUM MICROFIBER: Hotel-quality bedding is woven from the highest quality microfiber material, double brushed on both sides for ultimate softness and comfort. ELEGANT AND VIBRANT: our bedding is pet-friendly and made to last. Our fabulous selection of vibrant colors won’t fade after washing and the classic stripe detail is a beautiful, elegant way to update your bedroom. 100% SATISFACTION: Welcome to the Nestl Bedding family! Our #1 goal is to provide you with unparalleled customer service and we’re only happy if our customers are happy! Shop with confidence because no matter what, we’ve got you covered!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  }
]