[
  {
    "sku": "office_products_0",
    "title": "SHARPIE S-Gel, Gel Pens, Medium Point (0.7mm), Blue Ink Gel Pen, 4 Count",
    "price": 5.53,
    "rating": 4.6,
    "rating_count": 34210,
    "image_url": "https://m.media-amazon.com/images/I/515r5xbNhLL._AC_.jpg",
    "description": "The power of Sharpie is now in a gel pen with the Sharpie S-Gel. With no smear, no bleed technology and bold, best-in-class ink, this Sharpie pen delivers always-vivid writing. It’s a high-performance gel pen with a sleek, professional look that makes it a writing instrument you won't want to loan out. And the contoured rubber grip makes for comfortable writing during any task. Available in multiple point sizes, barrel finishes and gel ink colors, Sharpie S-Gel offers a smooth writing experience perfect for homes, schools, or offices. Gel pen with no smear, no bleed technology Intensely bold gel ink colors offer always vivid writing Contoured rubber grip for a comfortable writing experience Medium Point (0. 7mm) Includes 4 blue gel ink pens",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_1",
    "title": "Pentel Gel Ink Pen, EnerGel RTX Retractable Gel Pen, 0.5mm, Needle Tip, Black Ink, 2 Pack (BLN75BP2A)",
    "price": 7.2,
    "rating": 4.8,
    "rating_count": 24914,
    "image_url": "https://m.media-amazon.com/images/I/41dl-v6bK8L._AC_.jpg",
    "description": "Pen comes with black, red, blue, green, or violet ink. EnerGel RTX Liquid Gel Pen The EnerGel family of liquid gel pens offers a variety of choices from retractable to capped, fine point to bold, several barrel styles, and a wide selection of vibrant ink colors. With so many options, you're sure to find an EnerGel pen that matches your style. EnerGel RTX pens come with either black, red, blue, green, or violet ink. However, they can be refilled with any EnerGel refill available in a variety of other vibrant colors to match your mood and keep your writing instrument unique to you. Quick Drying Ink EnerGel ink dries super fast, which is why left-handed writers love EnerGel -- No Smears, No Smudges, No Globs. High-Tech Smoothness EnerGel liquid gel ink is a high performance ink technology that combines the best qualities of liquid and gel ink for a super smooth writing experience. Liquid ink characteristics provide an easy flowing ink supply, while gel ink characteristics include smoothness of writing, vibrant colors and fast-drying capability. Refillable Don't toss out your pens! Did you know that over 90% of EnerGel products are refillable? Why throw away your pen and contribute to landfills when you can replace your depleted ink cartridge with any size and/or color EnerGel refill. Help the environment while saving money! Be Bold . .. or Medium, or Fine Fine line widths are achieved with our 0.5mm needle tip pens Fine line widths are achieved with our 0.5mm needle tip pens Medium lines are achieved with our 0.7mm needle and 0.7mm metal tip pens Medium lines are achieved with our 0.7mm needle and 0.7mm metal tip pens Bold lines are achieved with our 1.0mm metal tip pens Bold lines are achieved with our 1.0mm metal tip pens Recycology Pentel has been committed to protecting the environment for over 40 years. We developed the Pentel Recycology program to further our efforts to minimize our carbon footprint and help save the planet. Over 75% of our products use recycled ",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_2",
    "title": "KYODOLED Large Metal Cash Box with Money Tray and Lock,Money Box with Cash Tray,Cash Drawer,9.84\"x 7.87\"x 3.54\" Pink Large",
    "price": 16.99,
    "rating": 4.6,
    "rating_count": 13392,
    "image_url": "https://m.media-amazon.com/images/I/313oeO0PdfL._AC_.jpg",
    "description": "HIGHLY QUALITY: Cash box is made of durable steel which is solidly built and can prevent it from drops and impacts.Equipped with a wide carrying handle, you can transport your locking cash box easily. PRIVACY AND SAFETY: Safe 2 Keys for Metal Petty cash box.Lock box has a privacy key lock to keep valuables safe.Either the box or the key is durable material quality that could be employed for a long time. SUFFICIENT STORAGE SPACE: Key lock box has double layers,the upper removable one with 5 compartments trays for cash,coins,and keys.The bottom one of the money box is designed for checks, receipts and valuables. WIDE APPLICATION:Lock box with key is suitable for indoor and outdoor small business,commercial supermarket,store,cafe use.Suitable to store bills, coins, checks and receipts. SIZE AND COLOR: Money box with slot size is 9.84\"x 7.87\"x 3.54\" (250*200*90mm). Color is Cute Pink.Due to different batches, the size will vary. If you have any questions, please contact.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_3",
    "title": "Pentel Energel RTX Retractable Liquid Gel Pen, Bold Line, Metal Tip, Black Ink Pack of 2 (BL80BP2A)",
    "price": 6.84,
    "rating": 4.8,
    "rating_count": 42464,
    "image_url": "https://m.media-amazon.com/images/I/41y8bKrvhLL._AC_.jpg",
    "description": "The EnerGel RTX offers a luxury feel and a smooth, effortless writing experience. High performance ink technology combines the best qualities of liquid and gel ink. Fast-drying liquid gel ink is great for left handers - no smears, no smudges, no globs. The sleek and stylish barrel design features stainless steel accents for a professional look. The latex-free grip provides extended comfort and control when writing. It is available with a 0.7mm stainless steel tip writes medium lines, 1.0mm tip writes bold lines. Refillable with any size and/or color EnerGel refill. It is backed by a Limited Lifetime Warranty. High performance ink technology combines the best qualities of liquid and gel ink for a super-smooth writing experience Liquid gel ink dries so fast even left handed writers love it - no smears, no smudges, no globs EnerGel ink writes more smoothly than the leading brand ( Internally tested to be smoother writing than the leading gel pen on standard writing paper) Sleek & stylish barrel design with metal accents for a Professional look Latex-free grip for writing comfort and control",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_4",
    "title": "BIC Wite-Out Brand EZ Correct Correction Tape, 19.8 Feet, 4-Count Pack of white Correction Tape, Fast, Clean and Easy to Use Tear-Resistant Tape Office or School Supplies",
    "price": 5.55,
    "rating": 4.6,
    "rating_count": 52837,
    "image_url": "https://m.media-amazon.com/images/I/51pWRsmZbQL._AC_.jpg",
    "description": "Product Description Make fast, easy and precise corrections on even the toughest errors with BIC Wite-Out Brand EZ Correct Correction Tape. This tear-resistant, film-based BIC Wite-Out Brand Correction Tape comes in a tape dispenser that offers maximum comfort and control, so you can easily and accurately correct mistakes. The tear resistance offers tidy, inconspicuous corrections that last. The Wite-Out Brand tape requires no dry time and won’t bleed or drip, so you can instantly write or type your corrections over it. A translucent body lets you see exactly how much BIC correction tape remains and a self-winding wheel lets you easily rewind the correction tape should it become loose. One pack contains four tape dispensers, each containing 39.3 feet of white correction tape. If you’re looking for reliable office or school supplies for lefties and righties, look no further than this white correction tape. From America’s No. 1 correction brand*, choose BIC Wite-Out Brand EZ Correct Correction Tape for a high-quality, safe and affordable product you can trust. *Source: The NPD Group/Retail Tracking Service and Commercial Tracking Service, U.S., based on actual unit sales; 12ME June 2022 combined. From the Manufacturer BIC Wite-Out Correction Tape - 4pk One 4-count pack of BIC Wite-Out Brand EZ Correct Correction Tape, a tear-resistant, film-based correction tape with a tape dispenser offering maximum comfort and control Instantly write or type your corrections with this white correction tape, which requires no dry time and won’t bleed or drip Clear correction tape dispenser lets you see exactly how much tape remains and the self-winding wheel lets you rewind the tape if it becomes loose Each tape dispenser contains 39.3 feet of white correction tape to offer a long-lasting option for school or office supplies Suitable for righties and lefties, these BIC Wite-Out Brand tapes offer a wide variety of use amongst students and employees for their documents and assignments ",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_5",
    "title": "Pendaflex Recycled Hanging Folders, Legal Size, Orange, 1/5 Cut, 25/BX (81627)",
    "price": 26.81,
    "rating": 4.7,
    "rating_count": 38833,
    "image_url": "https://m.media-amazon.com/images/I/41-G+sY2LLL._AC_.jpg",
    "description": "Pendaflex Recycled Hanging Folders provide a smart option for everyday filing. Color folders are made from 100% recycled fiber with 60% post-consumer fiber. Contrasting kraft paper interiors help prevent time-wasting misfiles. Includes a printable label sheet and 25 clear 1/5-cut tabs. Legal size, orange. 25 Per box. Color folders made from 100% recycled fiber with 60% post-consumer fiber Box of 25 legal-sized orange hanging folders Includes printable label sheet and 25 clear 1/5-cut tabs Contrasting kraft paper interiors help prevent time-wasting misfiles Perfect for standard or color-coded filing",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_6",
    "title": "BOSOBO Round Mouse Pad, Beautiful Flowers Mouse Pad, Small Mousepad with Designs, Non-slip Rubber Mouse Pad with Stitched Edges, Customized Mouse Pad for Women Girls Office Dorm Computer Laptop Travel",
    "price": 6.99,
    "rating": 4.8,
    "rating_count": 16816,
    "image_url": "https://m.media-amazon.com/images/I/516ZZd7A4ML._AC_.jpg",
    "description": "► PERSONALIZED MOUSE PAD: This cute mousepad measures 7.9 x 7.9 x 0.1inch ( 200mm x 200mm x 3mm), small size but perfect size for work and game. Elegant geometric shape and exquisite illustration add personality to your office, perfect for all style desktop, office, home, computer, keyboard and mice. Great gift idea for Girls, Women, Moms, Birthday, Back to School, Valentine's Day, Easter Day, Mother's Day, Labor Day, Halloween, Thanksgiving Day and Christmas. ► ULTRA-SMOOTH SURFACE: This round mouse mat is made with newest tech microfiber fabric, the texture is denser with 230°F and high pressure treatment, which make it the ultimate in touch, while delivering more accurate and more fast mouse movement. Available for all types of mouse, LASER & OPTICAL. ► NON-SLIP RUBBER BASE: Dense shading and anti-slip natural rubber base can firmly grip the desktop for stable operation of the mice, effectively prevents the mice from sliding and moving. Premium soft material for your comfort and mouse-control. ► DURABLE & EASY MAINTENANCE: The updated version with delicate stitched edges which can prevent wear, ensuring prolonged use without deformation and degumming. Crystal clear enamel coating features great locking-color effect, prevents the vibrant mouse pad pattern from fading or bleeding after repeated cleaning. It is waterproof, dust-proof and sweat-proof, easy to maintain. Liquid stains can be cleaned with water for continuous use. ► What You Get: 1 x cute mouse pad, friendly customer service and 6 Months Worry-Free Guarantee. For any reason you are not satisfied with your round mousepad, be free to contact us and we will replace it or send you an full money back refund, no questions asked. Many color to choose from, includes pink, black, white, green, blue etc, choose one and add a little color to your office.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_7",
    "title": "Amazon Basics Multipurpose Copy Printer Paper, 8.5 x 11 Inch 20Lb Paper - 1 Ream (500 Sheets), 92 GE Bright White",
    "price": 8.49,
    "rating": 4.8,
    "rating_count": 135510,
    "image_url": "https://m.media-amazon.com/images/I/41dLqWTBoYL._AC_.jpg",
    "description": "Product Description Amazon Basics Multipurpose Copy Printer Paper, 8.5 x 11 Inch 20Lb Paper - 1 Ream (500 Sheets), 92 GE Bright White From the Manufacturer Amazon Basics 1 ream (500 sheets) of 8.5 x 11 white copier and printer paper for home or office use Multipurpose letter size copy paper works with laser/inkjet printers, copiers and fax machines Smooth 20lb weight paper for consistent ink and toner distribution; dries quickly and resists paper jams Bright white paper (92 GE; 104 Euro) offers great contrast for crisp printing and vivid color Virgin copy paper providing professional quality results; acid-free to prevent yellowing Dimensions: 8.5 x 11 inch letter sized sheets",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_8",
    "title": "Antner A6 PU Leather Notebook Binder Refillable 6 Ring Binder for A6 Filler Paper, Loose Leaf Personal Planner Binder Cover with Magnetic Buckle Closure, Dark Yellow",
    "price": 6.99,
    "rating": 4.7,
    "rating_count": 13218,
    "image_url": "https://m.media-amazon.com/images/I/31Ee6RskpML._AC_.jpg",
    "description": "Premium PU leather notebook binder cover, 6 round ring binder suitable for all standard A6 size inner pages 6 ring binder's material is stainless steel, nickel-plated finish, 2cm inner diameter can hold 80-100 sheets A6 filler paper Multifunctional, hidden compartments and card pockets and pen loop on two sides, suitable for storing pen, passports, ID cards, bank cards, and other important things Using with A6 binder pockets for your budget envelope system will be a cost-effective combination (binder cover only, package do not include binder pockets and refill paper) Portable, 7.48 x 5.2 inch, lightweight easy to carry, convenient for home, office, school and travel, easily fits in your handbag, backpack, suitcase or desk",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_9",
    "title": "DYMO Label Maker, LetraTag 100H Handheld Label Maker, Easy-to-Use, 13 Character LCD Screen, Great for Home & Office Organization",
    "price": 30.32,
    "rating": 4.7,
    "rating_count": 51580,
    "image_url": "https://m.media-amazon.com/images/I/51f7ikEm4eL._AC_.jpg",
    "description": "Small, sleek and super portable, the handheld Letra Tag 100H is the ideal label maker for your home. It prints on a variety of colored labels, plus adds popular features like multiple font styles, underlining, bolding, text sizing and more. Its graphical display lets you see font effects on screen, so you know exactly what you’re printing each and every time. Each order comes with 3 bonus label tapes. Product features include: 9 label memory, 2 line printing, date stamp, auto-off power saver. PORTABLE LABEL MAKER: Compact and lightweight for portability, making it easy to label just about anything, anywhere PRINTS CUSTOM LABELS: Choose from 5 font sizes, 7 print styles and 8 box styles PREVIEW TEXT EFFECTS: See font effects on screen before you print with a graphical display. ABC style keyboard allows for quick creation of labels SAVE POWER: Auto off functionality when not in use BONUS PACK INCLUDES: 1 LT paper label (1/2 inches) black on white cassette, 1 LT plastic label (1/2 inches) black on white cassette and 1 LT plastic label (1/2 inches) black on clear cassette",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_10",
    "title": "SHARPIE S-Gel Gel Pens, Bold Point (1.0mm), Black Ink Gel Pen, 12 Count",
    "price": 12.65,
    "rating": 4.7,
    "rating_count": 21144,
    "image_url": "https://m.media-amazon.com/images/I/51RY9lLEdlL._AC_.jpg",
    "description": "The power of Sharpie is now in a gel pen with the Sharpie S-Gel. With no smear, no bleed technology and bold, best-in-class ink, this Sharpie pen delivers always-vivid writing. It’s a high-performance gel pen with a sleek, professional look that makes it a writing instrument you won't want to loan out. And the contoured rubber grip makes for comfortable writing during any task. Available in multiple point sizes, barrel finishes and gel ink colors, Sharpie S-Gel offers a smooth writing experience perfect for homes, schools, or offices. Gel pen with no smear, no bleed technology Intensely bold gel ink colors offer always vivid writing Contoured rubber grip for a comfortable writing experience Bold Point (1. 0mm) Includes 12 black gel ink pens",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_11",
    "title": "Texas Instruments TI-30XIIS Scientific Calculator, Black with Blue Accents",
    "price": 10.97,
    "rating": 4.7,
    "rating_count": 36636,
    "image_url": "https://m.media-amazon.com/images/I/51NqK2WPUVL._AC_.jpg",
    "description": "Product Description Fundamental, two-line calculator combines statistics and advanced scientific functions for high school math and science. Get ready for class with this TI-30X IIS Scientific Calculator. It features a two-line display that shows both entry and calculated results at the same time. This scientific calculator combines statistics and advanced scientific functions for high school math and science classes. It also has edit, cut and paste entries for more complex applications. This scientific calculator also has a recall button so you can review your previous work. It is approved for use with SAT, ACT and AP tests. 2-line display shows both entries and calculated results on the same screen Designed to calculate statistics and scientific functions with features for fractions and conversions 1- and 2-variable statistics Allows review of previous entries to look for patterns Solar and battery-powered TI-30XIIS calculator is approved for use on SAT, ACT and AP exams Color: Blue Special FeaturesMesh Back Amazon.com The Texas Instruments TI-30X IIS 2-Line Scientific Calculator features two-line display and other advanced features users get with the TI-30X IIS. The display shows the equation you are creating on the top line, and the numbers or symbols you are currently entering on the second line. Once the equation is solved, the results are displayed on the second line, and you can use the four arrow keys on the front of the calculator to edit the original equation in any way you like for a recalculation. Better still, pressing the up arrow repeatedly lets you browse through a cache of dozens of previous calculations, meaning you can look back to see the answer to a problem. The device uses solar power when possible but can fall back on the internal batteries (which are included) if there isn't enough light. There are three angle modes (degrees, radians, and grads), scientific and engineering notation modes, and even one- or two-variable statistical modes. Five",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_12",
    "title": "Pendaflex Recycled Hanging Folders, Letter Size, Standard Green, 1/3 Cut, 25/BX (81601)",
    "price": 19.75,
    "rating": 4.7,
    "rating_count": 15567,
    "image_url": "https://m.media-amazon.com/images/I/410xfnY1v-L._AC_.jpg",
    "description": "Pendaflex Recycled Hanging File Folders are a brilliant option for everyday filing. Our standard green hanging file folders have paper made from 100% recycled fiber with 95% post-consumer fiber. These two-tone hanging file folders are lighter on the inside to help prevent time-wasting misfiles. Each box includes blank label inserts and 25 clear 1/3-cut tabs. Standard green recycled hanging files, letter sized. 25 Per box.Fulfill your filing master plan : this value-priced basic makes it easy to refresh your oldest, worn-out hanging files, or replace the whole system with a filing plan you create from the ground up Prevent time-wasting misfiles : even our standard green hanging files have lighter interiors so you won’t waste time filing (losing) important documents between your hanging file folders Create files that grow with you : file folders are scored at bottom to expand with your workload It’s great to be coordinated : Use with Pendaflex letter-sized interior file folders for a perfectly dressed file drawer Made at home : these Pendaflex file folders are proudly made in the USA, a mark of quality you can rely on STAY CONSISTENT WITH OFFICE RECYCLING GOALS: these standard green folders have paper made from 100% recycled fiber with 95% post-consumer fiber LABELS & PRINTABLE INSERTS INCLUDED: each box of folders has 1/3-cut adjustable tabs and a sheet of blank label inserts to create neat and professional customized files IT'S LIGHTER ON THE INSIDE: Standard green hanging files have a lighter interior to help prevent accidental time-wasting misfiles between folders STOCK-UP SHOP & DONE: This never-out necessity comes with 25 letter sized hanging file folders per box and makes re-orders quick and convenient WAVE GOODBYE TO CLUTTER: Several boxes and a good filing plan puts you on your way to a clear desk and wide open spaces",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_13",
    "title": "EMINTA Desk Pad Mat Desktop Protector with Stitching Edge, 35.4 x 17Inch PU Leather Gaming Mousepad, Large Waterproof Writing Pad Desk Blotter for Home and Office – Gray",
    "price": 16.19,
    "rating": 4.8,
    "rating_count": 21035,
    "image_url": "https://m.media-amazon.com/images/I/41-K+YNlcpL._AC_.jpg",
    "description": "NEW UPGRADE STITCHES REINFORCEMENT: The stitches surrounding border are sewn on evenly and well made, more durable than the normal desk protector. Made of durable PU leather material, which protects your glass/wooden desktop from scratches, stains, spills, heat and scuffs. Perfect for both office and home. MULTIFUNCTIONAL DESK PAD: Size 35.4 x 17Inch is large enough to accommodate your laptop, mouse and keyboard. Texture surface can be used as mouse pad or desk blotter, allows you to freely use your mouse on its surface, forget a mousepad, this XL desk pad help save you more space. WATERPROOF, EASY TO CLEAN AND ORGANIZE: Come with a strap to roll up the desk pad easily, keep your desks clean and tidy, switch office mode anytime and anywhere. Waterproof material properties, simply wipe its surface with a wet cloth when clean it. DUAL-SIDED DESK MAT: Unlike many other single-sided desk pads, easy to dirty, damage and not waterproof. Reversible desk mat help prolong its lifespan; both sides are different colors, so no matter which side you choose, you will refresh mood. ONE YEAR WARRANTY We are dedicated to providing our customers with high quality products and superior customer service. All of our EMINTA desk pads come with a one year warranty. If you are not satisfied with our product, we can offer you a new one or 100% money back. A good gift choice for your family, friends and yourself.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_14",
    "title": "Case-It The Mighty Zip Tab Zipper Binder - 3 Inch O-Rings - 6 Pocket Expanding File Folder - 600 Sheet Capacity – Red (Pack of 6)",
    "price": 239.9,
    "rating": 4.5,
    "rating_count": 16669,
    "image_url": "https://m.media-amazon.com/images/I/41svmlDAh1L._AC_.jpg",
    "description": "The Case-it Mighty Zip Tab Zipper Binder is an efficiently-designed 3-ring organizer with a five-color, tabbed expanding file folder. This large-capacity binder includes a gusseted zipper made with ripstop material that conveniently keeps tears from spreading. The zipper has a unique angled design to make it easier and quicker to zip things up when packed with your important papers and materials. The D-146 uses Kraft board instead of PE board to give its binders a firm, stiff shape that won't buckle or warp. The spine is specially designed so that your binder can lay flat when open, making it easier to add or take papers out, and to take notes in. Case-it produces quality binders offering unique organizational tools for school or home use. SCHOOL SUPPLIES: Case-it’s 3-inch Mighty Zip Tab Zipper Binder has a standard O-ring size of 3 inches and holds up to 600 sheets of paper EXPANDABLE: Stay organized with the 5-color tabbed expanding file for important papers and documents. With that much room, keeping up with your classes is a breeze! MAXIMUM STORAGE - With no shortage of interior and exterior zippered pockets you can keep more items contained in one place. The exterior zipper pocket is great for storing a couple of pencils or pens for quick access EASY ACCESS: Take your classroom with you anywhere! This large-capacity binder features a gusseted zipper for easy access and a convenient handle and shoulder strap for versatile carrying CASE-IT QUALITY: We build our binders using only the highest quality materials to strengthen and maximize durability for a consumer on the go",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_15",
    "title": "HP 950 Black/951 Cyan,Magenta,Yellow Ink Cartridges (4-pack) | Works with HP OfficeJet 8600, OfficeJet Pro 251dw, 276dw, 8100, 8610, 8620,8625 8630 Series | Eligible for Instant Ink | X4E06AN",
    "price": 115.5,
    "rating": 4.7,
    "rating_count": 13343,
    "image_url": "https://m.media-amazon.com/images/I/41ulkHwLkHS._AC_.jpg",
    "description": "Ensure your printing is right the first time and every time with Original HP Ink, which provides precision output so you can take pride in fade-resistant documents and brilliant images. Original HP Ink is engineered to work with HP printers to provide consistent quality, reliability and value This cartridge works with: HP OfficeJet 8600; HP OfficeJet Pro 251dw, 276dw, 8100, 8610, 8615, 8620, 8625, 8630 Cartridge yield (approx.): 1,000 pages black, 700 pages per color Up to 2x more prints with Original HP Ink vs. non-Original HP Ink 82% of HP ink cartridges are manufactured with recycled plastic Get ink your way: buy Original HP Ink Cartridges or save up to 50% and never run out with HP Instant Ink, the Smart Ink Subscription What's in the box: 1 new Original HP 950 Black Ink Cartridge, 3 new Original HP 951 Ink Cartridges — 1 cyan, 1 magenta, 1 yellow (X4E06AN)",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_16",
    "title": "HP DeskJet 3755 Compact All-in-One Wireless Printer - Seagrass Accent (J9V92A) and Ink-Cartridges - 4 Colors",
    "price": 112.88,
    "rating": 4.1,
    "rating_count": 27173,
    "image_url": "https://m.media-amazon.com/images/I/31fUzJeEqJL._AC_.jpg",
    "description": "",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_17",
    "title": "Pelikan 4001 Bottled Ink for Fountain Pens, Royal Blue, 30ml, 1 Each (301010)",
    "price": 6.26,
    "rating": 4.7,
    "rating_count": 19075,
    "image_url": "https://m.media-amazon.com/images/I/41dc9YiRy2L._AC_.jpg",
    "description": "Pelikan 4001 bottled ink for fountain pens, Royal Blue, 30Ml contains an ink formula that was developed over 125 years ago. Ink protects both fountain pen and nib. The bold color ink produces clear line definition with an even flow. For traditional Pelikan fountain pens and many other brands with plunger mechanism and converter. Tip the bottle on its side to fill fountain pen with every drop of ink. Made in Germany. Ink formula developed over 125 years ago protects both fountain pen and nib Bold color ink produces clear line definition with an even flow For traditional Pelikan fountain pens and many other brands with plunger mechanism and converter Tip the bottle on its side to fill fountain pen with every drop of ink Made in Germany",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_18",
    "title": "June Gold 640 Pieces, 0.5 mm 4B Lead Refills, 160 Pieces Per Tube, Fine Thickness, Break Resistant Lead/Graphite (Pack of 4 Dispensers)",
    "price": 5.99,
    "rating": 4.6,
    "rating_count": 17962,
    "image_url": "https://m.media-amazon.com/images/I/51ZJzuND3aL._AC_.jpg",
    "description": "June Gold presents a brilliant and professional set of 0.5 mm lead refills! These bulk lead refills are great for both Schools & Offices . They are a perfect match for any 0.5 mm mechanical pencil. This multi-pack includes the following items and features! Includes: 4 Easy-Use Lead Dispensers 4 Easy-Use Lead Dispensers 160 Lead Refills in Each Dispenser Totalling 640 Refills 160 Lead Refills in Each Dispenser Totalling 640 Refills Features: Industry standard 0.5 mm lead 4B & 60 mm tall - Perfect for any 0.5 mm mechanical pencil Industry standard 0.5 mm lead 4B & 60 mm tall - Perfect for any 0.5 mm mechanical pencil Quality manufacturing allows for uniform, smooth, and long lasting writing Quality manufacturing allows for uniform, smooth, and long lasting writing June Gold's manufacturing process prevents lead breakage June Gold's manufacturing process prevents lead breakage Each dispenser was designed with convenience and simplicity making lead dispensing effortless Each dispenser was designed with convenience and simplicity making lead dispensing effortless Never worry about pencil sharpening again Never worry about pencil sharpening again Click ADD TO CART above to get yours now! Satisfaction Guaranteed or Your Money Back! INCLUDED: 640 graphite lead refills that have a 0.5 mm diameter, 4B hardness, and 60 mm in height. STORAGE: 4 dispensers are included with 160 refills in each dispenser. QUALITY: Our leads are formulated to write uniformly and smoothly for all day writing and breakage resistance. DISPENSER: Each dispenser was designed with consideration for convenience and simplicity resulting in exacting and effortless dispensing. COMPATIBILITY: Our lead works with any brand of 0.5 mm mechanical pencils and especially our June Gold mechanical pencils.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_19",
    "title": "Prismacolor Premier Colored Pencils",
    "price": 39.49,
    "rating": 4.8,
    "rating_count": 14190,
    "image_url": "https://m.media-amazon.com/images/I/51xoaaz7chL._AC_.jpg",
    "description": "Product Description Bring out the soft side of any illustration or art project with Prismacolor Premier Colored Pencils featuring soft cores. Inside the box you’ll find 48 coloring pencils featuring creamy cores that are the artist’s choice for blending, shading, and layering. Prismacolor pencils have pigments of unmatched quality and leads that are strong enough to be sharpened to a precision point. That means you can effortlessly switch between powerful lines, delicate blends, and silky shadowing. From the Manufacturer Designed to handle detailed work for advanced students and artists, these Prismacolor Premier Colored Pencils feature high grade pigments for rich color saturation. Other features include soft, thick cores for superior blending and shading, and a color coded woodcasing for easy identification. The soft cores also resist breaking. Designed with professional artist quality for every level of expertise, these pencils come in an assorted set of 48, and include a convenient tin case. What's in the Box Set of 48 assorted Prismacolor Premier Colored Woodcase Pencils, and tin case. Soft, thick cores are perfect for shading and shadows Lightfast, richly saturated pigments Ultra-smooth, even color laydown Thick, robust leads resist cracking and chipping, making them perfect for adult coloring books 48 premium colored pencils",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_20",
    "title": "Desktop Calculator 12 Digit with Large LCD Display and Sensitive Button, Solar and Battery Dual Power, Standard Function for Office, Home, School, CD-2786 (Pink)",
    "price": 9.99,
    "rating": 4.7,
    "rating_count": 12295,
    "image_url": "https://m.media-amazon.com/images/I/41-xNgjbECL._AC_.jpg",
    "description": "[LARGE DISPLAY] - The huge LCD screen that clearly displays big numbers makes it easy to read from afar, and it’s aesthetically pleasing. [SENSITIVE AND BIG BUTTONS] - Your calculation process will be faster and smoother with this calculator’s responsive buttons. Once pressed, the buttons quickly register and display the corresponding number on the screen. The big size of the buttons prevents you from hitting the wrong button. [DUAL POWER DESIGN] - This calculator utilizes both the solar power and battery power (battery included). The solar panel, as long as you use it in a lit environment, will power up the calculator thoroughly. [VERSATILE PURPOSES] -This calculator is designed for many occasions: business, office, home, basic budgeting, school, and more. Use it to assist your personal finance or just a quick calculation session. [FUNCTIONALITIES] - Add, subtract, multiply, divide, backspace, grand total, CE, %, M+/M-/MRC, On/AC Button, and Auto Power-Off. The calculator will turn itself off after about 6 minutes of being idle.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_21",
    "title": "Amazon Basics Plastic Desk Organizer - Accessory Tray, White",
    "price": 15.92,
    "rating": 4.6,
    "rating_count": 12065,
    "image_url": "https://m.media-amazon.com/images/I/21cxge8YxxL._AC_.jpg",
    "description": "Product Description Amazon Basics Plastic Desk Organizer - Accessory Tray, White From the Manufacturer Amazon Basics Accessory tray helps keep desktop accessories (like a stapler, tape dispenser, and pen holder) neatly contained Made of durable hard plastic for long-lasting reliable strength; available in black or white (each sold separately) Modular design; stackable with the Amazon Basics Plastic Organizer letter tray, accessory tray, half accessory tray, and small tray (additional items sold separately) For use inside a drawer or cabinet or on a desk or shelf Measures 9.4 by 6.7 by 2 inches; backed by an Amazon Basics 1-year limited warranty",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_22",
    "title": "TOWWI Dual Sided Desk Pad, 36\" x 17\" Large Desk Mat, Waterproof Desk Blotter Protector Mouse Pad, Leather Desk Pad Large for Keyboard and Mouse (Red/Blue)",
    "price": 15.99,
    "rating": 4.6,
    "rating_count": 11887,
    "image_url": "https://m.media-amazon.com/images/I/411SUXk03oL._AC_.jpg",
    "description": "【Muti Size Desk Pads】3 size to choose, we have 24\"x14\" small desk mat / 32\"x16” large desk pad / 36”x17” extra large desk pad, which is large enough to accommodate your laptop, mouse and keyboard. Wide surface usage, it can be used as mouse pad, keyboard pad, computer pad and office desk pad. 【Premium Desk Cover Mat】Made of durable PU leather material, TOWWI desk protector can protect your desk from scratches and stains. Soft surface of desktop pad will make you enjoy writing, typing and browsing. 【Dual Side Design】Our desk pads & blotters is designed with the same material but with different colors on each side, 2 sides can be used. Turn it over and you can utilize this desk mouse pad. Let the red desk pad brighten your workplace. 【Easy to Clean and Carry】The waterproof surface can prevent damage from spilled drinks or coffee, it would be the perfect desk protector mat. If you want to clean it, simply wipe its surface with a wet cloth. Each mouse mat has a belt attached,easy for you to take in and take up less space. 【Great Desk Accessories 】Necessary office desk accessories and desk décor for your home/office. It's not only desktop mat, but also computer mat for desk, keyboard mats for desk and large mouse pad for desk.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_23",
    "title": "ITNRSIIET Mouse Pad, Mouse Pad Wrist Support Mousepad with Wrist Rest, Mouse Pads for Wireless Mouse Ergonomic Cute Desk Decor Desk Accessories for Women, Non-Slip PU Base, Abstract Art",
    "price": 9.99,
    "rating": 4.7,
    "rating_count": 13103,
    "image_url": "https://m.media-amazon.com/images/I/41If3tQXYAL._AC_.jpg",
    "description": "ITNRSIIET Aesthetic Mouse Pad - Light up the room and add a touch of art to your office If you work long hours behind a computer screen, then you know very well that wrist fatigue, shoulder and elbow stress are common. With our brand-new Mouse Pad Wrist Rest Support, you can work as long as you want! Unique shape and exquisite illustration make ITNRSIIET mouse pad a elegant decoration, suit for work, game or daily use. add personality to your office desk. Fits all style desk, office, living-room, bedroom. Why You Choose Us: Precisely tracking surface - Allows more accurate and more fast mouse movement, and provides excellent point and click precision. Non-slip PU base and topped with Safety Material - Made from a non-slip PU base and topped with a glossy surface. Environmental protection natural rubber material, no health hazard. Non-toxic, no-smell and safe to use. Natural bend of the wrist - Protecting the wrist joint, reduce the wrist fatigue and pain caused by the long time use of the mouse, and have a good prevention effect for the current popular mouse hand. Crystal clear enamel coating - Features great locking-color effect, ensure no fading or bleeding with the pretty illustration. Waterproof and sweat-proof - Easy to clean with a wipe and can be use at all time. Product Specification: - Size: 8.7 x 7.2 x 0.7 inches / 220 mm x 180 mm x 18 mm  - Weight: 160g / 5.6oz - Material: Non-slip PU base and Lycra silky cloth surface Package Included: 1 × Mouse Pad with Ergonomic Design 100% Satisfactory Service: An easy replacement or full refund is available for you if you are not happy with our product. Press \"ADD TO CART\" Now, Start Enjoying Smooth Mouse Movement and Add a Touch of Art to Your Lifestyle! 【ERGONOMIC DESIGN & SUPERB COMFORT】The soft rebound memory gel-filled cushion keeps hand in natural position, providing maximum comfort for office or home use. It reduces wrist irritation and wrist pain. Keeps your hand in a neutral position for ergonomic comfort.De",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_24",
    "title": "Blank White Permanent Adhesive Labels for Laser/Ink Jet Printer (4\" x 3-1/3\" - 6 Per Page | 300 Labels)",
    "price": 17.99,
    "rating": 4.4,
    "rating_count": 12717,
    "image_url": "https://m.media-amazon.com/images/I/31ZchGBDKnL._AC_.jpg",
    "description": "50 Sheets - 6 Up Labels - Total 300 Labels Bright Matte White Label High Quality Labels with Strong Permanent Adhesive Each Label Size: 4\" x 3-1/3\" - 6 Labels on a 8-1/2 x 11\" Will work with all Laser, Inkjet, Copy Machines and Offset Printers - For a Template of this product, please go to: nextdaylabels Made in the USA by Next Day Labels TM - 100% Guaranteed",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_25",
    "title": "Knodel Desk Mat, Dual-Sided Office Desk Pad, Mouse Pad, Waterproof Desk Mat for Desktop, Desk Pads & Blotters, PU Leather Desk Pad Protector (23.6\" x 13.8\", Black)",
    "price": 9.99,
    "rating": 4.8,
    "rating_count": 11545,
    "image_url": "https://m.media-amazon.com/images/I/41AmeuqKF9L._AC_.jpg",
    "description": "MAXIMUM PROTECTION - Constructed from durable, layered material, it provides a layer of protection between desks and scratches, stains, spills, dents and scuffs. It also gives your office a modern and professional atmosphere when you put it on your desktop. Its smooth surface will make you enjoy writing, typing and browsing, and allows you to freely use your mouse on its surface. DOUBLE-SIDED USE - Made of premium PU leather material with durable construction, the Knodel desk pad is reversible so you can help prolong its lifespan. We designed it with the same material but with different colors on each side. Both sides are durable, comfortable, and slip resistant. So no matter which side you choose, you will receive the same amazing benefits. LARGE MULTIFUNCTIONAL DESK PAD - Size 23.6\" x 13.8\" / 31.5\" x 15.7\" / 35.4\" x 17\", which is large enough to accommodate your laptop, mouse and keyboard. The topside of the mat is slip resistant to help keep your items in place so they stop slipping and sliding around. WATERPROOF & EASY TO CLEAN - Water resistant and heat resistant material makes this product durable and easy to clean. You can easily wipe away spills without worry of stains. ONE YEAR WARRANTY - We are dedicated to providing our customers with high quality products and superior service. All of our Knodel desk pads come with a one year warranty. If you are dissatisfied with our product, we can offer you a new one or 100% money back. So, what are you waiting for? Get one risk-free by adding this item to your cart NOW!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_26",
    "title": "BIC Cristal Fun Ballpoint Pens Wide Point (1.6 mm) – Lime Green, Box of 20",
    "price": 7.99,
    "rating": 4.7,
    "rating_count": 12511,
    "image_url": "https://m.media-amazon.com/images/I/51MkBKd4XcL._AC_.jpg",
    "description": "BIC Cristal Fun is a large-point ballpoint pen in a range of exciting colours, making your school work much more stylish! Available in lime-green, they make it easier than ever to organise your workload and bring some personality to the page. With cap and end plugs that match the ink itself, it's quick and easy to find the colour you need! A smoked barrel also allows you to see when the ink level is running low. Make a thicker more intense impression with the wide 1.6 mm tip. Writing has never been so full of life and colour Quick and easy notetaking with this ballpoint pen’s perfectly round ball for flawless ink flow Features BIC's legendary hexagonal barrel. Simple, functional, iconic design. Maximum efficiency Caps and tops match the colour of the ink, so you can find the right one in the blink of an eye A new twist on a timeless classic. The BIC Cristal Fun pen comes in an eye-catching lime green to brighten up your notebook. The box of 20 ball pens in this colour will keep you going for a while! A pen that has stood the test of time. French entrepreneur Marcel Bich started a writing revolution in 1950 when he introduced the first BIC Cristal ballpoint pen. Now called the BIC Cristal Original, it offered fast smudge-free writing. His invention offered an unbeatable trio: a point, a perfectly spherical ball, and high-quality ink manufactured in the BIC plants. Since then, BIC has been tirelessly improving the BIC Cristal pen. Over the years, the pen has gradually been made lighter and the ink is always being perfected for writing with an ever-gentler touch. A ubiquitous object known and loved by all, for decades the BIC Cristal ballpoint pen has been an everyday part of life for countless people in every field from business to art. It is even part of the permanent collection at the Musée d'Art Moderne/Pompidou Centre in Paris and the New York Museum of Modern Art (MoMA) where visitors still marvel at its timeless design. Because only BIC is as good as BIC.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_27",
    "title": "Clever Fox Planner – Undated Weekly & Monthly Planner to Increase Productivity, Time Management and Hit Your Goals – Organizer, Gratitude Journal – Start Anytime, A5, Lasts 1 Year, Silver Black (Weekly)",
    "price": 24.99,
    "rating": 4.7,
    "rating_count": 12592,
    "image_url": "https://m.media-amazon.com/images/I/51SYKQ13StL._AC_.jpg",
    "description": "✓ GET ORGANIZED & ACHIEVE YOUR GOALS - Clever Fox Planner will help you create a vision for your life, define and break down your short and long-term goals in each area of your life, and incorporate these goals into your monthly, weekly, and daily agenda. There is no going back. Stop procrastinating and start turning your big dreams into reality! ✓ STAY FOCUSED & INCREASE PRODUCTIVITY - At Clever Fox, we needed a system to stay focused, track our goals and help us increase our performance and overall quality of life. This planner organizer is a perfect solution if you are looking to significantly boost your productivity and hit your goals. It will also help you feel happier and more fulfilled using proven self-development tools and positive psychology techniques. You are just a few days away from feeling the difference! ✓ FREE QUICK START GUIDE & STICKERS - This planner and organizer for women and men comes with a detailed step-by-step illustrated user guide for a quick start, unlike other planners that will leave you wondering how to use them after the purchase. It also comes with 150 colorful planner stickers and in a premium gift box keepsake packaging. There is absolutely no reason for you to look any further. Clever Fox planner is guaranteed to work, or we will give you your money back! ✓ UNDATED & UNIQUE LAYOUTS - An important feature of this planner is that it is undated; so, unlike most dated planners, you can start using it at any time of the year without wasting a page - it’s totally up to you to fill in the months and dates. That is why by design all 12 months come right up front and are then followed by the separate 52 weeks. Use 3 colorful ribbons to flip between weekly and monthly spreads. ✓ GUARANTEE & RETURNS - Clever Fox goal setting planner is guaranteed to work, or we will give you your money back no questions asked! We will exchange or refund your item asap if you're having ANY TYPE of quality issues or if for any reason you’re not completely sat",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_28",
    "title": "STABILO Handwriting Pen EASYoriginal metallic - Right-Handed - neon blue/metallic",
    "price": 15.98,
    "rating": 4.7,
    "rating_count": 9423,
    "image_url": "https://m.media-amazon.com/images/I/41OfDcKFusL._AC_.jpg",
    "description": "Product Description STABILO EASYoriginal metallic ergonomic rollerball pen is a handwriting pen approved by UK teachers which is specially designed for left or right handers and is a must-have for every pencil case. It's ideal for learning to write with, with its moulded grip zone and slightly arched shape it helps young hands learn how to hold the pen correctly. The STABILO EASYoriginal handwriting pen makes writing relaxed and prevents muscles from tiring so that all school children can really enjoy learning to write without any cramps. The elegant and comfortable rollerball, glides easily over paper and with its sturdy nib means that it will not break or bend under pressure, nor will it get scratchy or blot. What's more, each refill (sold separately) comes with a brand nib, meaning the handwriting pen always stays fresh. Set Contains: STABILO EASYoriginal metallic right handed blue - Ergonomic Rollerball The STABILO EASYoriginal metallic is the first ergonomic rollerball specially designed for left or right handers Comfortable hold for small hands thanks to the ergonomic grip zone made from non-slip material Relaxed hand posture prevents premature muscle fatigue and writing pain Easy smooth handwriting without blots or scratches thanks to the rollerball technology Easy to refill with STABILO EASYoriginal cartridges available in a fine or medium tip  - sold separately Refills available in royal blue erasable ink which are suitable for school and black, or red ink – sold separately Space for a name on the pen The official pen licence pen Approved by UK teachers for handwriting in school",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_29",
    "title": "Cross Classic Century Refillable Ballpoint Pen, Medium Ballpen, Includes Premium Gift Box - Hallmarked Sterling Silver",
    "price": 234.0,
    "rating": 4.6,
    "rating_count": 11484,
    "image_url": "https://m.media-amazon.com/images/I/31GsrW+IOYL._AC_.jpg",
    "description": "Product Description The Cross brand was founded by jewelry makers and artisans of usable luxury, and is the longest-standing company crafting fine writing instruments in the Western world. Today's luxury collection is the culmination of this pursuit. It includes four iconic Cross designs in precious metals like silver, gold and platinum as well as beautiful details like inset precious stones. This unique and timeless collection is recognized by its 'x' Authenticity mark. There is no better way to express yourself and make your mark. From the Manufacturer An heirloom-in-waiting, and a pen that will change the way you feel about writing. The impeccable Classic Century Sterling Silver Ball-Point Pen features the sophistication of hallmarked sterling silver, with silver plated appointments. Sterling silver ball-point pen with classically elegant styling for a smooth, elegant writing experience Trademark conical tip Patented propel-repel ball pen mechanism Manufacturer's lifetime mechanical guarantee Includes 1 Black Medium Ball-Point Refill (8513) in pen",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_30",
    "title": "SAKURA - 37488 Gelly Roll Classic 08 (Medium Pt.) 3 Pack Pen, White",
    "price": 7.98,
    "rating": 4.6,
    "rating_count": 9653,
    "image_url": "https://m.media-amazon.com/images/I/41SRr1tXhaL._AC_.jpg",
    "description": "Gelly roll gel ink pen that was invented to make writing and self expression effortless. The creamy ink and incredible array of colors provide plenty of favorite flavors for letting your thoughts flow onto paper. Handwriting is as unique as a fingerprint. Sign your name, doodle, express your artful self, or celebrate the thrills and document the spills of your life. Leave a mark that will last a lifetime. Sakura color products invented and patented gel ink and the pen casing used to create gelly roll pens. The first of its kind, these gelly roll pens created the gel ink pen category within the writing instrument industry. The gelly roll pen collection has grown to provide a wide variety of colors to support the company’s motto power to express. Black, blue, royal blue, purple, and burgundy ink colors are excellent for writing checks due to the gel ink’s resistance to fraudulent washings. Do not underestimate the extraordinary value of a handwritten note. Anyone can have fun, create art, write in scrapbooks and journals, sign documents, daydream and doodle with any of the assorted colors from the collection of gelly roll pens. Applicable for almost any permanent writing application. Journals and scrapbooks. Letters, notes and memos. Legal documents. Recipes and grocery lists. Technical qualities are archival quality ink, consistent ink flow to the last stroke, will not smear or feather when dry, waterproof and chemical proof, fade resistant, does not bleed through most papers, meets astm and acmi nontoxicity standard ap seal, not recommended for use on fabrics intended to be washed, on food service or ceramics that are washed, and not evaluated for cosmetic use on skin. Available in white color. 0.8mm Point Size for Medium Writing Bright, White opaque ink ideal for dark or colored paper Pack contains 3 Each Gelly Roll White 08 (Medium) Gelly Roll Classic White is available in 05 (fine), 08 (medium), 10 (bold)",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_31",
    "title": "Kensington Duo Gel Mouse Pad with Wrist Rest - Gray (K62399US), Grey",
    "price": 18.92,
    "rating": 4.6,
    "rating_count": 9965,
    "image_url": "https://m.media-amazon.com/images/I/41+nQ-5fqKL._AC_.jpg",
    "description": "When you spend long hours in your home office navigating forms, creating engaging presentations, or managing complex spreadsheets, you need a workspace that goes beyond being merely functional. From the trusted industry leader with 20 years of ergonomic expertise, the Duo Gel Mouse Pad combines a rigid base for fast and accurate mouse movement with a wrist rest that conforms to the natural contours of your hand and wrist to minimize pressure. Since you shouldn’t have to sacrifice style for comfort, the duo-tone colors can complement your home office décor. Gel pillow matches natural curve of wrist and hand for comfortable typing Ventilation channel helps keep hands cool and dry Duo-tone color combination Soft finish that’s easy to wipe clean TAA Compliant",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_32",
    "title": "KYODOLED Cash Box with Combination Lock,Safe Metal Box for Money,Storage Lock Box with Money Tray,7.87\"x 6.30\"x 3.54\" Limegreen Medium",
    "price": 14.5,
    "rating": 4.4,
    "rating_count": 9321,
    "image_url": "https://m.media-amazon.com/images/I/31dTdswQo0L._AC_.jpg",
    "description": "DURABLE AND UNBREAKABLE: The cash boxe is unbreakable in our daily life due to strong metal material. Besides, the inner removable money tray is so sturdy built that you have no reason to worry about the security of your items. ADVANCED COMBINATION LOCK: The locking device consists of a 3-number combination lock ,which contributes to protect your valuables.It is unnecessary for you to be afraid of losing your keys results from the well-designed code system, which can be simply set or changed. REMOVABLE MONEY TRAY: The inner cash tray of the storage box is made up with five compartments, so your cash, coins and keys are able to be accepted separately. Besides, there is huge space for you to take care of checks, receipts and valuables at the bottom of the box. WIDE MULTIPURPOSE APPLICATION: The locking cash box is capable of varied occasions. No matter where you are, for instance, school, office, factory, supermarket and anywhere else, the lock box could actually breathe new life into your lifestyle. SIZE AND COLOR: Money boxes with slot size is 7.87\"x 6.30\"x 3.54\" (200*160*90mm). Color is Limegreen ,cute and fashionable.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_33",
    "title": "BIC Round Stic Xtra Life Ballpoint Pen, Medium Point (1.0mm), Blue, 12-Count",
    "price": 3.85,
    "rating": 4.7,
    "rating_count": 10783,
    "image_url": "https://m.media-amazon.com/images/I/512IXqQmSBL._AC_.jpg",
    "description": "The BIC Round Stic Xtra Life Ballpoint Pen is a dependable favorite that offers performance and value, making it the #1 selling Ballpoint Pen in the US*. Great for daily use at home, school, or the office, this pen writes 90% longer on average than Papermate InkJoy 100 Ball Stick Pen.** It features a versatile 1.0mm medium point that creates vivid lines and has a reliable tungsten carbide ball point that spreads the ink smoothly and evenly, making this pen ideal for a variety of writing applications from note-taking to doodling. The flexible round barrel rests comfortably in your hand, while the translucent barrel shows the remaining ink supply, so you know when you're running low. BIC Round Stic Xtra Life Ballpoint Pens are non-refillable. *Source: The NPD Group/ Retail Tracking Service/ U.S. Actual Unit Sales (Retail & Commercial Combined)/ Jul 2016-Jun 2017 ** Paper Mate and InkJoy are trademarks of Newell or an affiliate. Newell has not sponsored or approved and is not affiliated with this BIC branded product. Number 1 Selling Ball Pen. Source: The NPD Group/ Retail Tracking Service/ U.S. Actual Unit Sales (Retail & Commercial Combined)/ Jul 2016-Jun 2017 Writes 90% longer on average than Papermate InkJoy 100 Ball Stick Pen (Paper Mate and InkJoy are trademarks of Newell or an affiliate. Newell has not sponsored or approved and is not affiliated with this BIC branded product.) Flexible round barrel for writing comfort Reliable tungsten carbide ball spreads ink smoothly and consistently Translucent barrel shows the ink level",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_34",
    "title": "SITHON Remote Control Holder with 5 Compartments - PU Leather Remote Caddy Desktop Organizer Store TV, DVD, Blu-Ray, Media Player, Heater Controllers, Black",
    "price": 12.99,
    "rating": 4.7,
    "rating_count": 10264,
    "image_url": "https://m.media-amazon.com/images/I/411tDnRX+KL._AC_.jpg",
    "description": "A perfect solution to storage various remote controllers for cable box, Roku, Apple TV, Amazon Fire TV, soundbars.etc. Product size: 7.87\"(L) x 2.75\"(W) x 3.93\"(H) Ideal for keeping all your favorite remotes close at hand and easily identifiable. Save time and stress and space saving. Crafted with premium PU leather with soft lining interior for lasting performance. Provides protection for the remote against scratches, greasy dirt and abrasions. Widely application great for table, restroom, dining room, living room, study room, bedroom, nightstand and office uses Multi-functional usage with 5 compartments. Can be used as stationeries, glasses, cell phones or cosmetics brushes storage solution. Great gift for women, men, adults, teen girls and boys on valentine’s day, birthday, thanksgiving, christmas or any other anniversary.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_35",
    "title": "Swingline Staples, Optima, High Capacity, 3/8\" Length, Jam Free, 125/Strip, 2500/Box, 1 Box (35550)",
    "price": 5.98,
    "rating": 4.7,
    "rating_count": 10611,
    "image_url": "https://m.media-amazon.com/images/I/41RCdDjjykL._AC_.jpg",
    "description": "Trust Swingline Optima High Capacity Staples to provide steady, dependable stapling. these staples ensure superior quality and service. Designed with precision-engineered chisel points that cleanly pierce paper every time. Longer, 3/8” legs securely fasten up to 70 sheets of paper, nearly 3 times the holding capacity of standard staples. Each full strip contains 125 staples, for easy continuous stapling without the need to stop for frequent refills. Each reusable storage box contains 2,500 staples, ensuring long-term productivity with fewer run-outs. ) and 70-sheet (ITEM #) staplers. SHARP CHISEL POINT PREVENTS JAMS – Optima staples are designed with precision-engineered points that cleanly pierce paper every time. Perfect performance without frustrating jams or interruptions. SECURES 70 SHEETS OF PAPER – Strong staples with longer, 3/8” legs securely hold up to 70 sheets of paper, which is almost 3 times the number of pages held by standard staples. 2,500 STAPLES - Each strip has 125 staples, allowing you to keep stapling steadily. Each reusable storage box contains 2,500 staples, for long-term productivity with easy refills and fewer run-outs.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_36",
    "title": "EXPO Vis-a-Vis Wet Erase Markers, Fine Point, Assorted Colors, 8 Count",
    "price": 9.97,
    "rating": 4.7,
    "rating_count": 10487,
    "image_url": "https://m.media-amazon.com/images/I/51LLJYo0QXL._AC_.jpg",
    "description": "Product Description Label, plan, and organize with ease with EXPO Vis-a-Vis Wet Erase Markers. Depend on EXPO wet erase markers for writing or drawing on whiteboards, hard plastic, laminated sheets, and other nonporous surfaces. These EXPO markers feature ink that easily wipes off with a damp cloth. Available in a variety of vibrant colors, the fine-tip markers leave fine detailed lines even in small spaces. From the Manufacturer Vis-A-Vis Wet-Erase Marker is ideal for use on whiteboards and erasable calendars. Use to mark laminated activity books, cards, placemats and storage totes or to track projects. Certified AP nontoxic ink is fade-resistant and bubble-resistant under intense lamp heat. Marker ink wipes off easily from nonporous surfaces with a damp cloth. EXPO Vis-a-Vis wet erase markers that easily wipe off with a damp cloth For use with whiteboards, hard plastic, laminated sheets, and other nonporous surfaces Works great on calendar dry erase boards, plastic bins and dry food storage containers Fine tip for detailed lines that stand out Includes 8 assorted dry erase markers: black, brown, blue, red, yellow, orange, purple, and green",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_37",
    "title": "AFRITEE Desk Pad Protector Mat - Dual Side PU Leather Desk Mat Large Mouse Pad Waterproof Desk Organizers Office Home Table Decor Gaming Writing Mat Smooth (Purple/Pink, 23.6\" x 13.8\")",
    "price": 9.99,
    "rating": 4.7,
    "rating_count": 9545,
    "image_url": "https://m.media-amazon.com/images/I/41u91BP32CL._AC_.jpg",
    "description": "🔹PREMIUM LEATHER DESK PROTECTOR: Made of durable PU leather material, AFRITEE desk pad protects your glass/wooden desktop from scratches, stains, spills, heat, and abrasions. The upgraded desk mat is more durable and fashionable than an ordinary desk protector, which can keep your desk tidy and clean and boost your productivity. 🔹DOUBLE-SIDED USE & GREAT ORGANIZER: 9 different color-match office decor mats are available. Choose your color to decor your desk. The specially designed pad has the same material but different colors on each side. 2 sides can be used as mouse pads and writing pads. Come with a strap to roll up the desk pad, which is very easy to store and carry. 🔹WATERPROOF DESK BLOTTER PAD: Water-resistant and heat-resistant material makes this desk cover durable and easy to clean. If you want to clean this desk mouse pad, just wipe its surface with a wet cloth. Odorless and high-quality synthetic leather adds elegance and brings a modern and professional atmosphere to your workspace. 🔹MULTI-PURPOSE DESK PAD: 2 sizes to choose from. 31.5”x15.7\" is perfect to hold your mouse, keyboard, PC, iPad, small office tools. 35.4\"x17\" is perfect to hold your mouse, keyboard, Computer, iPad, office tools, and other desk items. The soft and non-slip surface of the table mat allows you to enjoy writing, typing, and browsing. 🔹AFRITEE SERVICE: We are committed to providing customers with high-quality products and customer service. The table mat is exquisite and durable, suitable for use in the office or at home, and can also be used as a gift. If you are not satisfied with our products or have any questions, we can provide you with a refund or compensation to give you a happy shopping experience.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_38",
    "title": "ITNRSIIET Mouse Pad, Ergonomic Mouse Pad with Gel Wrist Rest Support, Gaming Mouse Pad with Lycra Cloth, Non-Slip PU Base for Computer, Laptop, Home, Office & Travel, Sunrise",
    "price": 9.99,
    "rating": 4.7,
    "rating_count": 10179,
    "image_url": "https://m.media-amazon.com/images/I/51dhr5w2-ZL._AC_.jpg",
    "description": "ITNRSIIET Aesthetic Mouse Pad - Light up the room and add a touch of art to your office If you work long hours behind a computer screen, then you know very well that wrist fatigue, shoulder and elbow stress are common. With our brand-new Mouse Pad Wrist Rest Support, you can work as long as you want! Unique shape and exquisite illustration make ITNRSIIET mouse pad a elegant decoration, suit for work, game or daily use. add personality to your office desk. Fits all style desk, office, living-room, bedroom. Why You Choose Us: Precisely tracking surface - Allows more accurate and more fast mouse movement, and provides excellent point and click precision. Non-slip PU base and topped with Safety Material - Made from a non-slip PU base and topped with a glossy surface. Environmental protection natural rubber material, no health hazard. Non-toxic, no-smell and safe to use. Natural bend of the wrist - Protecting the wrist joint, reduce the wrist fatigue and pain caused by the long time use of the mouse, and have a good prevention effect for the current popular mouse hand. Crystal clear enamel coating - Features great locking-color effect, ensure no fading or bleeding with the pretty illustration. Waterproof and sweat-proof - Easy to clean with a wipe and can be use at all time. Product Specification: - Size: 8.7 x 7.2 x 0.7 inches / 220 mm x 180 mm x 18 mm  - Weight: 160g / 5.6oz - Material: Non-slip PU base and Lycra silky cloth surface Package Included: 1 × Mouse Pad with Ergonomic Design 100% Satisfactory Service: An easy replacement or full refund is available for you if you are not happy with our product. Press \"ADD TO CART\" Now, Start Enjoying Smooth Mouse Movement and Add a Touch of Art to Your Lifestyle! 【ERGONOMIC DESIGN & SUPERB COMFORT】The soft rebound memory gel-filled cushion keeps hand in natural position, providing maximum comfort for office or home use. It reduces wrist irritation and wrist pain. Keeps your hand in a neutral position for ergonomic comfort.De",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_39",
    "title": "Staedtler Double Hole Pencil Sharpener, Two Holes for Standard Pencils, Large Colored Pencils, and Makeup Pencils, 512 006",
    "price": 5.3,
    "rating": 4.6,
    "rating_count": 10975,
    "image_url": "https://m.media-amazon.com/images/I/411R8pp1JsL._AC_.jpg",
    "description": "Manual, handheld sharpener with one small hole to produce precision tip pencils and one large hole to accommodate oversize pencils and crayons. Hinged cover on sharpener helps keep blades clean, while the pushbutton locking lid on the shavings container prevents spilling. The perfect compact pencil sharpener for colored pencils, for large pencils, for regular pencils - the 2 holes accommodate a multitude of different sizes Makes an excellent makeup pencil sharpener. Keep your eyebrow pencil or lip liner in tip-top shape ready for your close-up No plugs needed - keep this little hand held pencil sharpener in a pencil case, desk drawer, makeup bag or toted in your kid's school backpack You'll never have a dull moment in the office, at school, or around the house when you have a versatile dual diameter pencil sharpener",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_40",
    "title": "Tribe RN Nursing Clipboard with Storage - Medical Clipboard Nursing Essentials for Nurses and Nursing Students School Supplies with Quick Access Reference Guide (Purple)",
    "price": 16.97,
    "rating": 4.6,
    "rating_count": 8461,
    "image_url": "https://m.media-amazon.com/images/I/41jcIRyASvL._AC_.jpg",
    "description": "Tribe RN nurse clipboard features 1\" storage for all your nursing essentials. Features a pen holder and can store up to 200 letter-sized documents. Keep your reports HIPAA compliant and your pockets light. Our clipboards are must-have nursing student essentials and feature a color-coded cheat sheet to give you quick access to the vital information you need plus lifetime access to our exclusive online resource library. Tribe RN is the leading brand for nursing school supplies. Our clipboard comes with access to downloadable cheat sheet PDFs that are perfect to keep on your phone, print out, or use to study for NCLEX! We provide all your nursing clinical essentials; our cheat sheet downloads include two General Med, Hematology, Labs, Medical Spanish, Newborn, NICU, OB/L&D, Pediatrics, Pharmacy, Respiratory References, and more! (See insert card for details.) Essential nursing accessories designed to maximize storage space while still being sleek. Our clipboard is easy to take with you to your next shift or clinical rounds so you are never caught off guard!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_41",
    "title": "Duck Brand Stretch Wrap Roll, Clear, 5 inches by 1000 feet, 1 pack, 285849 , White",
    "price": 8.66,
    "rating": 4.7,
    "rating_count": 9263,
    "image_url": "https://m.media-amazon.com/images/I/318enUQZuKL._AC_.jpg",
    "description": "When your belongings are on the move, secure items together so things stay put, don’t get lost and stay protected. Duck Brand stretch wrap is perfect for storage or shipping and it sticks to itself without leaving any messy residue when it’s time to unpack. Great for wrapping remote controls to TVs; securing cabinet doors and dresser drawers closed; keeping hardware attached to Bed frames; protecting plush furniture from dust or stains; and shielding surfaces or furniture legs from scratches, scuffs and damage. Just stretch, wrap and relax-your belongings are sure to arrive right where you left them, No stress. Convenient handle provides easy application Plastic stretch film sticks to itself, and is easy to remove without residue after use Clear non-adhesive plastic wrap secures and bundles Items Perfect for storage, moving or shipping Each roll contains 5 inches by 1000 feet of plastic stretch film",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_42",
    "title": "Montblanc Ballpoint Pen Refills (B) Royal Blue 124491 – Refill Cartridges with a Broad Tip for Montblanc Ball Pens – 2 x Blue Ballpoint Refills",
    "price": 30.69,
    "rating": 4.6,
    "rating_count": 6697,
    "image_url": "https://m.media-amazon.com/images/I/41RgWljfToL._AC_.jpg",
    "description": "Montblanc Ballpoint Pen Refills (B) Pacific Blue The Montblanc Ballpoint Pen Refills are the perfect choice for all Montblanc ballpoint pens except for the Meisterstück Hommage à W.A. Mozart.The Pacific Blue color creates intensity and mesmerization on paper for a sophisticated and elegant look. The soft tip that does not scratch,smear, or stick, and is quick-drying for clear and neat handwriting. The pen refills are long-lasting and evenly distribute their intense blue color. Ident. number: 116214 Ident. number: 116214 Refill type: Ballpoint Pen Refill type: Ballpoint Pen Size: B = Broad Size: B = Broad Color: Pacific Blue Color: Pacific Blue Packing unit: 2 refills Packing unit: 2 refills Montblanc traditional craftsmanship: Montblanc is one of the world's leading brands of luxury writing instruments, watches, jewellery, leather goods, fragrances, and eyewear. Forover 100 years, Montblanc has been a synonym for the very highest writing culture. The white star emblem represents the snow-covered peakof Mont Blanc – the highest European mountain, symbolizing the brand’s commitment to the highest quality and finest craftsmanship. Eachindividual product represents Montblanc's long tradition of fine craftsmanship and its appreciation for the need to take time for the essentials.As modern life develops at a quickening pace, these values take on a new and greater significance, and Montblanc's products will help in sharingthese experiences. The high-quality ballpoint pen refills by Montblanc provide a smooth and consistent ink flow for a superb writing experience - with a broad tip for intense lines on paper The refill ink does not smear and is quick-drying - an excellent choice for left-handers / The soft tip does not scrape and is perfect for writing on precious paper The Royal Blue color stands for respectability and intriguing creations - ideal for executive business, official letters, and noting down vibrant stories The navy blue ball point refills fit all Montblanc b",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_43",
    "title": "Smead Colored Hanging File Folder with Tab, 1/5-Cut Adjustable Tab, Letter Size, Orange, 25 per Box (64065)",
    "price": 23.91,
    "rating": 4.8,
    "rating_count": 7264,
    "image_url": "https://m.media-amazon.com/images/I/3197g7UsHRL._AC_.jpg",
    "description": "If it’s worth hanging on to, it deserves a Smead hanging file. Hanging file folders are the most popular way to keep papers organized in desk drawers, file cabinets and file boxes. Available in 17 bright colors, Smead’s Colored Hanging File Folders are the perfect choice for organizing and color-coding different types of files to save you time and frustration. Each letter size hanging file folder in this 25-pack features a 1/5-cut repositionable poly tab and coated rod tips that slide easily in file drawers for hassle-free organizing and improved access to documents. The clear poly tabs have replaceable white tab inserts and can be positioned in several locations on the front or back panel, making it easy to find the file you are looking for and create a customized filing system. Proudly made in the USA, these 11 pt. stock hanging file folders contain 10% recycled content, 10% post-consumer material and are SFI Sourcing Certified. This set includes 25 letter size hanging file folders (11-3/4\" W x 9-1/4\" H exclusive of rods and tabs) in a vivid orange color—use them with colored interior folders (sold separately) to prevent misfiling and add the Viewables Premium 3D Hanging Folder Tabs and Labels (64905, sold separately) to turn your filing mess into a filing masterpiece. Includes 25 letter size hanging file folders (11-3/4\" W x 9-1/4\" H exclusive of rods and tabs) that keep your papers neatly upright in desk drawers and file cabinets Each hanging folder features a 1/5-cut repositionable poly tab and coated rod tips that slide easily in file drawers for hassle-free organizing and access to documents The clear poly tabs have replaceable white tab inserts and can be positioned in several locations on the front or back panel so you can create a customized filing system Proudly made in the USA, these 11 pt. colored stock hanging file folders contain 10% recycled content, 10% post-consumer material and are SFI Sourcing Certified Organize different types of files by color-",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_44",
    "title": "EnerGel-X Retractable Liquid Gel Pen, (0.7mm) Metal Tip, Medium Line, Violet Ink",
    "price": 16.72,
    "rating": 4.8,
    "rating_count": 8883,
    "image_url": "https://m.media-amazon.com/images/I/41mmeppxJ+L._AC_.jpg",
    "description": "EnerGel-X Roller Gel Pen The EnerGel family of liquid gel pens offers a variety of choices from retractable to capped, fine point to bold, several barrel styles, and a wide selection of vibrant ink colors. With so many options, you're sure to find an EnerGel pen that matches your style. EnerGel-X pens come with either black, red, blue, green, orange, pink, sky blue, or violet ink. However, they can be refilled with any EnerGel refill available in a variety of other vibrant colors to match your mood and keep your writing instrument unique to you. Quick Drying Ink EnerGel ink dries super fast, which is why left-handed writers love EnerGel -- No Smears, No Smudges, No Globs. High-Tech Smoothness EnerGel liquid gel ink is a high performance ink technology that combines the best qualities of liquid and gel ink for a super smooth writing experience. Liquid ink characteristics provide an easy flowing ink supply, while gel ink characteristics include smoothness of writing, vibrant colors and fast-drying capability. Refillable Don't toss out your pens! Did you know that over 90% of EnerGel products are refillable? Why throw away your pen and contribute to landfills when you can replace your depleted ink cartridge with any size and/or color EnerGel refill. Help the environment while saving money! Be Bold ... or Medium, or Fine Fine line widths are achieved with our 0.5mm needle tip pens Fine line widths are achieved with our 0.5mm needle tip pens Medium lines are achieved with our 0.7mm needle and 0.7mm metal tip pens Medium lines are achieved with our 0.7mm needle and 0.7mm metal tip pens Bold lines are achieved with our 1.0mm metal tip pens Bold lines are achieved with our 1.0mm metal tip pens Recycology Pentel has been committed to protecting the environment for over 40 years. We developed the Pentel Recycology program to further our efforts to minimize our carbon footprint and help save the planet. Over 75% of our products use recycled content, including factory recycled ",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_45",
    "title": "RUSPEPA Poly Mailer Shipping Bag with Self Sealing, Business Text Printed Design, 100 Pack 6 x 9 inches, Pink",
    "price": 11.99,
    "rating": 4.9,
    "rating_count": 5568,
    "image_url": "https://m.media-amazon.com/images/I/31lwMS5IOKS._AC_.jpg",
    "description": "Size: Pack of 100 pcs of 6 x 9 inches poly mailers, suitable for the dress shirt, napkin set, yard, etc Business Design: These poly mailers with the text \" hello. I'm what you've been waiting for\" in different colors, black, pink, white and mint Thickness: Each poly envelope is 2.3 Mil thick, durable and tear-proof, provide maximum protection, a favorable image, and postage savings Self-Sealing: Self adhesive seal strip - easily close and ship your envelopes, no licking or water needed, tamper-evident, and super secure closure Features: Heavy-duty polyethylene make these envelopes highly resistant to water, dark inner lining for complete privacy while your items are in transit",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_46",
    "title": "Wordsworth & Black Fountain Pen Set, Medium Nib, Includes 6 Ink Cartridges and Ink Refill Converter, Gift Case, Journaling, Calligraphy, Smooth Writing Pens [Black Gold], Perfect for Men and Women",
    "price": 29.9,
    "rating": 4.5,
    "rating_count": 8162,
    "image_url": "https://m.media-amazon.com/images/I/41z4XcDjqLL._AC_.jpg",
    "description": "✒️Elegant And Beauty, Made To Impress Everyon - Beautifully balanced metallic design adds a touch of modern class to your daily routine. It gives high precision and exceptional writing comfort for every occasion, coupled with a gorgeous design. Pulled directly from our Erudite Collection, we've combined the weight of superior metals perfectly weighted and balanced for a premium writing experience. This refillable modern fountain pen delivers refined style and an exceptionally smooth writing. ✒️Express Yourself Through Effortless Writing - Built to offer a delicate weight that is perfect for both left and right handed writers, this fountain pen set will be your best writing tool that you carry around and bring with you everywhere. With the smooth lines, consistent flow, your lines will always glide across the page whether it is notes in your agenda or doodles on the side of a page. With zero ink leakage and cap cover, this is the perfect writer's pen. ✒️Discover The All-inclusive Refillable Fountain Pen Set - Includes luxurious fountain pen, ink converter, 3 x blue ink cartridges, 3 x black ink cartridges, premium leather pen case, and a deluxe gift box - ready to be gifted. Included with every order is a complete instruction booklet for your Wordsworth and Black Pen Set. All the information you'll need to get started using and enjoying your luxurious writing tool will be right at your fingertips! ✒️An Exquisite Gift Choice - Fountain pens are a classy gift for new and advanced professionals, managers, and executives in every industry. A luxurious gift pen case, it makes an amazing gift for yourself, your family or absolutely anyone else. Don't forget, every calligraphy pen comes with FREE ink cartridges to get you flowing right out of the box. ✒️Guaranteed - All our fountain pen ink are tested for both balance and a no-spill experience to guarantee a comfortable and consistent ink flow. Best of all, your purchase is protected by a full satisfaction guarantee. If you",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_47",
    "title": "PACKZON Shipping Labels with Self Adhesive, Square Corner, for Laser & Inkjet Printers, 8.5 x 5.5 Inches, White, (2000 Labels)",
    "price": 106.99,
    "rating": 4.8,
    "rating_count": 8284,
    "image_url": "https://m.media-amazon.com/images/I/21CElpbimjL._AC_.jpg",
    "description": "Smudge and jam-free guaranteed. Premium quality. Made in USA Sheets per case: 1000 | Labels per case: 2000 | Labels size : 8-1/2\" x 5-13/32\" / Square corner. 1/8\" gap in the middle. Paper size: 8.5\" x 11\" US letter size. Dimensions tolerances are ±0.5-1.5% Labels are made from high quality 3.2 mil face white paper for sharper print quality. Use for multifunctional information labeling. Designed for ink-jet and laser printers and Printing & copiers. Adhesive type : Strong permanent adhesive. Service temperature minimum -4℉, maximum 248℉",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_48",
    "title": "Roaring Spring Enviroshades Recycled Colored Legal Pads, 3 Pack, 8.5\" x 11.75\" 40 Perforated Sheets, Orchid (Purple), Blue, Green",
    "price": 12.89,
    "rating": 4.8,
    "rating_count": 6244,
    "image_url": "https://m.media-amazon.com/images/I/41oSmTnO-HL._AC_.jpg",
    "description": "Founded in 1887 by D.M. Bare, Roaring Spring Paper Products has been an integral part of the Roaring Spring community for more that 130 years. Employing over 200 people, the company prides itself on remaining a family-owned, American small business. Assorted color legal pads. Smooth, 15# writing paper has legal ruled blue lines and double red margin lines. Sheets are micro-perforated for EZ removal. Paper is recycled, containing a minimum of 30% post-consumer content. 34 pt. chipboard backs add stability. Each pack contains 3 pads, 1 each of purple, blue, green. Stapled and taped construction. Full sheet size is 8.5\" x 11.75\", and tear-out size is 8.5\" x 11\". 40 sheets in each pad. 3 pack of Legal Pads - includes one of each: orchid / purple, blue, green Full sheet size is 8.5″ x 11.75″, and tear-out size is 8.5″ x 11″. 40 sheets in each pad Made with recycled paper that is produced with a minimum of 30% post-consumer content Smooth, 15# recycled writing paper has legal ruled blue lines and double red margin lines, micro-perforated for EZ removal. 36 pt chipboard back adds stability",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "office_products_49",
    "title": "Fengtaiyuan 07P18, Gel Ink Rollerball Pens, Black Ink, Fine Point, 18 Pack, Writing Smooth, Cool Pens (0.7mm-Black-18Pack)",
    "price": 19.99,
    "rating": 4.3,
    "rating_count": 6639,
    "image_url": "https://m.media-amazon.com/images/I/51fMxV2W24L._AC_.jpg",
    "description": "The neutral pen uses high quality ink, stable quality, and will not spill ink when dry and not faint when exposed to water. At the same time, the ink viscosity is just good, quick dry and not easy to penetrate the paper It can reuse the universal refill. The pen uses a 0.7mm bulleted head, and the writing is smooth, reliable and durable, and the use time is long The pen holder is ergonomically designed to be comfortable, while the pen holder is coated with glue, which does not affect writing due to hand sweat Gold metal accessories, more durable than plastic materials, clamped in a notebook or paper, easy to carry, which can avoid accidental loss The cap is equipped with a protective pad. The ink is not easy to dry. The cap can also prevent rolling off the table",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  }
]