[
  {
    "sku": "pet_supplies_0",
    "title": "Providence Engraving Pet ID Tags in 8 Shapes, 8 Colors, and Two Sizes - Personalized Dog Tags and Cat Tags with 4 Lines of Customizable Text Available in 8 Shapes and Colors",
    "price": 3.99,
    "rating": 4.6,
    "rating_count": 60506,
    "image_url": "https://m.media-amazon.com/images/I/61vA0XgS1mL._AC_.jpg",
    "description": "These personalized pet ID tags for dogs and cats feature clear lettering and room for four lines of text on each side. The tags come in both large and small sizes. Large tags measure approximately 1.3 inches in diameter and are recommended for large and medium-sized dogs, while small tags measure approximately 1 inch and are recommended for cats and smaller dog breeds. Rectangle, star, circle, heart, paw, bone, cat and hydrant shape options are available, so you can choose a pet tag customized to match your pet's personality. Personalize your pet's tag further by choosing one of nine different color options, including blue, red, pink, silver and more. Etched with a precision carbon dioxide laser, the white lettering will stand out against all background colors. Laser etched and manufactured in the U.S. using high-quality, aircraft-grade, domestically sourced aluminum, these pet tags are durable, lightweight and safe.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_1",
    "title": "Zesty Paws Puppy 8-in-1 Multivitamin Soft Chews - Glucosamine & Chondroitin for Hip & Joint Health - Omega 3 Fish Oil for Skin - Gut, Immune, Heart, Kidney & Liver Support for Puppies - 90 Count",
    "price": 20.97,
    "rating": 4.6,
    "rating_count": 33771,
    "image_url": "https://m.media-amazon.com/images/I/51eNiFHwMfL._AC_.jpg",
    "description": "Multi-FUN-ctional Support for Your Puppy – This multifunctional soft chew supplement supports 8 areas of functional dog wellness for puppies from 8 weeks old to 1 year old. Supports Mobility – Features OptiMSM (MSM) and a Glucosamine Chondroitin duo to support hips and joints, plus Cod Liver Fish Oil to support performance and mobility for dogs. Digestion & Immunity – Includes digestive and gut health blends (with Amylase & Bromelain) for healthy digestion and Vitamin C for immune support. Antioxidant, Liver & Brain Support – Vitamins C and E provide antioxidants for free radical support, while CoQ10, B12, and Cod Liver Oil maintain liver and cognitive function for dogs. Skin & Heart Health – The Vitamin E, B Complex vitamins (including Biotin), and Fish Oil (with EPA & DHA fatty acids) support skin moisture, along with cardiovascular health.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_2",
    "title": "Rachael Ray Nutrish Soup Bones Dog Treats, Beef & Barley Flavor, 11 Bones",
    "price": 10.98,
    "rating": 4.5,
    "rating_count": 43851,
    "image_url": "https://m.media-amazon.com/images/I/51xNLAwgE0L._AC_.jpg",
    "description": "Savory long-lasting chews made with real beef. Rachael Ray Nutrish Soup Bones Beef & Barley Flavor are made with real beef and hearty barley. These long-lasting chews have all the deliciousness of a wholesome soup bone with a tender, meaty center inside. Contains (1) 11 Count Bag of Soup Bones Dog Treats Savory, long-lasting chews with a tender, meaty center No meat by-products or artificial flavors Perfect for small, medium or large dogs Safely USA cooked with the world’s finest ingredients",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_3",
    "title": "Henkelion Large Cat Carriers Dog Carrier Pet Carrier for Large Cats Dogs Puppies up to 25Lbs, Big Dog Carrier Soft Sided, Collapsible Travel Puppy Carrier - Large - Green",
    "price": 39.99,
    "rating": 4.7,
    "rating_count": 38321,
    "image_url": "https://m.media-amazon.com/images/I/51dJnjIKSWS._AC_.jpg",
    "description": "PACKAGE CONTAINS 1 x Pet Carrier NOT AIRLINE APPROVED - The large pet carrier is only suitable for daily travel, car seat journey and pet hospital etc. Do not place it under an airplane seat SAFETY DESIGN - The adjustable shoulder strap help you hands-free carrying and makes it the most safe and convenient pet carrier bag for your travel DURABLE - This cat carrier is made of durable and lightweight polyester fabric. The four-side mesh will not only give a safe and comfortable travel for your pet, but also easy for you to check on your pet PORTABLE & FOLDABLE - This dog carrier is easy to carry and store, which has a padded shoulder strap and handles BOTH SIZES & WEIGHTS - The large cat carrier is designed for small and medium pets within 18\" x 12\" x 12\"(smaller than product) and 25 lbs. Please do not choose your carrier only based on weight. Reference your pets' length and height in selecting a carrier size.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_4",
    "title": "The Original Gorilla Grip Thick Cat Litter Trapping Mat, 24x17, Less Waste, Traps Mess from Box for Cleaner Floors, Stays in Place for Cats, Soft on Paws, Easy Clean, Durable Backing, Cream",
    "price": 16.15,
    "rating": 4.5,
    "rating_count": 43755,
    "image_url": "https://m.media-amazon.com/images/I/51Izsx0kUKL._AC_.jpg",
    "description": "The Original Litter Trapper: the cat mat is constructed from durable long lasting materials;  topside features thick mesh coils that effectively grab litter; deep grooves on the topside also collect litter, keeping it contained to the mat and off of your floors Textured Backing Helps it Stay in Place: while other mats may shift around as your cat exits their litter box, resulting in litter all over your floors, our mat is designed with a textured backing that helps it to stay in place, even with active cats Water Resistant:  constructed from durable waterproof materials, the cat mat is designed to not allow liquids to pass through, helping to keep liquid messes off your floors; mat also protect floors from scratching Recycle More Litter and Easy Clean: waste less litter; tip and pour collected litter back into the box to save money; excess litter can also be vacuumed or shaken out of mat; for a deep clean use mild soap and water, always air dry Incredibly Gentle and Soft on Paws:  a durable mat that is super soft on sensitive paws, because your furry friend deserves the best; even makes a great spot for an afternoon cat nap; mat measures 17” x 24”",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_5",
    "title": "SleekEZ 10\" Horse Grooming Unique Blade Shed Tool",
    "price": 21.95,
    "rating": 4.5,
    "rating_count": 39385,
    "image_url": "https://m.media-amazon.com/images/I/315bHAcWkcL._AC_.jpg",
    "description": "SleekEZ handle is constructed of poplar wood, waterproof with a \"GREEN\" water-based lacquer Metal blade design is exclusive to SleekEZ Made in the USA",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_6",
    "title": "PetSafe CozyUp Folding Dog Stairs - Pet Stairs for Indoor/Outdoor at Home or Travel - Dog Steps for High Beds, Sofa with Siderails, Non-Slip Pads - Durable, Supports up to 150 lb - Large, Gray",
    "price": 53.62,
    "rating": 4.2,
    "rating_count": 62618,
    "image_url": "https://m.media-amazon.com/images/I/51eF2GsNgGL._AC_.jpg",
    "description": "Let cuddle time continue with your best friend with the help of PetSafe CozyUp Folding Pet Steps. If your dog or cat isn’t quite tall enough to reach the bed or couch, or if you want to help protect their joints, folding pet steps give your furry friend the freedom to get on and off furniture all by themselves. Weighing only 5 pounds, these pet steps are easy for you to carry and move around your house. Although light, the strong, durable folding steps can support up to 150 pounds and are suited for small to medium size pets. The fabric covers, side rails and nonskid feet allow your dog or cat to confidently walk up and down the pet steps without the steps sliding around or wobbling. Between snuggle sessions, you can conveniently store the pet steps by folding them flat and sliding it under a piece of furniture. The pet steps are available in 2 colors, tan and grey. PetSafe brand is here to help you and your pet live happy together. CONTINUE CUDDLE TIME: Help your best friend climb up on the sofa or bed all by themselves SAFETY TESTED FOR DURABILITY: Small size supports pets up to 150 lbs; large size supports pets up to 200 lbs NO SLIPPING: Nonskid feet, fabric tread covers and siderails keep the steps from moving and your pet from sliding SIMPLE TO STORE: Pet steps fold down flat so you can easily store them under your couch or bed SIZING: Small measures 24 in L X 16 in W X 20 in H and large measures 28 in L X 18 in W X 25 in H MADE IN THE USA: These high-quality pet steps are proudly made in the United States U.S.-BASED CUSTOMER CARE: Our pet product experts are here to help you and your pet and are available by phone, email or chat if you have any questions QUALITY PROMISE: PetSafe brand has been a trusted global leader in pet behavior, containment and lifestyle innovations since 1998 to help keep your pet healthy, safe and happy",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_7",
    "title": "Voyager Step-In Air Dog Harness - All Weather Mesh Step in Vest Harness for Small and Medium Dogs by Best Pet Supplies - Pink Base, M",
    "price": 14.99,
    "rating": 4.6,
    "rating_count": 75001,
    "image_url": "https://m.media-amazon.com/images/I/51Q3NDO1cKL._AC_.jpg",
    "description": "COMFORTABLY WALK YOUR PET NO MATTER THE WEATHER Our Step-In Air All-Weather harness is designed to ensure that regardless of the conditions outside, youll still manage to take your pet on those walks that get their tail wagging like crazy. Weve used mesh material that is breathable to keep your dog or pet cool on hot days, but also provides insulation for those chilly occasions And its going to be one comfy walk for your furball! Unlike leashes that have the tendency to strain your pets neck, this safety harness evenly distributes the pressure around the chest to prevent any kind of choking. Stress Free Walks Is it always a struggle trying to get your pet in most harnesses? Well, youll love just how easy this step in harness is to put on! Simply have your dog walk into it with their front legs, attach a leash, and youre good to go. But what really makes this support harness a must-have is how secure it is. Weve fitted it with a strong closure and heavy duty metal D-rings for double security. So youll never have to worry about your dog wiggling out of the harness while on your walks. Here are more reasons to love this great harness: • Non irritating material allows for all-day wear. • Available in a wide range of sizes (Please refer to the sizing chart). • Made with great attention to detail to ensure maximum durability. • Securely holds your pet while still being gentle. • Beautiful choice of colors to suit your pets personality. ATTENTION: Sizing does NOT directly correspond to your pet's breed or weight. Please MEASURE your pet by printing out our Size Guide which has a measuring tape and refer to our sizing chart for the best fit before ordering. ALL WEATHER MESH: Made with a soft, breathable air mesh, this lightweight pet harness is perfect for walks all year round. REFLECTIVE BANDS: Two reflective bands on the sides of this harness enhance your pet’s visibility for those early morning and late evening strolls. THREE SAFETY FEATURES: Our hook and loop fastener, ",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_8",
    "title": "Pet ID Tag Custom for Dog Cat Personalized | Many Shapes and Colors to Choose from | Made in USA | Strong Anodized Aluminum (Bone Blue, Small)",
    "price": 2.77,
    "rating": 4.5,
    "rating_count": 46194,
    "image_url": "https://m.media-amazon.com/images/I/517g49P7OdL._AC_.jpg",
    "description": "PERSONALIZED IDENTIFICATION FOR YOUR DOG AND CAT - Rest easy knowing your pet is wearing a strong, quality, durable tag that will work for even the most active pets. You will Dr. Fremont's custom pet tags are valuable and full of value. MANY COLORS: Whether you need a large dog tag engraved for pets or a gift for pet lovers in general, we have you covered. Our personalized dog name tags and cat name tags are available in many different shapes and colors. You can choose from Black, Blue, Green, Pink, Purple, Red, Silver, Orange, and Gold/Yellow. SHAPES AND SIZES: Our custom pet identification tags are available in large bone, small bone, large paw print, large round or circle, small round or circle, and cat face or head. STRONG ID TAGS: If you are looking for a durable pet tag or a custom way to add safety to your pet, Dr. Fremont's has you covered. Our tags are made with aircraft grade aluminum and will last for years. There are even options during customization that will enable our guarantee that the tag text will never fade. Our tags are a lightweight and low cost alternative to stainless steel that will hold up significantly better than silicone dog tags. HOW TO ORDER: You can place an order for a Dr. Fremont's custom pet tag by choosing your size/shape/color and then clicking on the \"Customize Now\" button and filling out the information. You can do front and back side laser engraved tags and each ring includes the split ring to attach to your pet's collar!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_9",
    "title": "FRONTLINE® Plus for Dogs Flea and Tick Treatment (Small Dog, 5-22 lbs.) 3 Doses (Orange Box)",
    "price": 28.68,
    "rating": 4.4,
    "rating_count": 40871,
    "image_url": "https://m.media-amazon.com/images/I/51gNWwQDB5L._AC_.jpg",
    "description": "Keep your dog protected with the #1 name in flea & tick protection*, FRONTLINE®. FRONTLINE Plus for Dogs is a fast-acting, long-lasting waterproof flea & tick topical that's proven to kill fleas, flea eggs, flea larvae, chewing lice, and ticks that can transmit Lyme disease. Break the flea life cycle — FRONTLINE Plus for Dogs is specially formulated with fipronil and (S)-methoprene to kill existing adult fleas, flea eggs and flea larvae to guard against further infestations for flea control. Trusted by pet owners for over 20 years**— FRONTLINE Plus for Dogs can be used on puppies as young as eight weeks old, weighing 5 pounds or more, and is easy to apply. Applied to a single point on your pet, the flea and tick control treatment covers your dog's entire body and deposits in the sebaceous glands. These glands act as a reservoir, continuously replenishing the treatment onto your pet, working even if your dog gets wet. Just one dose of FRONTLINE Plus each month protects against fleas & ticks for a full 30 days. FRONTLINE Plus also comes in a formula designed for cats and kittens eight weeks of age and older, 1.5lbs. and over so you can protect the dogs or cats in your house from fleas and ticks with FRONTLINE Brand Products. Appropriately treat all pets in your household monthly to effectively control fleas and ticks and prevent the establishment of new flea infestations. Subscribe and save today to make it easier to keep your dogs or cats protected year-round and make sure you never run out of FRONTLINE Plus. Be sure to visit our brand store and follow us to stay up to date on new FRONTLINE products, features, tips and more. References: *Data on file at Boehringer Ingelheim. **Data showing 20 years of trust in killing fleas and ticks is on file at Boehringer Ingelheim. Keep your dog protected from fleas & ticks all month long with FRONTLINE Plus for Dogs a fast-acting, waterproof flea & tick topical that's proven to kill fleas, flea eggs, flea larvae, chewing lice, a",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_10",
    "title": "carefresh Dust-Free Confetti Natural Paper Small Pet Bedding with Odor Control, 10L",
    "price": 8.99,
    "rating": 4.6,
    "rating_count": 39063,
    "image_url": "https://m.media-amazon.com/images/I/51Mc98bDqtL._AC_.jpg",
    "description": "Specifically designed for small pets, carefresh pet bedding is sustainably made from scratch with pillowy-soft, ultra-absorbent natural paper fiber. Whether filling a hamster's home or looking for the perfect guinea pig bedding, our natural small animal bedding provides your pet with a soft, safe, clean and dry place to burrow, nest, and nap. Free of harmful chemicals and synthetic dyes, this 99% dust-free high performance bedding is also biodegradable and compostable, meaning clean-up is always quick and easy while ensuring a cleaner, healthier home for your furry friend. Treat your beloved pet to the bedding of choice for guinea pigs, rabbits, hamsters, gerbils, rats, mice, chinchillas and ferrets. carefresh only uses reclaimed paper fiber and untreated wood from sustainable sources, free of harmful chemicals and other pollutants, and we've been doing it proudly for over 30 years. Variations in product, color, texture and size can occor due to our commitment to using sustainable practices to protect the future of our planet. Small Pet Bedding: Our colorful confetti natural paper fiber bedding makes the softest, driest most comfortable home for small pets Pillowy Soft: Comfyfluff natural paper bedding made from scratch is gentle on sensitive feet with perfect texture for burrowing, tunneling, nesting, or creating a hamster hideout; ideal rat, mice or guinea pig bedding, rabbit litter or for small pets Exceptional Odor Control: Ideal for use as hamster bedding, guinea pig habitat lining, or bunny bedding, our pet-safe, proven odor-control formula suppresses ammonia odors for up to 10 days Ultra-Absorbent: 2X more absorbent than shavings, our natural paper bedding keeps small pets and their homes warm and dry with no more soggy messes to clean up 99 percent Dust-Free: Free of harmful chemicals and synthetic dyes, our high performance bedding is virtually dust free so your pet can enjoy a cleaner, healthier home. Biodegradable and compostable means better for the plan",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_11",
    "title": "Blueberry Pet Essentials 21 Colors Classic Dog Collar, Emerald, X-Small, Neck 8\"-11\", Nylon Collars for Dogs",
    "price": 8.49,
    "rating": 4.7,
    "rating_count": 41936,
    "image_url": "https://m.media-amazon.com/images/I/41pCMcMM+vL._AC_.jpg",
    "description": "Neck 8\"-11\", Width 3/8\",Size X-Small; The collar does not stretch itself, please make sure leave ONLY 2 fingers between collar and dog neck. A properly fitting collar and harness won't leave any room for your dog to chew. The collar is not for tie out. NEVER leave your dog unattended with a collar on Blueberry Pet is perfecting product lines. Classic collection products will be becoming part of Essentials by Blueberry Pet. This collar is a single product. Its matching leash (B00HRQGP40) /harness (B01N0PXEPI) sold separately Nylon fabric with high density webbing to add durability; Those buckles are made from ecofriendly plastic. The metal D ring is chrome coated to add durability All pictures are taken with our production samples from a size of Medium; Please measure your pets carefully for making the right purchase. Always look at the size chart for the recommended weight range to confirm the size",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_12",
    "title": "IDC Powerharness, Size: XL/2, Dark Pink",
    "price": 59.99,
    "rating": 4.6,
    "rating_count": 35849,
    "image_url": "https://m.media-amazon.com/images/I/41XYaqzL7pL._AC_.jpg",
    "description": "IDC Powerharness - Professional control for urban walks IDC Powerharness is your dog harness for bustling days, early morning walks, and getting around safely. It is a harness you can fit in one move and count on when you need it. Efficient power transmission, efficient control We have optimized the IDC Powerharness for the power directed at the dog. It's chest strap is parallel to the leash in your hand; therefore, it can transmit the power arriving from you in the most efficient manner. This means that you can hold back or stop your dog when you need to with less effort. The wide chest strap and the optional chest pad help distribute the power over the chest for the proper comfort of your pet. Specific design for each dog size In order to offer the same comfort to all the dogs, the structure of the harness is different for small and large dogs; we designed them with the specific dog sizes and the relevant leash angles in mind. Green zone design principle: free movement, free breathing Unlike collars, the special angle of the chest strap allows the IDC Powerharness to rest on the ideal zone of the chest. This completely frees your dog’s neck for healthy, unrestricted breathing while ensuring free movement for the front legs. Heavy-duty handle to handle the unexpected The handle atop the harness allows you to control your dog with confidence – to stop her or guide her moves on the streets, up or down the steps, or when getting out of the car. One-click fit for daily use To make your bustling days go smooth, the harness can be fitted in a single move. Sturdy construction for everyday use Reliability and durability are guaranteed by the shatterproof buckle, the use of excellent materials, and the careful manufacturing by hand. The reflective elements of the IDCPowerharness ensure good visibility, the first-class, OEKO-TEX-certified lining ensures high product safety, the practical accessories offer versatility, while the interchangeable hook-and-loop patches allow for",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_13",
    "title": "Furhaven Large Pillow Dog Bed Comfy Couch Plush & Decor Sofa-Style w/ Removable Washable Cover - Diamond Blue, Large",
    "price": 39.99,
    "rating": 4.5,
    "rating_count": 76036,
    "image_url": "https://m.media-amazon.com/images/I/41o9OvIaQPL._AC_.jpg",
    "description": "Perfect for cats and dogs of all ages, the Furhaven Comfy Couch Plush & Decor Sofa-Style Dog Bed is a short-sided pet sofa that is sure to be your pet’s favorite new snuggle spot. Your pet will love the high-loft comfort of this fiber-filled pillow dog couch which is gusseted for maximum loft and comfort. Soft-sided walls provide bolstered support on both edges and the back of the bed, allowing your pet to relax into comfort with their back and hips supported. The side bolsters also offer the perfect pillow for your pet to rest its head, allowing for better spinal alignment and neck relief. The bed is filled with high-loft polyester filling made from recycled water bottles while the bolsters are filled with 100% recycled fluffy fill, making the bed earth and pet friendly. The couch’s gusset and bolsters feature a groovy diamond print design and matching plush faux fur sleep surface that is oh-so-soft on noses and paws. Featuring diverse sizing and stylish color options, you are sure to find a purrfect fit for your pet. COMFORT AS PRIORITY: The sofa-style design creates a cozy and inviting space that promotes comfort and security; designed with supportive bolsters for dogs to rest their heads on for optimum lounging comfort SLEEP SURFACE: Featuring cuddly soft plush faux fur main sleep surface and bolters wrapped in durable woven upholstery fabric; both are gentle on noses and paws for enhanced snuggling and burrowing comfort EASY ON JOINTS: Fluff-filled bolsters support the back, hips, and joints to help ease discomfort and promote restful sleep PRODUCT DETAILS: Pillow Dog Bed, Diamond Blue; Large - 36\" x 27\" x 7\" (Sleep Surface: Approx. 31\" x 24.5\") AVAILABLE IN: Diamond Brown, Diamond Blue, and Diamond Gray; the dog bed also comes in Small, Medium, Large, and Jumbo sizes IMPORTANT: Not suitable for pets with excessive teething or destructive chewing behavior EASY CARE: The removable dog bed cover is completely machine washable; for more specific cover care instruc",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_14",
    "title": "Active Pets Dog Car Seat Cover for Back Seat - Durable, Nonslip, Waterproof 600D 3-in-1 Hammock - Protector Against Dirt, Shedding and Scratching for Small or Mid-Size Sedans, SUVs and Trucks",
    "price": 33.26,
    "rating": 4.6,
    "rating_count": 47127,
    "image_url": "https://m.media-amazon.com/images/I/41Rdw-CmONL._AC_.jpg",
    "description": "WHICH SIZE SHOULD I GET: Reference our sizing guide found in the image set to the left or further down the page to determine which dog car seat cover best fits your vehicle COMFORTABLE & STURDY - Forget those cheap dog seat covers for cars that can't withstand your pet's paws and claws! This covering keeps your car clean and provides top-tier padding for years to come. UNIVERSAL FIT - We made these car seat covers for dogs of all shapes and sizes! From tiny smart cars to SUVs, our car seat protector is sure to fit like a glove. PET PROTECTION - Safety first! 4 heavy-duty headrest anchors and 2 seat anchors keep this dog back seat cover completely in place, so your pet doesn't slip and slide around (even on the bumpiest rides). PET PROTECTION - Safety first! 4 heavy-duty headrest anchors and 2 seat anchors keep this dog back seat cover completely in place, so your pet doesn't slip and slide around (even on the bumpiest rides). CUSTOMER SATISFACTION - Have any questions, comments, or concerns about your dog car seat cover? Our customer satisfaction team is purr-fectly happy to give you a helping hand (or paw)!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_15",
    "title": "GoTags Stainless Steel Pet ID Tags, Personalized Dog Tags and Cat Tags, up to 8 Lines of Custom Text, Engraved on Both Sides, in Bone, Round, Heart, Bow Tie and More",
    "price": 8.95,
    "rating": 4.7,
    "rating_count": 116226,
    "image_url": "https://m.media-amazon.com/images/I/41XnsK5fNRL._AC_.jpg",
    "description": "GREAT IDENTIFICATION FOR YOUR DOG & CAT - When it comes to durability and quality our stainless steel tag holds up to the most active pet. To see all our pet ID products, click on our brand name GOTAGS above the product listing title. FAR STRONGER THAN ALUMINUM TAGS AND LESS PRONE TO WEAR, stainless steel lasts longer and is unlikely to wear thin and break like aluminum tags. The laser engraving is clear, permanent, and attractive on a polished mirror-finish surface. WITH 2 SIDED ENGRAVING & UP TO 8 LINES OF PERSONALIZED TEXT, there's plenty of room for all of your pet's important information - up to 4 lines on front of tag and 4 lines on back of tag. Please follow the ordering instruction below to place your order. TO ORDER: SELECT SHAPE & SIZE FROM THE ABOVE CHOICES. After selecting shape & size, click CUSTOMIZE NOW to add your personalization details to the tag. When personalizing, you may include up to 4 lines of text on each side by selecting FRONT surface & BACK surface. Add to cart ONLY AFTER you have completed both surfaces with your information. SIZE: The tags come in both regular and small sizes. Regular tags measure approximately 1.3 inches in diameter and are recommended for large and medium-sized dogs, while small tags measure approximately 1 inch and are recommended for cats and smaller dog breeds.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_16",
    "title": "Voyager Step-in Air Dog Harness - All Weather Mesh Step in Vest Harness for Small and Medium Dogs by Best Pet Supplies - Harness (Blue/Black Trim), XX-Small",
    "price": 12.74,
    "rating": 4.6,
    "rating_count": 47226,
    "image_url": "https://m.media-amazon.com/images/I/51TatIs4QOL._AC_.jpg",
    "description": "COMFORTABLY WALK YOUR PET NO MATTER THE WEATHER Our Step-In Air All-Weather harness is designed to ensure that regardless of the conditions outside, youll still manage to take your pet on those walks that get their tail wagging like crazy. Weve used mesh material that is breathable to keep your dog or pet cool on hot days, but also provides insulation for those chilly occasions And its going to be one comfy walk for your furball! Unlike leashes that have the tendency to strain your pets neck, this safety harness evenly distributes the pressure around the chest to prevent any kind of choking. Stress Free Walks Is it always a struggle trying to get your pet in most harnesses? Well, youll love just how easy this step in harness is to put on! Simply have your dog walk into it with their front legs, attach a leash, and youre good to go. But what really makes this support harness a must-have is how secure it is. Weve fitted it with a strong closure and heavy duty metal D-rings for double security. So youll never have to worry about your dog wiggling out of the harness while on your walks. Here are more reasons to love this great harness: • Non irritating material allows for all-day wear. • Available in a wide range of sizes (Please refer to the sizing chart). • Made with great attention to detail to ensure maximum durability. • Securely holds your pet while still being gentle. • Beautiful choice of colors to suit your pets personality. ATTENTION: Sizing does NOT directly correspond to your pet's breed or weight. Please MEASURE your pet by printing out our Size Guide which has a measuring tape and refer to our sizing chart for the best fit before ordering. ALL WEATHER MESH: Made with a soft, breathable air mesh, this lightweight pet harness is perfect for walks all year round. Comfortable shape distributes pulling pressure across your pet’s chest to reduce the stress and strain on their neck. REFLECTIVE BANDS: Two reflective bands on the sides of this harness enhance your ",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_17",
    "title": "ICEFANG Tactical Dog Harness, Small Size,2X Metal Buckle,Working Dog MOLLE Vest with Handle,No Pulling Front Leash Clip,Hook and Loop Panel",
    "price": 32.99,
    "rating": 4.7,
    "rating_count": 24276,
    "image_url": "https://m.media-amazon.com/images/I/51PQ5WjYsEL._AC_.jpg",
    "description": "[Size & Care instruction] 1:Please choose right size base on ICEFANG size chart , Small(Neck:14\"-18\" ; Chest:22\"-27\");Medium(Neck:16\"-22\" ; Chest:25\"-31\" );Large(Neck:18\"-24\" ; Chest:28\"-35\");X-Large(Neck:20\"-28\" ; Chest:32\"-39\"); 2:This Harness is not to be used with a tie out;3:Burn and solidified the end of strap if necessary ,Make Sure the end of strap is not fraying; 4: Washing: Hand-wash with detergent, rinse with clean water, allow to air dry. [2x METAL BUCKLE]: 2 x Metal Buckle (1000 lb Proof-Load Test ) on Dog Shoulder Position which the most Load Bearing Point When Dog Pulling, 2 x POM buckle (250 lb Proof-Load Test ) on belly Position;Sewing by Bartack and X in Box Pattern on Each Joint and Heavy load Point [NO PULL/SAFETY CONTROL]: Connect leash to No pull front clip,redirect the dog forward motion and make dog's leg off the ground ,Allow you to Control the puller with few effort and training your dog to walk beside you; Back Leash Clip for well-trained dog normal Walking;Durable Handle is Sewn Tough and Large Enough to Grab the Harness Quickly and Easily When Walking in Crowd ,Also Lift Your Dog When Getting in/out of the Car [HANDS FREE CARRYING ]:Two 1\" Strips of Molle (Small: 3 x Hook & 2 x Loop ; Medium: 4 x Hook & 2 x Loop ;Large/X-Large:5 x Hook & 2 x Loop) Sewn Onto Both Side,Allow Your Dog to Carry Gear in Training / Daily Walking/Adventure Hiking, it Compatible with Molle /PALs Pouch,You Can Aslo Hook Dog Bowl,Water Bottle and Toy Through D shape Carabiner (No included) [DOG IDENTIFIED]:Three 1\" Strips of Hook and Loop Panel Sewn onto Both in the Formation of MOLLE(size in Small :3\"x4.5\" ; Medium :3\"x6\" ;Large/X-large/XX-Large :3\"x7.5\" ); One Strip of loop panel Sewn Along the Back of harness with different wide in each size ( Small: 1.5\" ; medium/Large:3\" ;X-large/XXL:4\");One Square Loop panel Sewn on The Front Chest (Size in small:2\"x 2\" ; Medium:2\"x 3\" \"; Large/X-large:2\"x 4\" ; XX-Large:3\"x4\") ,You Can Attach Many Patch to Identify Your Dog",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_18",
    "title": "Puppia Soft Dog Harness No Choke Over-The-Head Triple Layered Breathable Mesh Adjustable Chest Belt and Quick-Release Buckle, Green, Large",
    "price": 16.57,
    "rating": 4.3,
    "rating_count": 24652,
    "image_url": "https://m.media-amazon.com/images/I/51ni0y2zOjL._AC_.jpg",
    "description": "The Puppia Soft Dog Harness is made of a soft air-mesh material which is very comfortable on your dogs neck. It can be sized with its resizable chest belt to fit comfortably on your dog. Easy snap on and off. The Puppia Soft Dog Harness is a real winner for comfort and is a best seller for your dogs. Authentic Puppia Soft Dog Harness made out of 100% Polyester Adjustable chest belt and quick-release buckle Comfortable padded neck opening. Rubber Puppia label Machine washable, but hand washing and air drying are recommended",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_19",
    "title": "Bodhi Dog New Bitter 2 in 1 No Chew & Hot Spot Spray | Natural Anti-Chew Remedy Better Than Bitter Apple | Safe on Skin, Wounds and Most Surfaces | Made in USA (8 Fl Oz)",
    "price": 14.99,
    "rating": 3.4,
    "rating_count": 26656,
    "image_url": "https://m.media-amazon.com/images/I/41NC9XQ7bTL._AC_.jpg",
    "description": "DETER CHEWING & BITING OF SKIN IRRITATIONS: Our all-natural Bitter 2 in 1 No Chew & Hot Spot Spray is a safe and humane alternative to help train your dog from chewing and biting on wounds, skin, and anything everything around them! The natural bitters added in our formula do not scare or harm your dog, it just tastes awful to any surface applied on. The added soothing tea tree oils and eucalyptus help to bring calming relief to hot spots on your dog's skin. 100% STEROID FREE: Our all-natural safe, lemongrass scented formula is hand-crafted in small batches to ensure the highest quality and made in the USA. Made with botanical-based and all-natural eucalyptus, tea tree oils, and bitters, our formula is fast-acting to help bring relief to raw skin, hot spots, cuts, and scratches without the stinging effects and helps to soothe irritated skin. SAFE TO USE INDOORS AND OUTDOORS: Our non-staining, cruelty-free anti-chew spray is safe to use on things you want your dog to stop chewing on both indoor and outdoor. It can be safely be sprayed on fabrics, tables, blinds, baseboards, powder cords shoes, furniture, wires, woodwork, rugs, and many other things you don't want your dog to chew on! Remember chewing is a hard habit to break, so allow days or up to weeks depending on your dog’s training capabilities! Repeat often as needed. EFFECTIVE AND SAFE: Our Bitter 2 in 1 No Chew & Hot Spot Spray won’t hurt your dog or the things it sprayed on! Please keep in mind, our spray contains natural bitters which can have a strong scent to some people. Make sure to always use it in a well-ventilated area. Use sparingly at first as a precaution to test for adequate ventilation. Our all plant and botanical based chew deterrent spray is inspired by nature and does not contain harsh chemicals or additives. OUR ETHICAL FAMILY COMMITMENT: Proudly made in the USA using socially responsible practices, locally sourced and sustainable ingredients, animal cruelty-free production and eco-friendly ",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_20",
    "title": "Furhaven Large Orthopedic Dog Bed Sherpa & Suede Deluxe Mattress w/ Removable Washable Cover - Espresso, Large",
    "price": 29.99,
    "rating": 4.4,
    "rating_count": 23544,
    "image_url": "https://m.media-amazon.com/images/I/41tUN1GzawL._AC_.jpg",
    "description": "Give your best friend the support they need with a plush and cozy Furhaven Sherpa & Suede Mattress Dog Bed. Soft and plush faux sheepskin top is soft on noses and paws. Perfect for dogs and cats that love to sprawl in their sleep. The orthopedic (egg crate) foam base supports your pet's joints, cushions pressure points, and helps improve air circulation for optimum rest. The Jumbo Plus option, for larger breeds, features a solid slab orthopedic foam for greater support and comfort. The zippered cover is easily removed and machine washable for your convenience. Low profile, step-on design for easy access by older or disabled pets. Easy to clean. Cover care: Remove from core before washing (see seam label for fabric care instructions). Foam care: Spot clean with mild soap; rinse. Blot, then air dry. Do not wring. Not for unsupervised use by animals with chewing behaviors. DESIGNED FOR PETS: The classic pet bed mattress design gives both dogs and cats plenty of room to sleep in a variety of different positions, with the gusseted sides providing additional cushioned loft for enhanced nestling and lounging comfort SLEEP SURFACE: The main sleep surface is lined with super cozy and insulating sherpa that is gentle on noses and paws for enhanced snuggling comfort EASY ON JOINTS: The egg crate orthopedic foam mattress helps distribute body weight, cushion pressure points, and improve air circulation to help ease discomfort and encourage restful sleep; PRODUCT DETAILS: Espresso; Large, 36\" x 27\" x 3\" AVAILABLE VARIANTS: The bed comes in Clay, Navy, Espresso, and Gray; it's also available in Small, Medium, Large, Jumbo, and Jumbo Plus EASY CARE: The removable dog bed cover is completely machine washable for your convenience; for more specific washing instructions, please refer to the hang tag and/or seam label (if applicable) CUSTOMER ASSURANCE: The product comes with a 90-day limited coverage against material defects and may also qualify for our 60-day Worry-Free Program; res",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_21",
    "title": "HEELE Dog Muzzle,Soft Nylon Muzzle Anti Biting Barking Chewing,Air Mesh Breathable Drinkable Adjustable Loop Pets Muzzle for Small Medium Large Dogs 4 Colors 4 Sizes",
    "price": 7.99,
    "rating": 3.7,
    "rating_count": 24300,
    "image_url": "https://m.media-amazon.com/images/I/514GmcXzreL._AC_.jpg",
    "description": "🐶【ADJUSTABLE SIZE】: The adjustable strap connecting to the neck help to keep the dog muzzle securely in place, ensuring it is snug and anti-slipped. Adjustable at snout and neck strap. Keep the christmas muzzle tight enough to control his bite. 🐶【COMFORTABLE AND BREATHABLE】: The dog muzzle practical and reliable is made with high-quality nylon material, soft breathable mesh and soft fabric. The interior of the muzzle has extra soft padding providing the ultimate comfort for your pet. 🐶【UPGRADE HUMANIZED DESIGN】: The humane design solves the inconvenience of traditional dog muzzle that can't drink water, can leave a proper space for your dog mouth to breathe, gasp and drink. While preventing biting and muzzle for dogs used for safe socialization. 🐶【EASY TO WEAR AND CLEAN】: The ergonomic design of the dog muzzle ensures that the mask stays securely in place. Can easily be secured with a hook and loop fastener to prevent loose ends. Most dogs don't adapt to wear muzzle at the begining, so we have to take time to make them adapt muzzle patiently. It could be washed by the washing machine, and dry flat. 🐶【RISK FREE CUSTOMER SERVICE】: Please measure the right size before buying and we have provided a chart and measuring instructions, If you have any trouble with finding the right size, we offer great customer support and will work hard to fix your problem.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_22",
    "title": "furrybaby Premium Fluffy Fleece Dog Blanket, Soft and Warm Pet Throw for Dogs & Cats (Small (24 * 32\"), Grey Double-Layer Blanket)",
    "price": 14.99,
    "rating": 4.5,
    "rating_count": 25713,
    "image_url": "https://m.media-amazon.com/images/I/41NRfWDy--L._AC_.jpg",
    "description": "FURRYBABY is a cooperation that aims to offer the best pet supplies to customers all over the world. We thank you so much for your kind support and trust. FURRYBABY offers high-quality pet supplies with the best service to your furry friends. Fur baby matters too coz we are all pet lovers! FEATURES: 1. Our blanket is lightweight and easy for your baby to carry around. 2. Available in five sizes: Small 24x32\", Medium 32x40\", Large 40x47\", X Large 41x65\", Jumbo 59x78\". 3. It can greatly prevent unwanted pet fur from furniture, and make your home clean and neat. 4. Our fleece pet blanket is warm and cozy for your baby to snuggle up and sleep with at night. 5. This unique grey color dog blanket can make your home look stylish and exquisite. 6. 5 Size available can greatly meet different needs for couches, beds, or vehicles. 7. Can easily shake off the dog/cat hair and throw it to launder. 8. Premium product from a loving and caring company! CHARACTERISTICS: COLOR: GreyMATERIAL: Berber Fleece (100%Polyester) ITEM SIZE: S 24x32\"; M 32x40\"; L 40x47\"; XL 41x65\"; Jumbo 59x78\"CONTENTS: 1x plush dog blanket NOTICE: 1-2 cm measuring error allowed. Please remove all the tags before using for your puppy’s safety. This is a fleece blanket, it is very bouncy and fluffy. Please shake and rub it to make sure it would stay at its best condition after opening the package. Excellent service from FURRYBABY!ANY problem will be given a fine solution. ANY suggestions or ideas would be respected and welcomed. Fleece SMALL SIZE: 24x32inch(60x80cm), perfect for small size dogs, puppies and cats, such as Chihuahua and Papillon, Pomeranian, Bichon, Teddy, Yorkshire terrier,etc. MATERIAL: Made of environment friendly thick soft comfy fleece WASHING: Machine washable and fine with tumble dry, never shed or fade USAGE: Protects furniture from scratching and pet hair, keep couch or bed from dirt SERVICE: Well-packed and timely shipped, any suggestions will be welcomed",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_23",
    "title": "PoyPet No Pull Dog Harness, Reflective Comfortable Vest Harness with Front & Back 2 Leash Attachments and Easy Control Handle Adjustable Soft Padded Pet Vest for Small to Large Dogs (Blue,XL)",
    "price": 20.99,
    "rating": 4.6,
    "rating_count": 22560,
    "image_url": "https://m.media-amazon.com/images/I/51l6kea1TXL._AC_.jpg",
    "description": "No Pull & No Choke: 2 sturdy metal leash attachment points with reinforced webbing, front clip for discouraging pulling and back for relaxed walks. Ergonomic design, pulling pressure is evenly distributed to the body to prevent Choking. Scratch-Resistant oxford material outer layer which is super easy to clean. Quick-dry and soft breathable non-toxic mesh padded, keep optimal comfort while exercising. Padded & comfortable handle for Easy Seat Belt Attachment, soft filling makes for a handle that feels good in the hand for extra control to guide your dog. Reflective stitching for night use providing added visibility. 4 ways adjustable straps, gets a customized fit with room for growth. Lightweight and durable, designed with minimum bulk for maximum dexterity. All Day Comfort: The high-end harness is perfect for daily walking, running, hiking, training, hunting, outdoor adventure and more! WARMLY NOTE: Please DO Measure Dog's Neck & Chest Girth before Buying! Then Check Size Chart Carefully!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_24",
    "title": "Taglory Reflective Dog Collar with Safety Locking Buckle, Adjustable Nylon Pet Collars for Large Dogs, Hot Pink",
    "price": 8.49,
    "rating": 4.7,
    "rating_count": 27496,
    "image_url": "https://m.media-amazon.com/images/I/51ZlC5xEU1L._AC_.jpg",
    "description": "Safety Buckle- Side release buckle is made out of quality eco-friendly plastic with safety lock to prevent the collar from accidentally opening Soft Neoprene Padded- The cushion from this exclusive feature gives maximum comfort to dogs during activities. No sharp edges or unfold sewing joint. Heavy duty stitching adds durability for long lasting use 360° Reflective Straps- Reflective stitching for extra visibility from distance at night High Quality, Durable & Light Weight- Made of a 100% real nylon with good stitching, lightweight but durable, good for all conditions Strong & Easy to Use - 12 colors high density webbing, quick release buckle, soft padded and D ring hardware, this collar will make your pet look adorable and elegant",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_25",
    "title": "Furhaven XXL Memory Foam Dog Bed Microvelvet Luxe Lounger w/ Removable Washable Cover - Gray, Jumbo Plus (XX-Large)",
    "price": 142.99,
    "rating": 4.5,
    "rating_count": 24998,
    "image_url": "https://m.media-amazon.com/images/I/315acp9qZvL._AC_.jpg",
    "description": "Give your best friend the comfort and support they need with a Furhaven Microvelvet Luxe Lounger Dog Bed. This ergonomically-designed pet bed is contoured to cradle your pet’s body and provide therapeutic back and neck support. Luxe Lounger pet beds feature memory foam topping, designed to work with your pet's weight and to contour to their body, providing better overall support and relief from painful muscles and joint discomfort. Quilted, microvelvet sleep surface is lightly padded for the ultimate \"cozy\" experience. Step-on bed design is easily accessible by smaller, older or disabled pets. Removable, washable cover is manufactured using overlock safety stitching for longer lasting durability. This pet bed includes a water-resistant polycanvas base panel and is available in various stylish color options to blend with any home décor. Foam core is CertiPUR-US certified and hand washable. Pet bed cover is zippered and may be machine or hand washed. Easy to clean. Cover care: Remove from core before washing (see hang tag and/or seam label for care instructions). Foam care: Memory foam is highly absorbent. Spot clean with mild soap or enzyme-based cleaning spray. Rinse but DO NOT SOAK OR SUBMERGE. Press out moisture with a dry towel and air dry. A fan may be used to speed drying. Do not wring or place in machine dryer. Dry completely before use. Not for unsupervised use by animals with destructive chewing behavior. DESIGNED FOR PETS: The sloping contoured form factor promotes superior ergonomic comfort and provides optimum orthopedic support for dogs and cats; the open mattress design also gives pets plenty of room to sleep in a variety of different positions SLEEP SURFACE: The sleep surface features quilted micro-velvet fabric that is gentle on noses and paws for enhanced snuggling comfort EASY ON JOINTS: The memory foam top helps cushion pressure points and improve body alignment; the contoured form factor provides enhanced orthopedic support for the neck, back, hip",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_26",
    "title": "Neater Pet Brands Feeder Deluxe for Large Dogs, Cappuccino",
    "price": 64.99,
    "rating": 4.7,
    "rating_count": 22832,
    "image_url": "https://m.media-amazon.com/images/I/418MTUFmmZL._AC_.jpg",
    "description": "Includes two stainless steel bowls; 7 cup food bowl & 9 cup extra capacity water bowl to keep pets well hydrated. Feeding height is 8\" at rim of bowl or 11\" with optional leg extensions (sold separately). Perfect of dogs over 14\" at the shoulder & weighing over 40 lbs.Dimensions:21\" L x 13\" W x 14.5\" H.The Neater Feeder Deluxe for Large Dogs also is compatible with the Neater Pet Brands Slow Feed Bowl, which is sold separately. Kick proof; accidents happen but they don't have to ruin your floor Spill proof; food stays on top and water drains below Elevated; elevated feeding position is good for digestion and joints Neater Feeder Deluxe for Large Dogs - Cappuccino Compatible with Slow Feed Bowl - Neater Feeder Deluxe Large will fit the Neater Pet Brands Slow Feed Bowl -sold separately, not included-",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_27",
    "title": "Minties Twists VetIQ Dog Dental Bone Treats, Dental Chews for Medium/Large Dogs (Over 40 Lbs), 20 Count",
    "price": 9.94,
    "rating": 4.6,
    "rating_count": 22211,
    "image_url": "https://m.media-amazon.com/images/I/51nThlULgbL._AC_.jpg",
    "description": "Kiss your dog’s bad breath bye-bye with Minties Twists. With a delicious blend of peppermint and vanilla, Minties Twists are the flavorful, affordable treats uniquely designed to help remove plaque, tartar, and bad breath right at its source. Give your dog fresh breath and a sparkling smile – all in one dog dental chew. VET-RECOMMENDED: One Minties Dog Dental Treat is all it takes to start dog teeth cleaning and freshening, and to help remove plaque and tartar. GLUTEN-FREE INGREDIENTS: Minties Dental Treats for Dogs contain NO WHEAT, CORN, OR SOY. No added sugars or salt. PLAQUE REMOVAL: Keep your dog's teeth and gums healthy and clean with Minties Dog Dental Chews. Helps remove plaque buildup and controls tartar as they chew. MADE IN THE USA: These Dental Twists for medium to large dogs are made in the USA and specially formulated for dogs weighing more than 30 pounds. COMPLETE PACKAGE: 12-ounce bag, give your dog the mouth-wowing treat that helps promote their overall health with Minties Dog Treats.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_28",
    "title": "Andis 64930 UltraEdge Detachable Blade, Size 5/8HT",
    "price": 46.49,
    "rating": 4.6,
    "rating_count": 24838,
    "image_url": "https://m.media-amazon.com/images/I/4157voEok6L._AC_.jpg",
    "description": "Ensure the longevity of your blade's life by oiling It before every use. Fits all and is detachable blade clippers in these Series: AGC, BDC, BGC, BGR, DBLC, MBG, SMC Carbonized steel extends edge life Chrome finish resists rust Leaves hair 5/8 inch (16mm)",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_29",
    "title": "Gooby Fleece Vest Dog Sweater - Peach, X-Large - Warm Pullover Fleece Dog Jacket with O-Ring Leash - Winter Small Dog Sweater Coat - Cold Weather Dog Clothes for Small Dogs Boy or Girl",
    "price": 13.6,
    "rating": 4.2,
    "rating_count": 22018,
    "image_url": "https://m.media-amazon.com/images/I/41znKOrZKhL._AC_.jpg",
    "description": "Soft Fleece to Keep Your Small Dog Warm All Winter Long - When the cold weather hits, make sure your small dog isn’t shivering and stays warm with the soft and comfortable Gooby Fleece Dog Vest. Made with 100% polyester to keep moisture out like freezing rain or snow, and to help keep warm air in, so your dog always stays warm. This small fleece dog vest is safe, durable, and made to last. Pullover Design for Easy On and Easy Off - Imagine this - Outside it’s snowing and freezing and your dog HAS to go. Our Fleece Dog Vest is a pullover that you can quickly and easily put on your dog and head outside - no spending minutes struggling to put it on. It doesn’t require any velcro or zippers to keep secure, so when there’s an emergency, this hassle-free small dog fleece slips on and off with ease. Leash Attachment - Style Meets Functionality, this isn’t your typical small dog sweater or small dog jacket. Choose from over 17 different colors to make sure your small dog is the warmest and coolest fleece dog sweater on the block. It’s designed with armholes big enough for your dog to comfortably walk and go to the bathroom. Plus, it features an O-ring on the back to use for short winter walks. (not recommended if your dog pulls.) Machine Washable - During the winter, the cold weather means your dog winter clothes are exposed to salt, snow, and all that gross sidewalk slush. That’s why we made the dog fleece vest machine-washable to remove any dirt easily. No hand-washing or worrying about the dog fleece jacket getting ruined after one walk. Throw it in the washer and dryer, and it’s good to go for your next winter adventure. Accurate Small to Medium Dog Sweater Sizing - We make finding a winter fleece vest that accurately fits your small dog easier than any other winter sweater vest or dog jackets for small dogs. Simply measure your dog's chest size with a tape measure and choose from one of our five easy-fit sizes that suit your dog. We also recommend choosing a neck openi",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_30",
    "title": "Outward Hound Granby Splash Orange Dog Life Jacket, XL",
    "price": 27.99,
    "rating": 4.5,
    "rating_count": 35896,
    "image_url": "https://m.media-amazon.com/images/I/41ofZfcSKWL._AC_.jpg",
    "description": "The Outward Hound Granby Dog Life Jacket is a high-performance dog flotation device for boating, water sports, the beach, the pool, and other water adventures with dogs. Designed with novice swimmers in mind, the neoprene side panels of this dog life vest will keep your dog safe by providing them with comfortable buoyancy and thermal insulation for chilly days on the water. A front neck float adds extra support to help them keep their head above water. Top grab handles provide an easy way to retrieve your dog in an emergency. Adjustable straps keep them secure both in and out of water. For small dogs, sizes XS and small come with one top handle, and for larger dogs, sizes medium-XL come with dual rescue handles. Since dogs come in various shapes and sizes, please select the appropriate dog life jacket size after taking your dog's girth measurement along the widest part of your dog's rib cage. Make sure to take any other unique traits (i.e., large shoulders, long torso) into consideration. The Dawson dog life vest is available in multiple colors to fit your dog's personality! SAFETY AND CARE: This is a flotation aid intended for use on a conscious dog in calm waters. Use rescue handle to lift dogs in emergencies only. Do not leave dog unattended while using this product. Intended for dog use only. SIZING BASED ON GIRTH: Dogs come in all shapes and sizes. Whether your dog is short and stout or long and lanky, there's a dog life jacket fit for them. Available in sizes XS-XL and featuring adjustable straps, we've made it easy for you to choose a size that supports them based on their girth measurement. We recommend sizing up if the dog's girth size is on the higher end of this size. SPLASH WITH SAFETY: The Outward Hound Granby Splash life jacket for dogs is designed with bright colors and reflective accents to provide better visibility while swimming. A front neck float helps keep your dog's head above water whether they are a novice or experienced swimmer. NOVICE & EXP",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_31",
    "title": "voopet Service Dog Harness,Emotional Support Pet Vest Harness,Reflective Breathable and Adjustable No-Pull ESA Dog Harness for Small Medium Large Dogs (with 4 PCS Removeable Tags) X-Small (Pack of 1)",
    "price": 16.79,
    "rating": 4.4,
    "rating_count": 21089,
    "image_url": "https://m.media-amazon.com/images/I/51kv67jS7eL._AC_.jpg",
    "description": "🐾NO PULL & CHOKE FREE SERVICE DOG VEST: XS size dog harness recommended weight range: 8.8-15.4 lbs. Distribute the traction pressure of the service dog vest evenly over the body to prevent choking. All-weather breathable Oxford soft mesh vest for maximum comfort and protection for your service and working dogs. 🐾SAFETY HARNESS REFLECTIVE DESIGN: Reflective identification on the esa working dog vest tough durable nylon cloth gives visibility in low light and soft padding provides a comfortable fit, the dog reflective vest ensures the safety of your dog at night. 🐾Easy TO ADJUST SERVICE ANIMAL VEST: This xs service dog vest has adjustable dog collar strap and chest slide strap can be custom sized for your dog, easily adaptable to a variety of puppies small dogs. Perfect for daily walking, running, jogging, hiking, training, working outdoor fun time. 🐾CONVENIENT TO WEAR DOG SERVICE VEST: Emotional support dog vest made of oxford fabric, scratch-resistant, abrasion resistant, durable, lightweight and soft. Simple switch design makes it easy to put on and take off. The included service dog patch is durable and removable at will. Depending on your needs the dog work harness can be available in a variety of models such as therapy dog vest, in training dog harness, emotional support dog vest, calming harness. 🐾100% SATISFIED: We are committed to providing customer high quality products and the best shopping experiences. If you meet any problem or dissatisfied in any way, just send email to us and we will provide the best solution, all problems will be solved within 24 hours.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_32",
    "title": "Furhaven XL Cooling Gel Foam Dog Bed Two-Tone Faux Fur & Suede L Shaped Chaise w/ Removable Washable Cover - Marine Blue, Jumbo (X-Large)",
    "price": 82.99,
    "rating": 4.5,
    "rating_count": 97103,
    "image_url": "https://m.media-amazon.com/images/I/41wRNQZPr7L._AC_.jpg",
    "description": "Pamper your pet with a Furhaven Two-Tone Faux Fur & Suede L Chaise Dog Bed! A luxuriously soft faux fur sleep surface is complemented by suedine bolsters and gusset. Ultra plush, flecked faux fur provides a snuggly soft sleep surface and trims the edges of the bolster for a chic flair. The two-tone design hides dirt and pet dander better than traditional plush sleep surfaces. The L-shaped bolsters support your pet’s back and hips, providing additional support. The L-shape also provides the perfect nook for pets that like to nest into comfort. The two raised, rounded bolster ends allow your pet to lay their paws or neck on the pillowed edge, helping to align the neck and spine. The medical-grade foam core includes a layered orthopedic foam core topped with gel-infused memory foam. Micro gel beads help keep the bed cooler while memory foam conforms to your pet's shape providing superior support of joints and pressure points. Gel foam has cooling properties reducing the sleeping surface by 1 or 2 degrees, wicking heat away from your pet. The superior support provided by both foam cores will help your pet reach a deeper, more restorative rest for your pet's health. Available in various stylish colors and diverse sizing options so your pet can sprawl and lounge the day in maximum comfort and style. Easy to clean. Cover care: Remove from core before washing (see seam label for fabric care instructions). Foam care: Cooling gel foam is highly absorbent. Spot clean with mild soap or enzyme-based cleaning spray. Rinse but DO NOT SOAK OR SUBMERGE. Press out moisture with a dry towel and air dry. A fan may be used to speed drying. Do not wring or place in machine dryer. Dry completely before use. Not for unsupervised use by animals with destructive chewing behavior. COMFORT AS PRIORITY: The stylish L shaped chaise design creates a cozy and inviting space that promotes comfort and security; designed with supportive bolsters for dogs to rest their heads on for optimum lounging co",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_33",
    "title": "Best Pet Supplies Foam Pet Steps for Small Dogs and Cats, Portable Ramp Stairs for Couch, Sofa, and High Bed Climbing, Non-Slip Balanced Indoor Step Support, Paw Safe - Lambswool, 4-Step (H: 18\")",
    "price": 59.99,
    "rating": 4.5,
    "rating_count": 20389,
    "image_url": "https://m.media-amazon.com/images/I/41g0FurwcmL._AC_.jpg",
    "description": "Make it easier for your small-to-medium dogs and cats to climb onto furniture and then get back down all by themselves with foam pet stairs offering well-balanced stability. If you love your pets as much as we do you really enjoy when they come up into bed or onto the couch to give you a snuggle. But if your pet is too small or getting older they can’t always jump up and down to do it themselves. And if you’re not always around to help them or you’re getting a bit old yourself, sometimes you need a little extra help. We developed the Best Pet Supplies Foam Pet Stairs as a simple, effective way to get them up and down while putting less stress on you both. Featuring a non-slip bottom these fabric-covered stairs in 3-step, 4-step, and 5-step sizes simply push right up to the edge so they can climb up or get down quickly, easily, and safely. Product Details: Pet Stairs for Couch, Bed, and Sofa; Supports Small to Medium Dogs and Cats; Heavy-Duty CertiPUR-US Certified Foam; Well-Balanced, Reliable Support for Pets; Lightweight and Portable for Whole Home Use; Soft Fabric Exterior for Paw-Friendly Support; Available in Multiple Colors to Match Home Decor; Help your small dog or aging cat get up on the couch or bed more easily with a soft, supportive foam pet stair system from Best Pet Supplies designed specifically for your four-legged friends. Get one now by clicking Add to Cart above. Premium Pet Ramps for Dogs and Cats – These foam dog steps are designed to cozy right up to the edge of your high bed, tall couch, or other big furniture so your pet can climb up and down to get comfy, so you don’t have to carry them either way CertiPUR-US Certified Foam: To ensure that your pet gets the safest quality steps, we made sure that our USA sourced foams are CertiPUR-US Certified. CertiPUR-US Certified foams are manufactured without ozone depleters, PDBW flame retardants, mercury, lead and other substances/chemicals that can be harmful to your pets. Reduces Strain on Older Adult",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_34",
    "title": "Active Pets Car Seat Cover for Dogs - Standard Waterproof Dog Seat Cover for Back Seat in SUV or Truck - Convertible Pet Hammock & Trunk Protector for Travel - Pink",
    "price": 28.29,
    "rating": 4.5,
    "rating_count": 20178,
    "image_url": "https://m.media-amazon.com/images/I/41okJhrQqpL._AC_.jpg",
    "description": "COMFORTABLE & STURDY - Forget about using cheap dog seat covers for cars that can't withstand paws and claws! This covering provides top-tier padding to protect from dirt, mud, water, and fur. UNIVERSAL FIT - These dog car seat covers are great for most cars, trucks, and SUVs. Use one as a cargo liner in the trunk, as a rear seat protector, or as a dog hammock for full coverage in the back. EASY TO CLEAN - Dreading the shedding? No worries. Even if your furry friend gets hair everywhere, our back seat cover for dogs is made with 600D Oxford waterproof cotton for fuss-free vacuuming and cleaning. SAFETY FIRST - 4 heavy-duty headrest anchors and 2 seat anchors keep this dog back seat cover secured in place on even the bumpiest of rides, so your pet doesn't slip and slide around. CUSTOMER SATISFACTION - Have any questions, comments, or concerns about your dog car seat cover for the back seat? Our team is happy to give you and your pup a helping hand (and paw)!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_35",
    "title": "Auroth Tactical Dog Training Harness No Pulling Front Clip Leash Adhesion Reflective K9 Pet Working Vest Easy Control for Small Medium Large Dogs Blue Camo L",
    "price": 22.09,
    "rating": 4.6,
    "rating_count": 49964,
    "image_url": "https://m.media-amazon.com/images/I/41eLCmpM4PL._AC_.jpg",
    "description": "EASY ADJUSTMENT: Put on and take off this product with 2 quick-release buckles with no hassle. 4 fully adjustable straps (2 Shoulder and 2 Chest) allow a snug fit with maximum mobility. DURABLE MATERIAL: Our heavy duty vest made of 900D Nylon with sturdy stitching for extra durability, suitable for all fields use. Two rings can bear great pulling force , ensuring your dog is safe during training, hunting, working, and any other occasions. Well padded in every pressure load point to protect your dog’s skin, while the breathable air mesh keeps your dog comfortable. Molle System Use: Two 1\" strips of Molle Sewn on both sides, allow your dog to carry gear in training. A wide range of use for personal service, law enforcement, hunting, or outdoor recreation. (Included ID Badge - BEST FRIEND ). It compatibles with Molle /PALs Pouch, so you can also hook dog bowl, water bottle and toys(No included). MAXIMUM CONTROL & SECURITY: Our safety harness features 2 metal leash attachment points to dog walks safely - One front clip for No-pull control or dog training, and the other one back clip for casual walking or jogging. SATISFACTION WARRANTY: Please reference to the sizing chart. Against any quality issues - Feel free to contact us if you have any questions, we are always here to help :)",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_36",
    "title": "Multipet International Look Who's Talking Cat Toy, Fish, 1-1/4-Inch, Multi-Colored, 3\", Small",
    "price": 7.99,
    "rating": 4.4,
    "rating_count": 19173,
    "image_url": "https://m.media-amazon.com/images/I/51KRGAv3V3L._AC_.jpg",
    "description": "Look Who's Talking Cat Nip infused talking cat toys. Just pull the plastic tab out to activate the voicebox. Once activated and the toy is moved,played with or batted around it makes bubbling sound that your cat will love. These unique talking cat toys are a great toy that your feline friend will play with over and over again. Talking Cat Toys Contains Cat Nip Not for Dogs Item Contains 2 LR44 1. 5V Button Cell Alkaline Batteries",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_37",
    "title": "Taglory Reflective Cat Collars Breakaway with Bell, 2-Pack Girl Boy Pet Kitten Collar Adjustable 7.5-12.5 Inch, Navy Blue",
    "price": 6.99,
    "rating": 4.5,
    "rating_count": 18018,
    "image_url": "https://m.media-amazon.com/images/I/518c+B25gfL._AC_.jpg",
    "description": "2 PACK COLLARS - Package: 1*Navy Paw Print Collar & 1*Navy Strip Collar, made of durable nylon fabric can stand up to daily use WELL-ATTACHED BELL is just loud enough to let you know where your cat/kitty is without being obnoxious. Also it is easily removable if needed. BREAK-AWAY CLASP will quick release under pressure if your cat get stuck up in something. It has just enough resistance in the break away part, not breakaway easily. Your cat's body weight would break it, but it will not come off from just scratching at it. REFLECTIVE PAW PRINT & STRIP– Highly reflective design works well to allow you to spot your cat in the dark of night with only a flashlight. NECK SIZE is adjustable for 7.5-12.5\", 3/8\" width, lightweight and no sharp edges of rough spots on the insides of the 2 pcs collars to chafe the cats neck.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_38",
    "title": "Good 'N' Fun Triple Flavor Wings, Made with Real Meat, Treats for All Dog Sizes",
    "price": 4.17,
    "rating": 4.7,
    "rating_count": 15906,
    "image_url": "https://m.media-amazon.com/images/I/51WP6JC-33L._AC_.jpg",
    "description": "Salix creates pet products for owners that have safety and health as their top priority. Salix ensures nothing but the best in quality material and design for your loved one. Don't settle for anything less, use Salix. Premium Beef Hide And Delicious Pork Hide Twist Wrapped In Savory Chicken Jerky Healthy Way To Satisfy Your Dogs Urge To Chew While Promoting Better Dental Hygiene By Reducing Tartar And Calculus Buildup Treat You Dog To Wildly Flavorful, Long-Lasting All Natural Combination Chews Kennel Tested And Preferred 38 To 1 Over Other Combination Dog Chews Premium beef hide and delicious pork hide twist wrapped in savory chicken jerky Healthy way to satisfy your dogs urge to chew while promoting better dental hygiene by reducing tartar and calculus buildup Treat you dog to wildly flavorful, long-lasting all natural combination chews Kennel tested and preferred 38 to 1 over other combination dog chews Four ounces of triple-flavor 5-inch wings with premium beef and pork hide twist wrapped in savory chicken Premium beef hide and delicious pork hide twist wrapped in savory chicken jerky Healthy way to satisfy your dogs urge to chew while promoting better dental hygiene by reducing tartar and calculus buildup Treat you dog to wildly flavorful, long-lasting all natural combination chews Kennel tested and preferred 38 to 1 over other combination dog chews Four ounces of triple-flavor 5-inch wings with premium beef and pork hide twist wrapped in savory chicken",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_39",
    "title": "ladoogo 2 Pack 5 FT Heavy Duty Dog Leash with Comfortable Padded Handle Reflective Dog leashes for Medium Large Dogs",
    "price": 14.99,
    "rating": 4.7,
    "rating_count": 21005,
    "image_url": "https://m.media-amazon.com/images/I/51QU3gInneL._AC_.jpg",
    "description": "FOAM HANDLE: no rope burns anymore, the Ladoogo dog leash inspired from fitness facility to added an ergonomic and comfortable foam handle that helps you maintain firm and comfortable grip without digging into your hands even when your dog pulls hardly PERFECT LENGTH: 5 ft length dog leash is a perfect balance between freedom and control, it gives enough freedom for your dog but everything in your control DURABILITY: Made of strong rock climbing rope and durable 360o tangle free and rustproof swivel hook that are stronger than other standard dog leashes REFLECTIVE: Highly reflective threads keep high visibility at night for safety 100% MONEYBACK GUARANTEE: All purchases are backed by a 12 months hassle-free warranty",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_40",
    "title": "SlowTon Dog Car Harness Seat Belt Set, Dog Vest Harness for Car Adjustable Mesh Breathable & Vehicle Safety Seatbelt Tether with Elastic Bungee for Small Medium Large Size Dogs Puppy Cats (Red,L)",
    "price": 14.99,
    "rating": 4.5,
    "rating_count": 15676,
    "image_url": "https://m.media-amazon.com/images/I/51eQyccJFPL._AC_.jpg",
    "description": "Excellent Construction --- Our breathable chest vest harness and straps are made of double mesh fabric with a flannelette edge to absorb moisture, making the harness breathable and comfortable for your dog. The attachable safety seat belt is made from durable and adjustable nylon straps to help protect your pet. Comfortable Design --- Lightweight, breathable fabrics and construction make it a pleasure for your dog to join you on adventures. The harness is highly adjustable and fits a wide variety of vehicle seats in seconds. The kit’s seat belt length also allows your dog move in the back seat and lay down. Safety --- The harness wraps securely around your dog’s body and it can also double as a walking collar – no need to remove/reattach the harness until you want to. Our straps tighten securely allowing some movement but preventing your pet from roaming unsafely around the car. Quick and Easy to Use --- There are two buckles on the chest straps making the harness easy to put on -- no need for your dogs to “step in”. The harness straps can be easily adjusted for maximum comfort too, making our product suitable for small, medium and large size dogs, or even cats. Seat belt straps are also adjustable and easy to attach. Wide and Further Application --- The harness can be used as a travel harness in the car to prevent dogs jumping out the window when go driving around. It also can be use a regular harness connects with the retractable dog leash as a regular harness.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_41",
    "title": "24\" New World Foldable Black Metal Dog Exercise Pen No Door",
    "price": 37.99,
    "rating": 4.7,
    "rating_count": 15731,
    "image_url": "https://m.media-amazon.com/images/I/511nJ3LtkNL._AC_.jpg",
    "description": "The New World Metal Exercise Pen / Pet Playpen provides a great enclosure to keep your pet safe and secure while indoors or outside. These Exercise Pens / Pet Playpens are made of durable metal wire that features a black E-coat finish for long lasting protection against rust and the elements. The New World Black Exercise Pen / Pet Playpen by MidWest Homes for Pets consists of 8 - 24\" wide panels and is available in 6 different heights. When fully expanded, the Exercise Pen / Pet Playpen provides your pet with 16 square feet of enclosed living area. Each durable metal Exercise Pen / Pet Playpen is simple to set up (no tools required) and includes 4 ground stakes for secure set-up while being used outdoors and 4 thumb-snaps for easy assembly. These versatile Exercise Pens / Pet Playpens can be used for a variety of pets and fold flat for convenient storage when not in use. Make sure to check out the additional Sunscreen or Wire Mesh Top for the Exercise Pen / Pet Playpen if you want to add additional security or shade to the pen when using it outdoors. As always, MidWest Homes for Pets stands behind the quality of our products with a 1 year Manufacturer's Warranty. Each panel measures 24\"W x 24\"H, Exercise Pen / Pet Playpen, dog exercise pen measures 62L x 62W x 24H when assembled & folds flat for convenient storage when not in use Exercise Pen provides 16 square feet enclosed area (1.5 meters) for your dog & other pets Includes 4 ground anchors for outdoor use and 4 thumb-snaps for easy assembly; Easy set-up & no tools required for assembly; Exercise Pen includes 1 year manufacturer's warranty Durable black e-coat finish on the Exercise Pen; Pet Playpen provides long lasting protection against rust and outdoor elements \"Celebrating over 100 years as a small, family-owned business that supports over 150 employees in the USA!\"",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_42",
    "title": "ThinkPet No Pull Harness Breathable Sport Harness with Handle - Reflective Padded Dog Safety Vest with Reflective Neon Dog Leash XL Harness Leash Pack Orange",
    "price": 39.99,
    "rating": 4.4,
    "rating_count": 15814,
    "image_url": "https://m.media-amazon.com/images/I/51xkxyUm6hL._AC_.jpg",
    "description": "Extra Large Dog Harness and Leash Set- X-Large size: chest girth 21-38 inch, neck girth 23-35 inch. Recommend chihuahua, havanese, corgi, pug, puggle, labrador, shiba, collie, springer and more. The dog harness for large dogs no pull is perfect gift for Thanksgiving, Christmas, New Year, etc. Durable & Escape-proof Harness- This pet harness features premium nylon that makes the harness robust against wear. Quick snap buckles make it easy to wear and off. Lock design ensure safety. Widened straps make pulling pressure evenly distributed to prevent pulling and choking. Padded Breathable Dog Vest Harness- Extra thick yet breathable inner layer of soft mesh optimized for skin ventilation and pet comfort. The mesh lining of the puppy harness prevents injuries and offer maximum protection. Reflective Dog Harness for Small Dogs- The padded dog harnesses for large dog no pull is equipped with fluorescent straps around, improves visibility in the dark. Ideal for everyday walking,night running,hiking,training,hunting,outdoor adventure and more. No Pull Dog Harness with Handle- This dog harness no pull own two metal leash D-rings. The BACK clip for casual walking and jogging while the FRONT clip is no-choke design, stopping pulling on walk, perfect for dog training or working. The padded soft handle for extra control to lead your dogs.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_43",
    "title": "SPOT by Ethical Products Skinneeez - The Original Stuffless Stuffingless Dog Toys - Squeak Toys Tug Toy Small Dogs and Large Dogs Puppy Chew Toy Alternative Interactive Dog Toy - Fox - Small",
    "price": 9.99,
    "rating": 4.3,
    "rating_count": 16737,
    "image_url": "https://m.media-amazon.com/images/I/31x1qXGDaoL._AC_.jpg",
    "description": "Fill playtime with surprise sounds and hard-to-resist crunch. Skinneeez, the original stuffing-free dog toy, now has an exciting twist - inner crinkle material, entices dogs/cats to play and have fun. Your pets love new, exciting sounds, and these extreme stuffingless durable squeaker octopus dog and cat toys, deliver unique inner crinkle that runs the length of the body. Our stuffing free skinneeez last longer than regular plush dog toys because there is no stuffing for your dog to rip out. Made of a durable and water-resistant polyester plush fabric, exteriors are available in unique animal styles. Periodically spot clean with cold water and a mild detergent. We recommend dogs be supervised when playing with all toys. Proper supervision can help prevent accidental swallowing of parts. Establish in 1952, Ethical Products in New Jersey, has a strong history of offering ethical manufacturing, SAFE, innovative and quality products at great value with superb customer service. STUFFINGLESS - What makes this toy different from all the other \"stuffed\" animals you have? This furry animal is STUFFINGLESS. The lack of stuffing in this toy makes it stand out as a dog toy that's made to last! Without stuffing the dog will be less inclined to destroy the toy and chew through the inside. Think no mess! No stuffing everywhere! We know your dog will have an absolute blast with this furry tugging toy! REALISTIC DESIGN - Dogs love and get excited by the idea of hunting and catching their prey! These Skinneeez were created strategically with a realistic animalistic design and feel to provide your dog with that extra level of stimulation and enjoyment. As he tugs on his furry friend he'll be filled with fulfillment and excitement that will keep him coming back for more! With this soft and fluffy toy, your puppy will be busy playing for hours! SQUEAK! SQUEAK! - In addition to the unique design this toy has to offer, we have not forgotten to include the basic squeaker every dog loves! S",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_44",
    "title": "rabbitgoo Cat Harness and Leash Set for Walking Escape Proof, Adjustable Soft Kittens Vest with Reflective Strip for Cats, Comfortable Outdoor Vest, Grey, S",
    "price": 14.98,
    "rating": 4.2,
    "rating_count": 15599,
    "image_url": "https://m.media-amazon.com/images/I/41lK2aXVrwL._AC_.jpg",
    "description": "Accurate Sizing For Extra Small Cats: Neck Girth: 6.6''-8.4'', Chest Girth: 9.0''- 11.0''. Please accurately measure your cat and refer to the size guide before purchase. Package include: 1*Cat Harness & 1*Nylon Leash(150cm) No Escape Again: This cat harness with leash set features the magic tape and back buckle design for secure closure to stop the cat slip out. And the vest-style design protects the neck of your cat against the pull and strain of a collar. You can share enjoyable walks, exercise and playtime outside with your kitty now Super Comfortable: This real comfy harness is made of superior fabric, with soft edge and air-mesh padding, which can effectively prevent injuries, giving extra comfort and protection. With this practical design, our cat harness gives your four-legged friend a snug fit and lets him stroll along with style and comfort on his daily walks Improved Safety Design: The fast-release buckle and metal D-rings for leash attachment ensure that your cat will stay securely in the harness while you are out on your daily walks. For additional safety, our escape-proof cat harness has reflective strips design, which can keep your kitty always visible even at night Easy to Wear and Adjustable Harness: Made for convenience and function, the vest design makes this harness easy to get on and off. And the adjustable strap creates a Perfect Fit for your kitty with some room of growth. (Tips: Please give your cat some time to get familiar with this harness for the first time use)",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_45",
    "title": "IRIS USA Premium Square Top Entry Cat Litter Box with Scoop, Kitty Litter Pan with Litter Particle Catching Cover and Privacy Walls, White/Gray",
    "price": 79.99,
    "rating": 4.6,
    "rating_count": 29305,
    "image_url": "https://m.media-amazon.com/images/I/312vPZ8s41L._AC_.jpg",
    "description": "Give your cat the privacy they need and keep the Fido’s nose out of the litter box with this unique IRIS all-in-one square top entry cat litter box. Large cat litter box includes grooved lid, outer and inner cover to prevent litter scatter and litter scoop, litter bag and litter tray for easy cleaning. Your cat will love the easy top access of this deep cat box that provides them room to move around and not make a mess. Large top entryway on the deep cat litter pan make easy entry and exit for cat. The grooves on the lid create a built in mat to prevent litter from scattering when leaving their litter box. The square shape with high walls and included litter bag make cleaning the top entry litter pan quick and effortless. Unique design between lid and box body lets you easily hang the included scoop for convenient storage. Sleek design of litter box complements any room décor. MADE IN USA with global materials - The IRIS USA top entry kitty litter tray offers a functional and aesthetically pleasing solution to your cat's bathroom needs. With the top entry kitty litter box, everything stays inside and out of sight, and the enclosed design lessens the prevalence of unpleasant odors in the room, something that's sure to make everyone in the family happy. TOP ENTRY - The top entry of the cat litter pan means more privacy for your cat, less litter spillage, and any spraying remains contained within the tall walls of the kitty litter box. It also functions to keep other pets, such as dogs, out of your cat's business, making for a stress-free environment for everyone. TIDY - The grooves in the lid catch any lingering litter particles on your cat's paws and keep them from spilling out onto the floor, keeping the area neat and clean and making clean-up a breeze. ORGANIZED - The included scoop features a hook, allowing you to hang it from the side of the kitty litter pan to store it between cleanings and have it within reach whenever it's needed, making the days of hunting ar",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_46",
    "title": "Joytale Updated Breakaway Cat Collar with Cute Bow Tie and Bell, Plaid Patterns, 1 Pack Girl Boy Kitty Safety Collars, Blue",
    "price": 6.99,
    "rating": 4.7,
    "rating_count": 15646,
    "image_url": "https://m.media-amazon.com/images/I/51LrNM2mYsL._AC_.jpg",
    "description": "Adjustable: Neck - 7 to 11 inch, Width - 3/8 inch; 100% cotton fabric, soft and comfortable, plaid design makes your adult cat, kitten and puppies adorable Updated Breakaway Buckle: Encountered danger, the safety buckle will be released quickly. Non-sharp edge design further protect the safety of kitties Bow Tie: The bow is tied to the collar with an elastic loop. Removable and Replaceable. Making your male and female kitten eye-catching Bell Accessories: With melodious sound, you will find your sweet baby kitty right now Multiple Colors & Packs: Pink, Red, Green, Blue, Haze Blue, Teal, Orange, Black plaid, Xmas pattern. Suitable for occasions such as daily wear, weddings, birthdays, Halloween, Christmas",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_47",
    "title": "Furhaven 44\" Round Cooling Gel Foam Dog Bed Microvelvet Snuggery w/ Removable Washable Cover - Silver, 44-inch",
    "price": 110.99,
    "rating": 4.1,
    "rating_count": 23663,
    "image_url": "https://m.media-amazon.com/images/I/41ASe6CTWGL._AC_.jpg",
    "description": "Cozy comfort with a cooling twist! Pets who love to burrow under the covers enjoy the Furhaven Microvelvet Snuggery Dog Bed. This bed features a soft extra layer of fabric over the sleep surface that can be used as traditional burrow \"blanket\" or (by inserting the provided flexible hoop) as a private \"cave\" for your pet. Private, snuggly and stylish, the soft microvelvet fabric will blanket your pet in comfort while the cooling gel top foam core soothes them to sleep. Our laminated gel foam top pet bed core features gel-infused memory foam that is pressure-activated to absorb your pet's body heat and disperse it away from their body to provide a cooling effect. Just like traditional memory foam, the gel top foam will conform to your pet's unique shape to provide the best support for joints and to relieve pressure points. We pair the benefits of cooling gel memory foam with a medical-grade polyurethane foam base to maximize its benefits and ensure the best support for your pet. All foam used in the manufacture of this product is made in the USA and has been certified and rigorously tested to ensure it meets standards for content, emissions and durability by CertiPUR-US. Easy to clean. Cover care: Remove from core before washing (see hang tag and/or seam label for care instructions). Foam care: Cooling gel foam is highly absorbent. Spot clean with mild soap or enzyme-based cleaning spray. Rinse but DO NOT SOAK OR SUBMERGE. Press out moisture with a dry towel and air dry. A fan may be used to speed drying. Do not wring or place in machine dryer. Dry completely before use. Not for unsupervised use by animals with destructive chewing behavior. COMFORT AS PRIORITY: The attached blanket can be used as is or converted into a burrowing cave with the included plastic tubing; either configuration creates a cozy and inviting space for pets that love to nestle and snuggle under the covers SLEEP SURFACE: Featuring cuddly soft micro velvet faux fur for enhanced snuggling and burro",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_48",
    "title": "Wondercide - Flea, Tick & Mosquito Spray for Dogs, Cats, and Home - Flea and Tick Killer, Control, Prevention, Treatment - with Natural Essential Oils - Pet and Family Safe - Lemongrass 4 oz",
    "price": 13.99,
    "rating": 4.2,
    "rating_count": 28853,
    "image_url": "https://m.media-amazon.com/images/I/31dYj-yfmEL._AC_.jpg",
    "description": "KILLS & REPELS. Using natural essential oils, this spray is proven to kill by contact, repel, and prevent 98-100% of fleas, ticks and mosquitoes in laboratory testing. It breaks the flea life cycle by eliminating eggs, larvae, and adults. TREAT NATURE WITH NATURE. When used as directed, a safe and effective alternative to collars, pills, chewables, and drops harnesses the power of nature. Holistic vet approved. Enjoy peace of mind knowing your pets and home are protected with our non-harsh formula. SAFE FOR DOGS, CATS OF ALL AGES WHEN USED AS DIRECTED. Gentle enough to use on puppies, kittens, and senior pets when used as directed. Powerful enough to fully eliminate pests on the skin and fur. Safe to use around the entire family, and kid-safe, when used as directed. Mom owned, Mom approved. 3-IN-1 PLANT-BASED SOLUTION. For dogs, cats, and home! A home remedy that kills fleas throughout the house on carpet, furniture, bedding, and flooring. Also a repellent in pet environments like dog kennels or cat condos. Invigorating Lemongrass scent freshens homes. POWERFULLY EFFECTIVE. Powered by nature and proven to work. Give your pet the advantage in protection against fleas and ticks with our non-harsh formula. Cruelty free and USA Made with U.S. and global components. Read entire label prior to use. Do not soak pet. Test a small area on the back of the neck 1 hour prior to full body application.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "pet_supplies_49",
    "title": "Jecikelon Pet Dog Clothes Dog Sweater Soft Thickening Warm Pup Dogs Shirt Winter Puppy Sweater for Dogs (Small, Brown)",
    "price": 10.99,
    "rating": 4.3,
    "rating_count": 33710,
    "image_url": "https://m.media-amazon.com/images/I/41YJvujG3XL._AC_.jpg",
    "description": "Material: Woolen Keeps your pet dog warmer and more cute Easy to wash and dry The sweaters are small in size and are not suitable for large dogs Please refer to Size Chart in Product Description as below",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  }
]