[
  {
    "sku": "tools_and_home_improvement_0",
    "title": "Chamberlain MYQ-G0402 Garage-Door-Sensors, White",
    "price": 19.99,
    "rating": 4.4,
    "rating_count": 88145,
    "image_url": "https://m.media-amazon.com/images/I/31BuHB99b+L._AC_.jpg",
    "description": "Add a second Door Sensor to control 2 garage door openers with you Chamberlain Smart Garage Control. Add the ability to monitor, open and close a second garage door opener with Smart Garage Control. Smart Garage Control is limited to controlling two garage door openers. Installation and Programming are easy: Mount to inside top panel of garage door and add to your existing myQ account through the myQ App. Important: This product works with the new Smart Garage Control (MYQ-G0401,MYQ-G0401 - E and 821LMC), and Smart Garage mdoels (MYQ-G0201 & 821LM) and Smart Garage Hub (MYQ-G0301,MYQ-G0301-E,MYQ-G0301-D,MYQ-G0301C,MYQ-G0301LA,821LMB). Each sold separately. The sensor provides low battery notifications through the myQ app.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_1",
    "title": "General Finishes Oil Base Gel Stain, 1 Gallon, Nutmeg",
    "price": 99.95,
    "rating": 4.7,
    "rating_count": 11634,
    "image_url": "https://m.media-amazon.com/images/I/511dWIXFLPL._AC_.jpg",
    "description": "These oil-based Gel Topcoats and Stains are quite possibly the easiest of all finishes to use and achieve a \"hand-rubbed\" look without all the work. Application is easy with a foam brush or lint free cloth. The heavy bodied gel formulation permits the product to flow out evenly (no drips or runs) preventing uneven penetration for consistent color control. Combined with no sanding (your choice to sand or not) between coats and a quick “re-coat” time, you’ll be finished sooner with less effort and better results than ever before. Plastic Gallon Jug - due to an metal can shortage, product may come in a plastic jug instead of a metal container Woodworkers love the lustrous finish that shows up Heavy-bodied, and so does not penetrate as deeply into the wood as liquid oil-base stains do Can help you get a more even appearance on difficult woods such as aspen or pine Easy-to-use stains simply wipe on with a cloth or applied with a foam brush (no spills or splashes)",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_2",
    "title": "Danco 1-1/4-Inch Rubber Drain Stopper, White, Carded, 80225",
    "price": 2.38,
    "rating": 4.3,
    "rating_count": 10718,
    "image_url": "https://m.media-amazon.com/images/I/31S2rKD-vwL._AC_.jpg",
    "description": "Product Description The Danco 1-1/4 in. Rubber Drain Stopper is designed for use in kitchen or bathroom sinks, as well as indoor or outdoor sinks. It is designed to keep objects and debris out of your drain so it will flow freely. This stopper helps eliminate clogs caused by foreign objects. It features a design that can be easily set in place or removed. This stopper is crafted with a white rubber for durability and longevity. This is the perfect sink drain stopper for you! From the Manufacturer Danco is one of the largest plumbing repair, replacement and remodel suppliers in the home improvement industry.  We are largely focused on empowering Do It Yourself consumers with affordable plumbing products and solutions which create new and refreshing décors for bathrooms and kitchens. Constructed of a stain-proof rubber for long-lasting Durability Split-type ring allows for bead-chain connection Designed for use with 1-5/8 in. Drains Protects drains from unwanted debris Designed for use in kitchen or bathroom sinks and tub/showers Can be used for indoor- and outdoor applications",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_3",
    "title": "Amerelle 149T4DB Chelsea Wallplate, 4 Toggle, Aged Bronze",
    "price": 9.91,
    "rating": 4.8,
    "rating_count": 14092,
    "image_url": "https://m.media-amazon.com/images/I/31ovRDTDh+L._AC_.jpg",
    "description": "Product Description ELEVATING STYLE: An Amerelle wallplate will give richness and elegance to your space and be the finishing touch to your home decor and home improvement projects. Our wide selection of wallplates are fit to match any decor style and paint finish. From the Manufacturer Due to continuing product development, the product you receive may look slightly different than the one displayed. ELEVATING STYLE: An Amerelle wallplate will give richness and elegance to your space and be the finishing touch to your home decor and home improvement projects. Our wide selection of wallplates are fit to match any decor style and paint finish. TRANSITIONAL: Create a unique environment that utilizes contemporary designs and a traditional flare with our transitional style wallplates LASTING VALUE: Know you are receiving a durable, long-lasting product when you buy an Amerelle wallplate. Made from the finest materials to maintain its finish for years. An Amerelle wallplate is an inexpensive upgrade to any home. SUPERIOR QUALITY: Amerelle wallplates are made with you and your home in mind. It is the finishing touches that make your home special. We provide top-notch products that are sure to last, so you and your family can focus on enjoying your home. PRODUCT DETAILS: Size: 4 Toggle Wallplate | Style: Transitional | Material: Steel | Finish: Aged Bronze | Dimensions: 0.25\" (L) x 8.125\" (W) x 4.875\" (H) | UL Listed, Screws and Mounting Hardware Included",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_4",
    "title": "Hotodeal KN95 Face Mask 20 PCS,5 Layers Cup Dust Mask Against PM2.5 from Fire Smoke, Dust, for Men, Women, Essential Workers",
    "price": 16.19,
    "rating": 4.5,
    "rating_count": 68667,
    "image_url": "https://m.media-amazon.com/images/I/51yjiIK5NpL.jpg",
    "description": "【Portable Protective Barrier】Easy to wear, no need to adjust it when you wearing. Soft elastic ear loop design helps eliminate pressure on the ears for comfortable experience. 【Tested Filter Efficiency≥95%】The filter efficiency of this KN95 mask is over 95%, which can protect you in the critical time. 【5-Ply Protective Layer】KN95 masks are made of 2 non-woven outer Layers, 2 melt-blown inner filter, 1 non-woven Cotton Middle Layer absorbs the moisture. 5-ply KN95 mask is designed to offer more protection than a standard disposable 3-Ply mask. 【Inserted Nose Clip-Anti Fall Design】--- The metal nose clip is fixed to the inner of the mask. you never need to worry about the Inserted nose clip falling off, and the flexible metal allows you to adjust the mask tightly fits your face. Disclaimer: This KN95 mask is NOT an N95 mask. For more information about KN95 masks please see the following before you purchase: amazon.com/AboutKN95s.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_5",
    "title": "InnoGear Solar Outdoor Lights, Solar Lights Outdoor Waterproof Solar Spot Lights Outdoor Spotlight for Yard Landscape Lighting Wall Lights Auto On/Off for Pathway Garden, Pack of 4 (Warm White)",
    "price": 55.99,
    "rating": 4.3,
    "rating_count": 23340,
    "image_url": "https://m.media-amazon.com/images/I/51qF6ANbA5L._AC_.jpg",
    "description": "Independently Adjustable Light & Panel: Other alternatives with combined light panel head could be very difficult to get enough solar absorption while pointing the light up. For InnoGear solar spotlight, you can easily rotate solar panel 180° up and down to capture sun energy effectively while obtaining the best lighting angle; the light head is 90° rotatable to illuminate any place that would be out of reach. Improved Brightness & 2 Working Modes: With super brightness, this solar spotlight can cast a focused ray to highlight your flagpole or beautiful sculpture, even on the darkest of nights. You have the option to set from High Mode (MAX 6Hrs) to Low Mode (MAX 12Hrs) to extend working time. Advanced 1.5W Monocrystalline Silicon Solar Panel: The solar energy conversion rate is 30% faster than the old versions by using upgraded technology and material. Solar spotlight detects the surrounding light condition and automatically turns on and off, a smooth panel surface keeps dirt and debris from accumulating and blocking sunlight. 2 Ways of Easy Installation: Package comes in a kit that includes all the tools you need to install the lights by either staking them into the ground or by mounting them onto a wall. Optimum for Patio Porch Path Deck Pool Yard Garden Garage Driveway Pathway, etc. Outstanding Durability & Quality Guaranteed: It's resistant to not just rain, but all types of extreme weather, like wind or burning sun. High quality certified by FCC, CE, RoHS, MSDS, UN38.3, etc.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_6",
    "title": "WECARE Disposable Face Masks For Kids, 50 Camo Face Masks, Individually Wrapped for School and Travel",
    "price": 9.99,
    "rating": 4.7,
    "rating_count": 10570,
    "image_url": "https://m.media-amazon.com/images/I/513iTVnUIsL._AC_.jpg",
    "description": "WeCare’s 3 Ply Kids Face Masks are as comfortable as a face mask gets! Each mask is individually wrapped and sealed, so your child can carry them around in their backpack, pocket, cubby, school desk and more. They come in the cutest colors and prints, and there are matching adult face masks available! These masks are designed to be pain free and comfortable. The fabric is soft and gentle on your skin. Details - 3 Ply Protection- Individually Wrapped- Disposable- Elastic Ear Loops- Latex Free- Painless- Comfortable and Adjustable- Box of 50- Kids Size: 5.7” x 3.7” WeCare Colors and Prints: - Blue- Black- Navy- Pink- Red- Grey- Green Camo- White Camo- Blue Camo- Red Plaid- Green Plaid- Tie Dye- Assorted Tie Dye- Unicorn- Butterfly- Fun Pack- Variety Pack Ear Loop closure PERFECT FOR KIDS: Sized at 3.7 inches x 5.7 inches, they fit comfortably on boys and girls. Do not use on a child under two years old. Now you can take your children with you to the store, go on trips, and send them to school or camp safely! READY TO GO: Each mask in this box is individually sealed so they are perfect to throw in your purse, handbag, or stash in your child's pocket or backpack and they will remain sanitary and clean! CUTEST COLORS & DESIGNS: Let your kid be the cutest boy or girl on the block with these adorable jewel tone printed masks. WeCare also has children’s masks in more than a dozen solid colors and fun prints, as well as matching adult masks. LIGHT & BREATHABLE: Designed for the utmost in comfort, these masks are painless and adjustable. They offer full coverage of the nose and mouth and allow kids to play and learn freely. 3 PROTECTIVE LAYERS: The innermost layer is super soft and gentle on the skin, and the outer leak-proof layer covers the protective layer. Latex free. An adjustable metal wire runs along the top as a nose clip.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_7",
    "title": "Rust-Oleum 249111 Painter's Touch 2X Ultra Cover Spray Paint, 12 oz, Gloss Hunter Green",
    "price": 6.19,
    "rating": 4.7,
    "rating_count": 66892,
    "image_url": "https://m.media-amazon.com/images/I/41sOg6ilClL._AC_.jpg",
    "description": "Product Description Painter's Touch 2X Ultra Cover spray paints offer superior coverage for faster project completion. They provide a tough, attractive finish on almost any interior/exterior surface. Designed with a comfort spray tip with a wider finger pad to reduce fatigue caused by continuous spraying. Convenient any angle spray applies easily leaving a rich, deep color that brings out the beauty in your project. From the Manufacturer Rust-Oleum Painter's Touch Ultra Cover contains breakthrough technology that provides twice the coverage on wood, metal, wicker and more*. It covers surfaces with less spray passes, allowing projects to be completed faster and easier. *Compared to competitive general purpose spray paints Ideal for use on interior/exterior surfaces including wood, plastic, plaster, metal, masonry and unglazed ceramic Oil-based formula is low odor, resist chips and provides long-lasting protection Dries to touch in 20 minutes and covers up to 12 sq. ft. per can Durable formula provides excellent hide and goes on smoothly Gloss finish provides a fresh, new look for surfaces Any angle spray Comfort spray tip Fast Drying Popular Colors This item is not for sale in Catalina Island",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_8",
    "title": "Dewalt DCD771C2 20V MAX Cordless Lithium-Ion 1/2 inch Compact Drill Driver Kit and 4-1/2” grinder (Tool Only)",
    "price": 198.96,
    "rating": 4.8,
    "rating_count": 43707,
    "image_url": "https://m.media-amazon.com/images/I/41M3K7OmtgL._AC_.jpg",
    "description": "Compact, lightweight design fits into tight areas High performance motor delivers 300 unit watts out (UWO) of power ability completing a wide range of applications 8,000 RPM motor provides high power for cutting and grinding applications Quick-Change Wheel Release allows for tool free wheel changes",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_9",
    "title": "Ergodyne Standard Hi Vis Bomber Safety Jacket",
    "price": 34.99,
    "rating": 4.6,
    "rating_count": 10574,
    "image_url": "https://m.media-amazon.com/images/I/41pcC4hFanL._AC_.jpg",
    "description": "The GloWear 8377 Type R Class 3 Hi-Vis Winter Bomber Jacket polyester outer shell with PU coating resists water and wind for warm and dry comfort all day. The black panels hide dirt and wear. Cuffs feature hook and loop straps to seal out the cold. POCKETS & ACCESSORIES Featuring two external front pockets for stashing gloves, phones and other gear plus an upper chest cell phone pocket. There are 2 mic tabs located on the upper chest of the jacket. ANSI-COMPLIANT This reflective coat is a Class 3 garment and features 2 ANSI-compliant reflective stripes for nighttime visibility. This safety high-visibility jacket is rated Type R Class 3 for increased visibility. Type R Class 3 garments feature more fluorescent background material and retroreflective material than other classes, to ensure maximum visibility and safety in all conditions. 100% Polyester Imported Polyester lining Zipper closure Machine Wash WIND + WATER RESISTANT - 300D oxford polyester outer shell + PU coating resists wind and water to keep you dry THERMAL INSULATION - 160g quilted insulation for comfortable warmth without extra bulk TYPE R, CLASS 3 - 2\" ANSI-compliant reflective material for night-time conspicuity DIRT-HIDING PANELS - Black panels on the sleeves and front of jacket to hide dirt and wear ADJUSTABLE INSET HOOD – With drawstrings and stoppers, easily zips in or out depending on weather conditions or personal preference EASY ON & OFF – Zippered closure POCKETS + ACCESSORIES – 1 cell phone chest pocket, 2 lower front pockets, 1 dual slot pen pocket, dual mic tabs",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_10",
    "title": "Pooqla Colorful LED Marquee Letter Lights with Remote – Light Up Marquee Signs – Party Bar Letters with Lights Decorations for The Home - Multicolor J",
    "price": 15.99,
    "rating": 4.6,
    "rating_count": 19088,
    "image_url": "https://m.media-amazon.com/images/I/41zPHTMxGSL._AC_.jpg",
    "description": "【Colorful Design】 Distinguished from the common warm white version, this upgraded marquee letter light can change 16 colors which provide more options of color choice. Get one to make your celebration more colorful. 【Specification】 Size approx(W x H x D): 4.96\" x 8.86\" x 1.77\" Made of Plastic, Requires 2 AA batteries, not included. Hanging holes and On/ Off switch on the back. Can be displayed stand alone or hang on the wall. 【Newest Remote Control】 With the old version of remote, you can only control On/Off and timing, but with our new remote, you can choose the color of light that you want with 4 light flashing modes like FADE, JUMP, ASYN FADE, ASYN JUMP for option. The most amazing thing is that you can even control the speed of flashing. 【Go get some lights to decorate your world】 26 Alphabet letters and & symbols provide endless possibilities of creating message. Spell out any name or phrase with these fabulous light up alphabet letters such as “BAR” in your wine rack, “LOVE” at a wedding or add initials to room. 【Decoration Alphabet Light】Color changing letter lights light up your favorite words for special occasion, event, Christmas, party, holiday, shows or home decoration. It is also a good gift for your friends.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_11",
    "title": "Rust-Oleum 7543838 Professional High Performance Enamel Spray Paint, 15 Oz, Gloss Safety Yellow",
    "price": 9.98,
    "rating": 4.7,
    "rating_count": 11851,
    "image_url": "https://m.media-amazon.com/images/I/41WP05aiFRL._AC_.jpg",
    "description": "Product Description Rust-Oleum Professional High Performance enamel spray provides excellent coverage and is tough enough for commercial applications. Paint provides a durable coating with superior protection from rust and excellent resistance to abrasion, fading, chipping or dulling. High output tip featuring any angle spray that works even when upside down, means quick and easy project completion. From the Manufacturer Rust-Oleum 7543838 High Performance 15-Ounce Professional Spray Paint Enamel, Safety Yellow Rust-Oleum Professional High Performance Enamel Spray provides superior coverage and hiding. Apply to metal, wood, concrete and masonry in heavy-duty and commercial environments. Retains color against the elements. Rust-Oleum 7543838 High Performance 15-Ounce Professional Spray Paint Enamel, Safety Yellow Features: Durable Rust preventive Fast drying 15-Ounce. Ideal for use on ferrous, non-ferrous metal, wood, concrete, masonry and other such surfaces to provide rust protection and a tough attractive finish that withstands weathering High quality, durable oil-based formula maintains consistent, corrosion-resistant color despite the elements Covers up to 14 sq ft, dries to touch in 15 minutes and recoats within an hour for quick project completion Commercial, industrial paint formula features a high output tip that can be sprayed at any angle Gloss finish provides a new look for surfaces and withstands demanding, heavy-use environments",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_12",
    "title": "Abyssaly White Wallpaper Peel and Stick Wallpaper 15.7 inch X 196.8 inch Self Adhesive Embossed White Removable Kitchen Wallpaper Vinyl Film White Textured Wallpaper Cabinet Shelf Paper",
    "price": 16.99,
    "rating": 4.2,
    "rating_count": 10703,
    "image_url": "https://m.media-amazon.com/images/I/41mSLeOYnwL._AC_.jpg",
    "description": "White Wallpaper -- Upgrade materials: After repeated testing and upgrading, our white wallpaper is designed to have a very suitable thickness and is not easy to tear. Even if pasted in a dark color, it can be easily covered White Wallpaper -- Embossing process: Our wallpaer can effectively reduce the generation of bubbles. The solid color gives the room a more advanced texture. Our backing paper is designed with a measure-and-cut grid which makes our wallpaper easy to cut and apply to any size bedroom wall White Wallpaper -- Easy to clean: The white wallpaper surface uses a PVC lamination film process, so it can effectively block the adhesion of stains. Wipe with a wet towel when cleaning White Wallpaper -- Self adhesive: Just peel and stick, no additional glue required. The size of this white peel and stick wallpaper is 15.7\" x 196.8\", it can cover 21.48 square feet White Wallpaper -- Tips: We are responsible for our products. If you have any questions, let me know by email in the order, we will give you a satisfactory answer",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_13",
    "title": "Filtrete 14x20x1 Air Filter, MPR 300, MERV 5, Clean Living Basic Dust 3-Month Pleated 1-Inch Air Filters, 6 Filters",
    "price": 36.99,
    "rating": 4.7,
    "rating_count": 155446,
    "image_url": "https://m.media-amazon.com/images/I/514IrdgKLTL._AC_.jpg",
    "description": "Product Description You run a tight ship at home, from floor to ceiling -- and everywhere in between. Unfortunately, ordinary home non-electrostatic air filters aren’t super effective at capturing unwanted particles. GOOD NEWS: The unique design of the electrostatically charged Filtrete Basic Dust Air Filter attracts -- and trap --more particles from your air through your heating and cooling system, making quality control a breeze. With each cycle through the filter, your indoor air becomes a little bit cleaner. Amazon.com The Filtrete 300 MPR dust reduction filter not only vastly improves the air quality in your home, it also keeps your air conditioning and heating systems running efficiently, saving on utilities and maintenance costs. The electrostatic filter attracts and captures airborne dust, pollen, and other large-particle contaminants to keep surfaces in your home clean and dust-free longer. With each pass through the specially pleated filter, the air in your living space improves, making for a healthier home environment. This high-performance filter outperforms comparable non-electrostatic fiberglass and washable and reusable one-inch filters. Electrostatic Design Captures More Particles The 3M dust reduction filter is made with both positively charged and negatively charged fibers that act like tiny magnets to attract air-polluting contaminants. Since particles in the air are either positively or negatively charged, they are attracted to and captured by the filter and kept out of your living space. Electrostatic filters, including the 3M dust reduction filter, perform better than comparable non-electrostatic fiberglass and washable/reusable filters, because they attract and capture the small, allergy-aggravating microparticles that non-electrostatic filters can't. Improves Indoor Air Quality With indoor air a surprising two to five times more polluted than outdoor air, the 3M dust reduction filter can make a difference in maintaining a healthier home envir",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_14",
    "title": "Minwax 71004000 Finish Penetrating Interior Wood Stain, 1 Gallon (Pack of 1), Ipswich Pine",
    "price": 31.07,
    "rating": 4.5,
    "rating_count": 8714,
    "image_url": "https://m.media-amazon.com/images/I/51J0tfwE9dL._AC_.jpg",
    "description": "Quickly and easily give your wood projects a beautiful, rich color with Minwax Wood Finish. This oil-based wood stain enhances the natural wood grain in just one coat and resists lapping for an even color. It’s perfect for interior wood projects such as unfinished wood furniture, cabinets, doors, trim, molding and floors, and can work on any bare or stripped wood surface. The special formula allows it to deeply penetrate wood pores within 5 minutes of application, and it dries in as little as two hours, making it possible to stain wood in just one day. To apply, just use a clean cloth or wood stain brush and apply in the direction of the grain. Wait 5-15 minutes and wipe away excess stain. The longer you wait, the darker/richer the color. Reapply coats for deeper color. Wait 4-6 hours before applying a wood sealer topcoat. Minwax is America’s leading brand of wood finishing and wood care projects. Since 1904, we have been inspiring consumers to Keep on Finishing. We offer consumers a complete line of products to meet every wood finishing need. RICH EVEN COLOR – Minwax Wood Finish is a deep penetrating, oil-based wood stain that provides beautiful color and enhances the natural wood grain in one coat. It’s perfect for interior staining projects such as wood furniture, cabinets, doors and more. QUICK DRYING – Staining interior wood has never been quicker. The special formula allows it to deeply penetrate wood pores within 5 minutes of application, resists lapping, and dries in two hours, making all your wood projects quick, beautiful and easy. EASY TO APPLY – Use a clean cloth or wood stain brush to apply this wood stain in the direction of the grain. Wait 5-15 minutes and wipe away excess stain. The longer you wait, the darker/richer the color. Reapply coats for deeper color. IPSWICH PINE WOOD STAIN – This natural wood stain provides a beautiful, light pine color. The light wood stain lets the natural beauty of the wood shine through, and it’s great for a wide variet",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_15",
    "title": "Delta Faucet Leland Touch Kitchen Faucet Brushed Nickel, Kitchen Faucets with Pull Down Sprayer, Kitchen Sink Faucet, Touch Faucet for Kitchen Sink, Touch2O Technology, Arctic Stainless 9178T-AR-DST",
    "price": 247.96,
    "rating": 4.5,
    "rating_count": 9984,
    "image_url": "https://m.media-amazon.com/images/I/31S8hNB04HL._AC_.jpg",
    "description": "Product Description Touch it on. Touch it off. Whether you have two full hands or 10 messy fingers, Delta Touch2O Technology helps keep your kitchen faucet clean, even when your hands aren’t. A simple touch anywhere on the spout or handle with your wrist or forearm activates the flow of water at the temperature where your handle is set. The Delta TempSense LED light changes color to alert you to the water’s temperature and eliminates any possible surprises or discomfort. Delta MagnaTite Docking uses a powerful integrated magnet to set your pull down sprayer precisely into place and hold it there so it stays docked when not in use. Delta ShieldSpray Technology cleans with laser-like precision while containing mess and splatter. A concentrated jet powers away stubborn messes while an innovative shield of water contains splatter and clears off the mess, so you can spend less time soaking, scrubbing and shirt swapping. Delta kitchen faucets with diamond seal technology perform like new for life with a patented design which reduces leak points, is less hassle to install and lasts twice as long as the industry standard. Kitchen sink faucets with Touch-Clean Spray Holes allow you to easily wipe away calcium and lime build-up with the touch of a finger. You can install with confidence. Industry standard is based on ASME A112.18.1 of 500,000 cycles. Flow rate: 1.80 gpm @ 60 psi, 6.8 L/min @ 414 kPa, fittings type: 3/8 inches compression fittings. From the Manufacturer Touch on. Touch off. With this Leland Single-Handle Pull-Down Sprayer Touch2O Kitchen Faucet in Arctic Stainless Featuring MagnaTite Docking, it doesn't matter if you have two full hands or ten messy fingers. Tap anywhere on the spout or handle of the faucet with your hand, wrist or forearm to start and stop the flow of water. Thoughtfully designed to make kitchen tasks easier, Touch2O Technology allows you to turn the faucet on and off with just a touch anywhere on the faucet's spout or handle. It was the firs",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_16",
    "title": "Dixie Belle Paint Company Chalk Finish Furniture Paint | Amethyst (16 Fl Oz) | Matte Deep Purple Chic Chalk Mineral Paint | DIY Furniture Paint | Made in the USA",
    "price": 31.45,
    "rating": 4.7,
    "rating_count": 8455,
    "image_url": "https://m.media-amazon.com/images/I/41p0rJfu95L._AC_.jpg",
    "description": "CHALK MINERAL PAINT – Amethyst is a rich, deep matte purple chalk mineral paint. The muted finish will add a soft and chic feel to your space on whatever you paint. Our chalk mineral paint is ideal for wood, metal, plastics, brick, stone, glass, concrete, and so much more. This paint goes a long way and because Amethyst is a dark color, you should only need 1-2 coats for your project. An 8oz container of this paint should cover about 38 sq. ft. CHIC FURNITURE PAINT – This rich color exudes elegance and can be paired with any paint color or style. The jewel tone color is the ideal furniture paint for chalk painting your furniture, cabinets, or any DIY project. Whether you use Amethyst in abundance or in moderation, this versatile color always conveys a sense of sophistication. No sanding or priming required. Excellent coverage, easy to distress. DIY PROJECTS – Because our chalk mineral paint is perfect for wood, plastics, brick, glass, and more it makes the perfect paint for any DIY project you have. Whether you are wanting to refinish your cabinets, dressers, tables, chairs, wardrobes, bookshelves or have art or craft projects, Dixie Belle has the paint for you. MADE IN THE USA – Dixie Belle Paint Company is a family-owned and operated company right here in the USA. Built on American values and true southern hospitality, our company strives to provide the best experience to anyone who chooses our products. Our products are Made in the USA.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_17",
    "title": "Ergodyne unisex adult 3-pk Cap, Lime, One Size US",
    "price": 23.05,
    "rating": 4.3,
    "rating_count": 7814,
    "image_url": "https://m.media-amazon.com/images/I/41CEIKWl6rS._AC_.jpg",
    "description": "The Chill-Its 6630 Skull Cap is a low-profile cap featuring a wide, absorbent terry cloth sweatband to manage perspiration away from your eyes, face and glasses. The Hi-Cool moisture management performance fabric is stretchy to fit most heads and can be worn under a hard hat or on its own to provide sun-blocking protection. This cap is available in multiple colors, including hi-vis lime for increased visibility in low-light environments. The low-profile design fits comfortably under a hard hat or helmet and is great for construction workers, landscaping, roofing, or anybody working in the heat. Can also be used to reduce the risk of heat stress while mountain biking, motorcycling, gardening, hiking, playing sports and more. 95% Polyester, 5% Rubber Imported MOISTURE-ABSORBENT - Wide, sweat absorbing terry cloth band lines the interior PERFORMANCE KNIT FABRIC - Hi Cool moisture management fabric ONE SIZE FITS MOST - Elastic band fits snug and comfortable to head MULTIPLE COLOR OPTIONS - Stars and Stripes, Camo, Red Western, Navy Western, Solid Blue, HI-Vis Lime, Flames, Skulls & Black LOW-PROFILE DESIGN - Fits comfortably under any hard hat or helmet Machine washable",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_18",
    "title": "Varathane 297427 Premium Fast Dry Wood Stain, Vintage Aqua, 32 oz",
    "price": 13.47,
    "rating": 4.6,
    "rating_count": 7535,
    "image_url": "https://m.media-amazon.com/images/I/51o7QzfWO-L._AC_.jpg",
    "description": "Varathane Premium Fast Dry Wood Stain is a high-performance stain enhanced with nano pigment particles. Nano pigments provide ultimate color quality and exceptional wood grain highlighting allowing for maximum color in one coat. Varathane Fast Dry Wood Stain seals wood pores and hardens in just one hour. Easily brushes on without the use of a pre-stain or wood conditioner. Ideal for use on all interior wood projects: furniture, cabinets, doors, trim and paneling One-coat coverage, fast-drying oil based formula Dries to the touch in just 1 hour and covers up to 275 square feet High performance stain system enhanced with nano pigment particles Highlights natural wood grain to reveal wood's beauty",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_19",
    "title": "Moen Engage Magnetix Spot Resist Brushed Nickel Multi-Function Handshower and Rainshower Combo Featuring Magnetic Docking System, 26009SRN, Pack of 1",
    "price": 122.32,
    "rating": 4.6,
    "rating_count": 7699,
    "image_url": "https://m.media-amazon.com/images/I/21gja+h46jL._AC_.jpg",
    "description": "Moen’s Engage Collection Features Magnetix, a magnetic docking system to make replacing your showerhead simple and easy. With six showerhead settings to choose from, creating an at home spa experience is within reach. SPOT RESISTANT: Spot Resist Nickel finish resists fingerprints and water spots for a cleaner looking bath MAGNETIC BASE: The magnetic docking system allows you to easily detach and use as a handheld shower head or effortlessly replace it to dock with the snap of a magnet CUSTOMIZE YOUR SHOWER: Multiple distinct shower settings gives flexibility and variety FLEXIBLE: Features a kink-free metal hose that extends reach and flexibility",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_20",
    "title": "Klein Tools RT250 GFCI Outlet Tester with LCD Display, Electric Voltage Tester for Standard 3-Wire 120V Electrical Receptacles",
    "price": 21.97,
    "rating": 4.8,
    "rating_count": 7255,
    "image_url": "https://m.media-amazon.com/images/I/41W11O-05nL._AC_.jpg",
    "description": "The RT250 is an electrical receptacle tester that tests the wiring conditions at an electrical outlet and inspects GFCI devices. The LCD displays the voltage, identifies the wiring fault, and the time required to trip a GFCI device. It is designated for use with North American 3-wire 120V electrical outlets. For more than 160 years, Klein Tools has manufactured premium-quality, professional-grade hand tools that deliver the performance, durability and precision needed to get the job done right. Our family of engineers, workers and craftsman continue to put six generations of expertise into every tool we create by using only the highest quality materials, superior workmanship, and keeping manufacturing as close to home as we can. Klein isn't just the name of our company, it's also our family name. And since we're an American company that's family-owned and family-run, you know you can count on us to be here tomorrow. Klein Tools doesn't just make great products, we make great products that stand up to the demands of the professionals who use them every day ... Since 1857. LARGE CLEAR LCD READOUT on receptacle tester to instantly view results without the need to look at a chart to understand results TEST GFCI TRIP TIME IN SECONDS to find out if the trip breaker is functioning DETECT WIRING FAULTS of open ground, open neutral, open hot, dual open (neutral and ground), reversed hot/ground, and reversed hot/neutral AUTO-HOLD FUNCTION is convenient for hard-to-reach outlets SAFE AND DURABLE TESTER for inspections on North American 120V outlets BRIGHT LED LIGHTS illuminate green and red for visual indicators TRUSTED SAFE with a safety rating of CAT II 135V",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_21",
    "title": "Waste King L-1001 Garbage Disposal with Power Cord, 1/2 HP & PF WaterWorks PF0989 Garbage Disposal Installation Kit, White",
    "price": 100.35,
    "rating": 4.5,
    "rating_count": 14819,
    "image_url": "https://m.media-amazon.com/images/I/31DyXbDXbBL._AC_.jpg",
    "description": "Waste King L-1001 Garbage Disposal with Power Cord, 1/2 HPWaste King L-1001: 1/2 horsepower garbage disposal with pre-installed power cord and sound insulation. Energy efficient permanent magnet motor and stainless steel swivel impellers help reduce jamming. Fast and easy to install with a removable splashguard that is easy to clean and replace. Rust and corrosion-proof glass-filled nylon grind chamber and drain housing. Continuous feed technology. Front-mounted reset button for easy use. Safe to use with properly-sized septic tanks.PF WaterWorks PF0989 Garbage Disposal Installation Kit, WhiteThis garbage disposal kit has all components needed to install a garbage disposal. It includes - (1) 1-1/2 inch OD x 6 inch flanged tailpiece, (1) 1-1/2 inch OD x 14 inch flanged tailpiece, (1) 1-1/2 inch OD x 7 inch slip joint drain arm, (1) slip joint end outlet tee, (1) 90 degree elbow, (1) rubber connection boot with barbed Adapter & clamps, (1) 1-1/2 inch OD wall drain trap, (5) 1-1/2 inch I. D. Polyethylene washers and (1) reducing washer. Product 1: HIGH-SPEED MOTOR: The 1/2 HP, 2600 RPM (115v) permanent magnet motor jams less. Has dishwasher hookup Product 1: EASY INSTALLATION AND CLEANING: EZ Mount for a quick and easy kitchen sink installation, removable splashguard for easy cleaning Product 1: 2 YEAR PROTECTION: 2-year Limited. Corrosion resistant grinding components Product 1: NO ELECTRICAL EXPERTISE NEEDED: Pre-installed power cord, no electrical work required Product 2: INCLUDES EVERYTHING YOU NEED TO INSTALL A GARBAGE DISPOSAL Product 2: EASY INSTALL - Quick and Simple Installation. Product 2: DO IT YOURSELF - Fro Wall Water Supply and Drain Product 2: 1-1/2\" (inch) OD PP Construction",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_22",
    "title": "STIKK Painters Tape - 3pk White Painter Tape - 1 inch x 60 Yards - Paint Tape for Painting, Edges, Trim, Walls, Ceilings, Finishing - Masking Tape for DIY Paint Projects - Residue-Free Painting Tape",
    "price": 13.97,
    "rating": 4.4,
    "rating_count": 7365,
    "image_url": "https://m.media-amazon.com/images/I/31aAstSLQ2L._AC_.jpg",
    "description": "Clean & Sharp Lines — For clean edges, tape around baseboards & trim with Stikk’s Painters Tape; Create sharp lines when painting with multiple colors or designs; No more paint drips or spills High-Quality Tape — Offers quick, easy removal with no tears or sticky residue; Medium tack adhesive adheres to semi-rough surfaces; Easily sticks to walls, trim, wallpaper, glass & wood; UV Resistant Multipurpose Paint Tape — Keep areas free of paint by taping off with painting tape; Works well for touch-up work & to guard floor, furniture, & trim; Use to create color-blocking effects or patterns Easy to Use & Remove — Clean & dry the surface; Apply the tape slowly, press down firmly, & let it set; Apply the paint; When paint is dry, remove tape at a 45-degree angle; Up to 14 days clean removal Painter Tape for DIY — Comes in 60-yd rolls of varying widths & multiple pack sizes to suit any DIY project; Professional painter’s quality at an affordable price; Works for all home painting projects",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_23",
    "title": "Klabb Shower Hose, 59 Inches Extra Long Chrome Handheld Shower Head Hose With Brass insert and nut",
    "price": 8.99,
    "rating": 4.5,
    "rating_count": 7483,
    "image_url": "https://m.media-amazon.com/images/I/51H4YzrGfzL._AC_.jpg",
    "description": "Long hose 59 inches extend to 70 inches chrome shower hose,double lock hands shower hose Brass spin inner core made, flexible and never worry about twine Chrome finishes resist corrosion and tarnishing, high pressure resistance Rigorously tested to ensure quality performance, fits all standard mounts and hand showers inside high quality PVC tube and rubber washer no smell.we will reply you in 12 hours if you have any question",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_24",
    "title": "Better Blue Poly Tarp 20' x 20' - Multipurpose Protective Cover - Lightweight, Durable, Waterproof, Weather Proof - 5 Mil Thick Polyethylene - by Xpose Safety",
    "price": 43.99,
    "rating": 4.1,
    "rating_count": 7095,
    "image_url": "https://m.media-amazon.com/images/I/61Dw1pZ6WzL._AC_.jpg",
    "description": "Polyethylene HIGH QUALITY: With 5 mil thick polyethylene, this lightweight tarpaulin can be used for almost anything; cover equipment & machinery, construction sites, painting or furniture covers. ULTIMATE PROTECTION: Protect your belongings against the forces of nature - during heavy rain and snow storms, our blue tarp will keep your stuff as undamaged and dry as possible. AMAZING VERSATILITY: Multiple sizes let you cover almost anything - cars, boats, motorcycles, grills, tables, benches, roofing & more! FINISHED SIZE: Xpose Safety Premium Tarps Run True to Size. ENHANCED REINFORCEMENT: For extra support, poly rope is sewn into the hem from end to end on all sides to defy tearing and deformation – boosted durability and security. ADDED RESISTANCES: Aluminum grommets, shrink-proof, UV treated for to defend against the sun, and are all added to make our tarps even stronger!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_25",
    "title": "Vyzor Face Shield With Glasses Frame 50PK - Safety Face Shield For Face Mask Shield - Anti Fog Face Shield Mask - Plastic Face Shield With Clear Face Shield - Face Sheild - Faceshield For Women & Men",
    "price": 39.99,
    "rating": 4.5,
    "rating_count": 8119,
    "image_url": "https://m.media-amazon.com/images/I/5110VSjIoVL._AC_.jpg",
    "description": "Lightweight and protective. Made out of superior materials (PC Frame - 69%, PET Sheet - 31%) the transparent VYZOR face shield for glasses wearers and non-glasses wearers is lightweight and at the same time incredibly sturdy and protective. Not only are they lightweight and comfy but they also give you an additional layer of safety. This goggle face shield can help protect against droplets and saliva of other people. Comfortable fit. With supportive and seemless supportive goggles this plastic face shield is so comfortable that you'll forget you're wearing one! Taking your safety seriously does not mean you have to be uncomfortable! They measure 9.8 x 7.6 Durability. These VYZOR glasses face shield protection are made with durable materials which provide top protection, durability and a premium look. We made significant adjustments to the standard design that was on the market in order to provide the absolute best user experience for your face mask with eye shield. Crystal clear transparency. These face shields with glasses frame were engineered with highly reliable anti-fog and anti-blur coating. The VYZOR face shield ensures that you have clarity of vision at all times. We guarante absolute transparency, comfort and clarity. Live your life with the extra layer of protection you deserve. Better be safe!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_26",
    "title": "HYRIXDIRECT Broom Holder Wall Mount Broom Organizer Mop Holder Hanger Garden Tool Organizers Storage Rack Garage Laundry Room Organizations and Storage with Hooks Heavy Duty",
    "price": 11.99,
    "rating": 4.7,
    "rating_count": 17413,
    "image_url": "https://m.media-amazon.com/images/I/51ivRRmwfFL._AC_.jpg",
    "description": "Multi-purpose mop hanger -Whether indoor or outdoor, The Heavy Duty mop holder can help you save space,Perfect for the kitchen, closet, bathroom,garage, utility room, office and ect. Save Your Space - SAY NO To messy closet or loose items laying around. Tidy up your broom, mop, rakes, garden tools and more! Compact sizing and clean design garage organization systems is your perfect choice NO-SLIDE Design Broom Organizer- 5 spring-loaded slots with rubber grips that hold tightly to tool handles to keep them firmly in place. 6 Heavy Duty hooks are movable. Easy installation in minutes - Included with wall mounted broom holders are all the stainless steel screws and anchors,installation Manual",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_27",
    "title": "HANDLANDY Leather Work Gloves Mens & Women, Utility Safety Mechanic Working Gloves Touch Screen, Flexible Breathable Yard Work Gloves (Large, Brown-Cowhide Palm)",
    "price": 18.8,
    "rating": 4.4,
    "rating_count": 6935,
    "image_url": "https://m.media-amazon.com/images/I/51eBmmihuKS._AC_.jpg",
    "description": "Breathable work gloves with comfortable fit for light duty chores Imported Flexible & Breathable Work Gloves: Stretchable spandex design back keep your hands cool and comfortable on the job. Please Note: These work gloves are design by MEN size. RUN LARGE for women, please contrast the Size Chart in the picture 6th before order. Cowhide Leahter Work Gloves - Soft & comfort grain cowhide leather palm, durable and perfect fit proving good flexibility and grip while working any job. Terry Cloth On The Thumb: More convenient to wipe your face and sweat away while staying focused on the task at hand. Utility Work Gloves with Padded Palm & Knuckle: Synthetic leather palm with foam padding provides hands better support & all-day comfort, gives extra protection from vibration & impact while allowing flexibility. Easy On, Easy Off：Supportive neoprene cuff with with hook& loop strips closure cuff for snug secure fit.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_28",
    "title": "X3 Black Nitrile Disposable Industrial-Grade Gloves 3 Mil, Latex and Powder-Free, Food-Safe, Non-Sterile, Lightly-Textured",
    "price": 12.25,
    "rating": 4.6,
    "rating_count": 20400,
    "image_url": "https://m.media-amazon.com/images/I/41Pi4bNPSmL._AC_.jpg",
    "description": "Nitrile Made in the USA or Imported Pull On closure LIGHT-DUTY PROTECTION: Constructed from 3-mil nitrile, our gloves deliver reliable lightweight barrier protection against many common cleaning solutions, hair dye, and other non-hazardous materials. COMFORTABLE FIT & FEEL: Highly elastic, nitrile provides a comfortable fit and feel rivaling that of latex. Ideal for applications requiring frequent glove changes such as food preparation/handling. LATEX & POWDER-FREE: Ideal for use by individuals allergic or sensitive to natural rubber latex and powder-free so no messy residue is left behind. Best suited for short-duration and light-duty tasks. BEST VALUE IN NITRILE: Designed and priced for lightweight use, X3 nitrile gloves are commonly bought for chef/food service, janitorial, household cleaning, salon, and quick lube shop applications. BLACK COLOR: Black color easily conceals dirt, grease, and grime maintaining a professional look making it a go-to for front-of-house restaurant staff and barber shops alike. *Also available in Blue.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_29",
    "title": "Gorilla Wood Glue, 4 Ounce Bottle, Natural Wood Color, (Pack of 6)",
    "price": 20.94,
    "rating": 4.7,
    "rating_count": 14087,
    "image_url": "https://m.media-amazon.com/images/I/518CPz+IStL._AC_.jpg",
    "description": "Gorilla Wood Glue is the reliable glue for woodworking that woodworkers, carpenters and hobbyists trust for their projects. Gorilla Wood Glue, a PVA glue, offers the benefits of an easy-to-use water based adhesive. Simply clean up by wiping off glue when wet and shave or sand when hardened. Easily remove from hands by washing with warm soap and water. Gorilla Wood Glue can also be thinned out by adding water (not to exceed 5% weight). Gorilla Wood Glue's premium formula creates a cross-linking bond to provide superior strength indoors or out while passing ANSI/HPVA Type II water resistance. Complete projects fast with Gorilla Wood Glue as it only requires 20-30 minutes of clamp time and is fully cured in 24 hours. Ideal for use on hardwoods, softwoods, and natural wood composites. Dries a translucent tan color to create a natural bond line with no foaming, no orange after glow. Is also paintable and sandable to accommodate for different wood colors and project needs. Gorilla Wood Glue can also be sealed and used as a wood filler. Complete Projects Fast: Requires only 20-30 minutes of clamp time, fully cured in 24 hours. Quickly creates an incredibly strong bond for wood projects. Use Indoors or Outdoors: Passes ANSI/HPVA Type II water resistance. Can be used for all sorts of woodworking projects and repairs as an interior or exterior glue. Versatile: Ideal for use on hardwoods, softwoods, and natural wood composites. Is a great wood super glue for a wide variety of wood types and materials. Dries Natural Color: Offering a natural bond line with no foaming. Is also paintable and sandable to accommodate for different wood colors and project needs. Easy-To Use & Water-Based Adhesive: PVA glue that is easy to use and clean up if needed. Simply wipe off glue when wet and shave or sand when hardened. Remove from hands with warm soap and water.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_30",
    "title": "Vekkia 3000K Warm LED Lightweight Book Light Rechargeable-Book-Light-Reading in Bed at Night,3 Brightness,Reading-Light Easy Clip on, Great Gift for Readers",
    "price": 8.99,
    "rating": 4.8,
    "rating_count": 11356,
    "image_url": "https://m.media-amazon.com/images/I/41nG5GsM+UL._AC_.jpg",
    "description": "[Enjoy Your Bed Reading Time] Vekkia book light eliminates 99% of harmful blue light so that they give off a gentle, calming light that’s ideal for night reading and falling asleep quicker. Although the lowest setting is usually bright enough, our book light has 3 brightness modes, this upgraded reading light will stimulate your body to produce more melatonin naturally. Thus you will get a sweet sleep after reading. [80+ Hours Free From Charging]No more wasting money on batteries! Our reading lights for books in bed come with a built-in rechargeable battery, letting you enjoy up to 80 hours of reading time (at the low brightness setting).  It means you are far away from charging for at least 2 weeks if you read 30 minutes every day. With the provided USB cord, 1.5 hours only for a full charge.No more worries about the battery life. [Super Lightweight & Clip-on Design]The reading light is 2.01 oz ONLY. The lightweight and compact book light for reading in bed only needs a little space to easily carry around. The clamp opens about 1.8 inches and clips on book or kindle perfectly and tightly. The clip can be opened wide enough to be fixed in various objects. Anti-slippery pads protect your beloved books from being scratched or pinched. It can also stand on your table or desk. Very convenient. [Not Disturb the others] The Warm light for general reading brings sweet & romantic feelings. The mode comes with 3 brightness levels. The dimmable book light is bright enough for reading, knitting, sewing & craft, or dim enough to not disturb the others. [Product Guarantee] 1.Original patent applied. 2.FCC, CE, approved. Safe & Easy use for kids. 3.Worry-free & hassle-free 3-years WARRANTY with friendly customer service. 4.Product Box Contains:1×LED Book Light 1×USB Charging Cable 1×User Manual. 5.NOTE: NO ADAPTER INCLUDED.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_31",
    "title": "Waterpik High Pressure Powerpulse Massage Hand Held Shower Head, 2.5 Gpm, Brushed Nickel Detachable Shower head with 7 Spray Settings and 5' Hose, XRO-769",
    "price": 49.98,
    "rating": 4.5,
    "rating_count": 5421,
    "image_url": "https://m.media-amazon.com/images/I/41uUMbzexbL._AC_.jpg",
    "description": "Rejuvenate, refresh, and renew with Waterpik High Pressure Powerpulse Massage Hand Held Brushed Nickel Detachable Shower Head with 7 Spray Settings and 5' Hose, XRO-769. Featuring a patented PowerPulse therapeutic-strength massage spray, this chrome shower head has up to 2X the shower massage force vs. other retail market shower heads to transform showers into something extraordinary. The 7 different shower spray modes give you the power of choice, whether you want full-body coverage, a lighter trickle, or a PowerPulse water massage. This PowerPulse massaging shower head is clinically shown to help soothe muscle tension, increase flexibility, and promote restful sleep. On top of helping with tense muscle relief, this handheld shower head comes with a 5-foot shower hose to make shower time and shower clean up easy and convenient. It also includes anti-clog nozzles. You can easily install this 2.5 GPM Waterpik shower head by yourself in minutes without the help of a plumber. Waterpik PowerPulse is the FDA registered shower head with wellness benefits. Due to regulatory requirements related to replacement shower head flow rates, not for sale in certain states, including CA, CO, HI, MA, ME, NJ, NY, OR, RI, VT, WA. HIGH PRESSURE HANDHELD SHOWERHEAD: Rejuvenate with this brushed nickel 7-mode handheld shower head featuring our patented PowerPulse therapeutic-strength massage spray that delivers up to 2X the massage force 7 SPRAY SETTINGS: This hand held shower head offers a range of modes to meet your needs including full body spray, PowerPulse Massage spray, power spray, and more, PowerPulse Massage is clinically shown to help soothe muscle tension, increase flexibility, and promote restful sleep HANDHELD SHOWER WITH ADJUSTABLE BRACKET: Use as an overhead shower by placing the handle in the included adjustable bracket holder or as a shower head with handheld spray with 5-foot hose DIY EASY INSTALLATION: This handheld shower head installs in minutes on any standard shower",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_32",
    "title": "Command 17212-ES Easel Back Picture Plastic Hanging Strips, White, 2 Count",
    "price": 3.84,
    "rating": 4.6,
    "rating_count": 16867,
    "image_url": "https://m.media-amazon.com/images/I/417qZURGlPL._AC_.jpg",
    "description": "Command Easel Back Picture Hanging Strips make hanging your table top frames quick and easy. Simply place one spacer strip between one pair of picture hanging strips and you have the extra thickness that allows you to hang table top frames on the wall without easel interference. Best of all, when you are ready to take down or move your pictures, they come off cleanly no nail holes or sticky residue. Command Easel Back Picture Hanging Strips hold most 11\" x 14\" frames, up to 5 pounds. INCLUDES- 2 pairs of white medium strips; 1 strip holds 5 lbs ORGANIZE DAMAGE-FREE- Quickly and easily hang your tabletop frames without worrying about easel interference NO TOOLS REQUIRED- Say goodbye to screws, nails, and tacks leaving unsightly holes in your walls STRONG HOLD - These strips help you lock your picture frame in place for a strong hold that removes cleanly when its time to redecorate REMOVES CLEANLY- When you are ready to redecorate, they come off clearly, no nail holes or sticky residue",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_33",
    "title": "FORIOUS Kitchen Faucet with Pull Down Sprayer, Commercial Spring Kitchen Sink Faucet with Pull Out Sprayer, Single Handle Kitchen faucets with Deck Plate, Brush Nickel",
    "price": 43.99,
    "rating": 4.5,
    "rating_count": 5202,
    "image_url": "https://m.media-amazon.com/images/I/31jFq1fx5+L._AC_.jpg",
    "description": "Let's start the game !!! The FORIOUS mission: We develop kitchen faucet with sprayer that you can rely on, and we understand that functionality and dependability are achievable without drastically higher prices. We Care About Your Health: Eco-friendly SUS 304 stainless steel pull out kitchen faucets, complied with lead-free regulation, put your family's health first. High-arch Spout Design: 360 degree swivel sprayer and spout with 2 function head(stream and Spray), stream for filling water, spray for rinsing. NEOPERL Aerator with Thermal Insulating Plastic Head. CEC listed. Flow Rate: 1.8 Gallons Per Minute. Easy install: Quick Connect hose can help you install by yourself with 15mins, deck plate can fit 1 hole and 3 hole kitchen sink. Lifetime back: Super Brushed Nickel Fingerprint Resistant Finish, rust and corrosion resistance.Also supply life time warranty. Reliability is the biggest significance of utility sink faucet with sprayer.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_34",
    "title": "ACKTRA Ultra-Thin PU Safety WORK GLOVES 12 Pairs, WG002 Yellow/Black, Large",
    "price": 17.75,
    "rating": 4.3,
    "rating_count": 5227,
    "image_url": "https://m.media-amazon.com/images/I/51mQcxEmWJL._AC_.jpg",
    "description": "SEAMLESS NYLON SHELL FOR MAXIMUM DURABILITY. We want you to feel great while working on your next project. That is why we used the best material to produce Acktra Work Gloves. For this model, we use a synthetic shell, which is stronger than cotton. You will use them 2-3 times longer than your regular work gloves. COATING FOR BEST GRIP. Our coating gloves offer a special polyurethane coating for the palm and finger parts of the gloves. This coating will make your grip easy and at the same time will maintain all tactile senses. These gloves are perfect to work in almost any environment because our coating is not permeable for dust or fluids. FOUR SIZES AND SIX COLORS. Different sizes and colors are available to satisfy even highly demanding customers. We keep a broad spectrum of items to meet your size and color preferences. Choose between small, medium, large or X-large sizes. Pick black, red, blue, yellow, grey or white to your satisfaction. Why not look stylish when you work? WE PRICE OUR PRODUCT VERY CAREFULLY. We do not want you to spend a lot, we want you to be happy and remain our customer. That is why we offer the lowest price on the market. You pay just $1.32 per pair of gloves! If our gloves do not meet your expectations, we will give you a full refund, no questions asked. WE ARE HAPPY WHEN YOU ARE HAPPY. We do everything to provide you with the best customer experience. If you are satisfied or not happy with our product, please give us a review/feedback. It will help us further develop our business to fully satisfy our customers.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_35",
    "title": "SGT KNOTS Marine Grade Shock Cord - 100% Stretch, Dacron Polyester Bungee for DIY Projects, Tie Downs, Elastic Cord, Commercial Uses | 3/16 inch x 25 feet, Pink",
    "price": 12.95,
    "rating": 4.7,
    "rating_count": 5605,
    "image_url": "https://m.media-amazon.com/images/I/61t3-mJhZKL._AC_.jpg",
    "description": "Industrial Strength Shock Cord - Top-quality marine grade shock cord with industrial level strength, stretch, and longevity! High Quality distinctive design that is built to last. Proprietary Dacron Polyester Shell: - Our proprietary design and construction provide long-lasting resistance to all-weather environments and UV rays. The 1000 denier dacron polyester shell covering repels water and defies abrasion even better than nylon. Long Lasting 100% Stretch: Guaranteed to hold elasticity longer than other bungee, and shock cords on the market. First extruded latex rubber holds a consistent 100% stretch and high modulus. Sizes and Colors: 41 Sizes and 20 Colors For Any Situation: Eight Diameters: 1/8\", 5/32\", 3/16\", 7/32\", 1/4\", 9/32\", 5/16\", 3/8\". Six Lengths: 10ft, 25ft, 50ft, 100ft, 500ft, and 1000ft. Nineteen Colors: Black, Brown, Emerald Green, Kelly Green, Maroon, Midnight Blue, Neon Green, Neon Orange, Neon Yellow, OD Green, Pink, Purple, Red, Royal Blue, Silver, Tan, White, Woodland Camo, and Yellow. Veteran Owned and Operated: Just like the Marine Corps, SGT KNOTS is committed to be the best of the best. We continue to live by the motto, Semper Fidelis—Always Faithful. Our loyalty to our customers is what makes us who we are, and the reason we continue to grow in popularity and product offerings. We promise to maintain the strength and consistency of our products. We also pass down our bulk savings to our customers!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_36",
    "title": "TEKTON 1/2 Inch Drive x 32 mm 6-Point Impact Socket | SID22132",
    "price": 11.0,
    "rating": 4.8,
    "rating_count": 5006,
    "image_url": "https://m.media-amazon.com/images/I/31Kzm3OROdL._AC_.jpg",
    "description": "TEKTON impact sockets have both a high-visibility laser marking and a permanent stamped marking that won't wear off. They're designed for use with both friction ring anvils and detent pin anvils. Precise 6-point openings provide an exact fit for hex fasteners. Each socket size meets a minimum of 1.3 times the ANSI/ASME standard for proof torque. Size is marked both with a high-visibility laser marking and a permanent stamped marking that won't wear off 6-point socket opening provides an exact fit for hex fasteners Radiused corners prevent fastener round-off by applying force to a fastener's flat sides, rather than its corners Meets a minimum of 1.3 times the ANSI/ASME standard for proof torque Overall Socket Length: 1.78 inches",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_37",
    "title": "IRWIN VISE-GRIP GrooveLock Pliers Set, V-Jaw, 2-Piece (2078709)",
    "price": 33.21,
    "rating": 4.8,
    "rating_count": 4909,
    "image_url": "https://m.media-amazon.com/images/I/41m257FlZUL._AC_.jpg",
    "description": "Product Description The IRWIN VISE-GRIP GrooveLock Pliers Set features V-jaw pliers fitted with non-slip, anti-pinch, ProTouch grips for increased comfort and reduced hand fatigue. GrooveLock pliers utilize the Press-n-Slide button for 2X faster adjustment than traditional groove joint pliers. GrooveLock V-jaw pliers deliver more groove positions for optimum hand placement and are crafted with a Metal Injection Molding (MIM) process that ensures precision and long life. Includes 8\" and 10\" IRWIN VISE-GRIP GrooveLock Pliers with V-Jaws.. From the Manufacturer Irwin Industrial Tools 2078709 2-Piece GrooveLock Clamshell Set - 8-Inch and 10-Inch. A wide variety of set, including both pliers and wrenches Press-n-Slide buttons adjust lower jaws 2X faster than traditional groove joint pliers All purpose v-jaws grip on round, flat, square and hex shapes More groove positions provide the optimum hand location for a better grip on the work piece Non-slip, anti-pinch ProTouch Grips provide extra comfort and reduce hand fatigue Ratcheting action allows GrooveLock pliers to be adjusted from the open position up to the work piece by pushing the handle up without press the button IRWIN VISE-GRIP pliers set includes 8-inch and 10-inch GrooveLock locking pliers Each pair of locking pliers has a press-and-slide button that quickly adjusts the lower jaw All-purpose jaw grips on round, flat, square and hex shapes More groove positions provide the optimum hand location for a better grip on the workpiece ProTouch grips provide extra comfort and help reduce hand fatigue while using each pair of locking pliers",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_38",
    "title": "Great Eagle Lighting Corporation BR30 LED Bulb, 11W (75W Equivalent), 850 Lumens, 3000K Soft White Color, for Recessed Can Use, Dimmable, and UL Listed (Pack of 6)",
    "price": 19.95,
    "rating": 4.4,
    "rating_count": 9097,
    "image_url": "https://m.media-amazon.com/images/I/316CpFFBDPL._AC_.jpg",
    "description": "Reduce energy usage by 88% UL Listed 11 Watt LED replaces 65W and 75W Halogen and Incandescent Light Bulbs. High Quality BR30 Available on Amazon! LED Compatible dimmer switch is a must for fully dimmable smooth flicker-free performance and maximum life. Instant On Full Brightness / High Brightness 850 Lumen Soft White 3000K Color. Super Clear, High CRI, and Accurate Lighting. Best LED Replacement for BR30 and R30 Halogen and Incandescent Bulbs Available Perfect fit for Recessed Housings and Track Lights. Support and Warranty from American Company.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_39",
    "title": "DEWALT 20V MAX XR Impact Wrench, Cordless, 1/2Inch, 700-lbs of Torque, 2,400 IPM, Bare Tool Only (DCF899HB)",
    "price": 279.99,
    "rating": 4.8,
    "rating_count": 5127,
    "image_url": "https://m.media-amazon.com/images/I/41PLsoQy7yL._AC_.jpg",
    "description": "The DCF899HB 20V MAX* XR Brushless High Torque 1/2-inch Impact Wrench w. Hog Ring Anvil is powerful and versatile for fastening various applications. DEWALT impact wrench is designed for comfort, speed control, and working in dark spaces. 1/2 inch cordless impact wrench has up to 700 ft-lbs of max torque and 1200 ft-lbs of max breakaway torque DEWALT 1/2 inch impact wrench has a compact design of 8-13/16-inch length Multi-speed control of the battery-powered impact wrench is made for a variety of applications (0-400/ 1,200/ 1,900 RPM) 1/2-inch Anvil with hog ring (also available in detent pin) LED light with 20-second delay for increased visibility",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_40",
    "title": "32 Pcs Chair Leg Covers, Chair Leg Protectors, Chair Leg Caps, Chair Floor Protectors for Hardwood to Prevent Floor Scratches and Reduce Noise, Fit 1\"-1.14\"",
    "price": 11.99,
    "rating": 4.1,
    "rating_count": 9742,
    "image_url": "https://m.media-amazon.com/images/I/41eEs+EnTZS._AC_.jpg",
    "description": "NO MORE NOISE AND SCRATCH FLOORS! Let us say goodbye to scratches and noise when moving your furniture. The furniture floor protectors specifications:  Color: Clear  Shape: Round base and mouth  Material: Silicone + Felt Pad  Weight: 15g  Packing includes: 32 pieces round chair leg floor protectors WARM TIPS: THE FURNITURE FLOOR PROTECTORS FIT CHAIR LEGS WITH A DIAMETER OF 25-29mm/0.99-1.14INCH,PLEASE CHECKSIZE BEFORE PURCHASE,IF HARD TO FIT IN,YOU CAN TRY TO SOFTEN THEM IN HOT WATER OR CUTTING. Silicone Chair Leg Caps （chair leg protectors） size: 33 * 31 mm/ 1.3 * 1.2 inch;FIT CHAIR LEGS WITH A DIAMETER OF 25-29mm/0.99-1.14INCH,WARM TIPS: 1.PLEASE MEASURE THE SIZE OF YOUR CHAIR LEGS CAREFULLY; 2.PLEASE CHOOSE THE CORRECT SIZE TO YOUR FURNITURE LEGS(4 SIZE IN THIS LISTING) The furniture foot covers color: transparent and brown;The table leg floor protectors Shape: round; Material: silicone and non woven fabrics No need to stick, simple to wrap and not easy to fall off Protects both chair table legs and floor from damage; Anti-slip bottom pad prevents scratches WARM TIPS: Not satisfied with our furniture foot covers? Please contact with our customer service. We guarantee 90-day no-hassle refund!",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_41",
    "title": "Bowflex Weight Bench Series",
    "price": 199.0,
    "rating": 4.6,
    "rating_count": 4928,
    "image_url": "https://m.media-amazon.com/images/I/41G4LBNCexL._AC_.jpg",
    "description": "Space-saving design 4 different adjustment angles for total versatility: -20°, 0°, 45° 90° Seat adjustment for maximum exercise options and comfort 480-pound load capacity Dimensions: 61\" L x 27.1\" W x 41.2\" H (155 x 69 x 104.7 cm) Stowed Dimensions: 27.2\" L x 23.4\" W x 53.2\" H (69 x 59.5 x 135.2 cm)",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_42",
    "title": "FOCO NFL Colored Palm Utility Work Gloves",
    "price": 11.99,
    "rating": 4.7,
    "rating_count": 7424,
    "image_url": "https://m.media-amazon.com/images/I/41KUmpXyBjL._AC_.jpg",
    "description": "100% Polyester Imported Made of high-quality vinyl Features team colored beaded palm Durable design for comfort, while completing your household and utility needs Features rib-knit wrist cuffs so the gloves fit perfectly Measures 10\" x 5\", One Size fits most",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_43",
    "title": "Radians OP6710ID Safety Glasses, multi, one size",
    "price": 6.0,
    "rating": 4.6,
    "rating_count": 4604,
    "image_url": "https://m.media-amazon.com/images/I/31bzraBI+1L._AC_.jpg",
    "description": "Optima safety eyewear by Radians safety gives you a superior lightweight frame with a rubber nose piece and dual Mold Rubber Temples for a non-slip grip. The Optima safety glass is made of high-impact polycarbonate material that is hard-coated to help prevent scratching while providing 99% UVA & UVB protection. Dielectric frame has an adjustable nose piece for a more customized and comfortable fit. Optima safety eyewear meets or exceeds ANSI Z87. 1 impact standards. Pink frame with pink adjustable nosepiece, clear lens. Sold individually. High-impact Polycarbonate lens Imported Safety Glasses The Package Height Of The Product Is 15.01 Centimeters The Package Length Of The Product Is 0.79 Centimeters The Package Width Of The Product Is 8.41 Centimeters",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_44",
    "title": "Lutron Claro 2 Gang Decorator/Rocker Wallplate, Gloss, Almond (1-Pack) | CW-2-AL",
    "price": 7.93,
    "rating": 4.8,
    "rating_count": 4450,
    "image_url": "https://m.media-amazon.com/images/I/21YeqqwxJ0L._AC_.jpg",
    "description": "Product Description Claro decorative wall plates are a simple and elegant solution designed to match your existing decorator opening dimmers, switches and accessories. They feature a clean appearance with no visible screws and mount flush to the wall. Claro wall plates are oversized to hide gaps around wall boxes and attach securely and snugly in place regardless of the wall condition. Claro wall plates are easy to install. Simply separate the front and back plates, attach the back plate to the wall with the screws provided and snap on the front plate for a clean and sophisticated look in just minutes. From the Manufacturer Claro wall plates are a simple and elegant solution designed to match your existing decorator opening dimmers, switches and accessories. They feature a clean appearance with no visible screws and mount flush to the wall. Claro wall plates are oversized to hide gaps around wall boxes and attach securely and snugly in place regardless of the wall condition. Claro wall plates are easy to install. Simply separate the front and back plates, attach the back plate to the wall with the screws provided and snap on the front plate for a clean and sophisticated look in just minutes. Features a clean appearance with no visible screws and securely mounts flush to the wall For use with all decorator opening devices - dimmers, switches and accessories Durable plastic counstruction for long-lasting style Snap-on installation is quick and easy Fits Caseta, Diva, Maestro, Maestro sensors, Skylark, and more Gloss finish; available in over 20+ colors",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_45",
    "title": "Leviton T5320-W Straight Blade Tamper Resistant Duplex Receptacle, 125 V, 15 A, 2 Pole, 3 Wire, 1 Pack, White",
    "price": 1.5,
    "rating": 4.7,
    "rating_count": 4373,
    "image_url": "https://m.media-amazon.com/images/I/41USTeBPfAL._AC_.jpg",
    "description": "Product Description Leviton T5320-W straight blade tamper resistant duplex receptacle, 125 V, 15 A, 2 pole, 3 wire, 1 pack, white. From the Manufacturer Leviton's duplex receptacles are designed for a chic appearance, quick installation and durability. The impact-resistant thermoplastic design allows for a long service life and high performance in homes, offices, schools and other settings. 15 Amp, 125 Volt, Tamper Resistant, Duplex Receptacle, Residential Grade, Grounding, White. Shutter mechanism inside the receptacle blocks access to the contacts unless a 2-prong plug is inserted, helping ensure hairpins, keys, etc., will be locked out TR symbol on residential receptacles assures they meet the 2008 NEC requirement Ultrasonic heavy-duty construction offers long, trouble-free service life Heavy-gauge, rust-resistant steel mounting strap. Quickwire push-in and side wiring for easy installation Shallow design for maximum wiring room. Terminal screws accept up to No.12 AWG copper or copper-clad wire and Quickwire push-in terminals accept No.14 AWG solid copper wire only Wallplate sold separately",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_46",
    "title": "Walker's Unisex Adult's Lightweight Foldable Hearing Protection 22 dB Noise Reduction Pro Low-Profile Earmuffs",
    "price": 11.5,
    "rating": 4.5,
    "rating_count": 7060,
    "image_url": "https://m.media-amazon.com/images/I/31fjLAHFE2L._AC_.jpg",
    "description": "The Walkers Pro Low Profile Folding Passive Earmuffs features a low profile contoured cup that lets them fit closer to your head - ideal for hunting and other active shooting activities where the last thing you need to worry about is snagging your hearing protection on a branch. The Walkers Low Profile Folding Earmuff are passive hearing protection muffs that give you up to 22 NRR of noise reduction. These hearing protectors have a padded headband for comfortable fit, combined with soft PVC ear pads that will let you wear them all day. Walker's Passive Folding Muff: FEATURES AND BENEFITS: - Low profile contoured cup; - Padded headband for comfortable fit; - Noise reduction rating, NRR 22 dB; - Soft PVC ear pads; - Compact folding design; - Ultra-light weight; - Compact folding design; ABOUT WALKERS HEAR LIKE YOU'VE NEVER HEARD BEFORE For over 25 years Walker's has developed innovative solutions to provide ear protection for shooting, hunting, and commercial applications. Walker's line of products is widely considered the industry standard for shooting ear protection and safety. With the introduction of advanced digital circuitry & nano tech water repellence, Walker's continues to raise the bar and provide the best shooting hearing protection. Plastic Imported NOISE REDUCTION EARMUFFS - Walker's Pro Low Profile Folding Earmuffs provide the powerful hearing protection you need for shooting any type of gun, or for working with heavy machinery, from sustained sound and loud noises COMFORTABLE & SECURE FIT - Low profile contoured cups minimize interference with your gun stock so you can focus on your target; A padded headband and soft PVC ear pads ensure a comfortable fit for long days at the shooting range BLOCK HAZARDOUS NOISE - Walker's Pro Low Profile Ear Muffs have a noise reduction rating of NRR 22dB, and are rated at ANSI S3.19 MULTI-PURPOSE PROTECTION - Along with offering ear protection for hunting and shooting, Walker's earmuffs have a wide range of application",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_47",
    "title": "Ravinte 40 Pack 5 Inch Kitchen Square Cabinet Handles Matte Black Cabinet Pulls Black Drawer Pulls Kitchen Cabinet Hardware Kitchen Handles for Cabinets Cupboard Handles Drawer Handles",
    "price": 71.99,
    "rating": 4.8,
    "rating_count": 6452,
    "image_url": "https://m.media-amazon.com/images/I/31nsjKcYN0L._AC_.jpg",
    "description": "Risk-free 365 Days trail:We're confident you 'll love your Ravinte handles,So we give you 365 days to try it on us or pick it up and give you a full refund. If you're replacing your handle, measure and ensure the center to center hole spacing of the current handle is 5 inches. Installing new cabinet handles, drill two holes with center to center spacing of 5 inches. Size of cabinet hardware: Overall Length: 5-1/2 inch; Width: 1/2 inch;Thickness:1/2 inch;Projection: 1-2/5 inch; Screw-hole center: 5 inch. Durable design& fine touch: With advanced technique, the drawer pulls is made to be long lasting, accompanied with good looking and fine touch. Simple look: The Black cabinet handles have a wide appeal across a range of kitchen cabinet doors and drawers. The Matte Black handles have a clean and timeless look that works with farmhouse, vintage, traditional and transitional styles.",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_48",
    "title": "SR SUN RISE Shower System with Push Button Diverter Bathroom Luxury 12 Inch Rain Shower Head with Handheld Spray, High Pressure Shower Faucet Combo Set with Rough-in Valve & Trims, Brushed Nickel",
    "price": 269.99,
    "rating": 4.6,
    "rating_count": 4086,
    "image_url": "https://m.media-amazon.com/images/I/41Wxp4uQ6VL._AC_.jpg",
    "description": "Upgrade Push Button Diverter: Different from the traditional square water diverter knob, the press button diverter will be easier to operate. When bathing, your hands will be covered with soap, and this press button diverter will not become slippery like the knob version. 3-Modes Shower Experience: This upgraded version of the water diverter can achieve 3- functions of water discharge. You can use the rain shower alone or hand-held, or you can use the rain shower and hand-held at the same time. Prevent Water Hammer: This pressure balance valve has built-in two check valves to effectively eliminate water hammer noise. Pressure balance valve's cartridge monitors water pressure balance, helping to protect you from being scalded by sudden changes in hot or cold water pressure. All Metal: Square rain shower head and hand shower wand are made from stainless steel and brass. Rough-in Valve is made of solid brass with a embedded box to help with installation. METAL construction is more durable than plastic, and provides a longer service life. Install with Confidence: SR SUN RISE Shower System has cUPC Certification and compliance with the following standard(s): ASME A112.18.1-2018/CSA B125.1-18. Designed for use with standard 1/2\" U.S. plumbing connections. Approved by the California Energy Commission. 100% Satisfaction Support: 10 Years Warranty, any product quality problem can be guaranteed free of charge and shower cartridge is permanently replaced free of charge. SR SUN RISE always stand by each consumers. Please feel free to contact us if any question, we will respond within 24 hours. Ultimate High Pressure Shower: Thanks to the ultra-thin design of the rain shower, even in a low water pressure environment, when the water flows out after being squeezed through the ultra-small space, it can also achieve a high water pressure rain shower experience. Brushed Nickel Finish: Anti-fingerprint, and it has passed the Salt Spray Test. Maintains original gloss even in wet bathro",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  },
  {
    "sku": "tools_and_home_improvement_49",
    "title": "Amazon Basics Deadbolt - Single Cylinder - Matte Black",
    "price": 14.24,
    "rating": 4.5,
    "rating_count": 6756,
    "image_url": "https://m.media-amazon.com/images/I/31TYucDp93L._AC_.jpg",
    "description": "Product Description Amazon Basics Deadbolt - Single Cylinder - Matte Black From the Manufacturer Amazon Basics Easy installation with Phillips head screwdriver Universal handing; fits both right-handed and left-handed doors Fits all doors 1-3/8\" to 1-3/4\" in thickness 6-way adjustable latch to fit any 2-3/8\" or 2-3/4\" backset Certified Grade-3 Security by ANSI/BHMA",
    "sponsored": false,
    "best_seller": false,
    "overall_pick": false,
    "low_stock": false
  }
]